     A*     VENDOR ADDITIONS
     A*     FILE NAME - ADDVEND
     A*
     A                                      UNIQUE
     A          R RADDVEND                  TEXT('VENDOR X-REF')
     A            AOLDNO         5A         TEXT('OLD #')
     A                                      COLHDG('Old #')
     A            STATUS         1A         TEXT('STATUS')
     A                                      COLHDG('Status')
     A*
     A          K AOLDNO
