     A                                      UNIQUE
     A          R RCHGSIZFIL                TEXT('ITEM SIZE CHANGE FILES')
     A            CFFILE        10A         TEXT('FILE NAME')
     A                                      COLHDG('File Name')
     A            CFITEM        10A         TEXT('ITEM Field Name')
     A                                      COLHDG('Item' 'Field' 'Name')
     A            CFSIZE        10A         TEXT('SIZE Field Name')
     A                                      COLHDG('SIZE' 'Field' 'Name')
     A          K CFFILE
