     A          R RCURRENT                  TEXT('CURRENT SEASONS')
     A            SEASON         2S 0       TEXT('SEASON CODE')
     A                                      COLHDG('ACTIVE' 'SEASON' 'CODE')
