     A*     CUSTOMER X-REF FILE
     A*     FILE NAME - DOLDNO   BY NEW NUMBER
     A*
     A                                      UNIQUE
     A          R ROLDNO                    PFILE(DOLDNO)
     A*
     A          K NEWNO
