     A*     CUSTOMER X-REF FILE
     A*     FILE NAME - DOLDNO
     A*
     A                                      UNIQUE
     A          R ROLDNO                    TEXT('CUSTOMER X-REF')
     A            OLDNO          5A         TEXT('OLD #')
     A                                      COLHDG('Old #')
     A            NEWNO          6S         TEXT('NEW CUST #                 ')
     A                                      COLHDG('New Cust #')
     A*
     A          K OLDNO
