      **  400 TO 36 USER ID XREF FILE
      **              FILE NAME F400USR
      **
     A                                      UNIQUE
     A          R R400USR                   PFILE(F400USR)
      *
     A          K R436ID
