     A*     INVENTORY ALLOCATION DETAIL FILE  BY LOT NUMBER
     A*     FILE NAME - FALITEML
     A*
     A
     A          R RALITEM                   PFILE(FALITEM)
     A*
     A          K AIORD#
     A          K AIOSEQ
     A          K AICUST
     A          O AIQTOA                    COMP(EQ 0)
