      *     INVENTORY ALLOCATION DETAIL FILE  BY LOT NUMBER
      *     FILE NAME - FALITEML
      * :ORD# OSEQ ITEM SIZE SOWD CRDY CUST GLOC
     A
     A          R RALITEM                   PFILE(FALITEM)
      *
     A          K AIORD#
     A          K AIOSEQ
     A          K AIITEM
     A          K AISIZE
     A          K AISOWD
     A          K AICRDY
     A          K AICUST
     A          K AIGLOC
      *
     A          O AIQTOA                    COMP(EQ 0)
