     A*     INVENTORY ALLOCATION DETAIL FILE  BY LOT NUMBER
     A*     FILE NAME - FALITEML BY LOTRD KEY
     A*          ITEM SIZE CRDY SOWD GLOC CUST
     A
     A          R RALITEM                   PFILE(FALITEM)
     A*
     A          K AIITEM
     A          K AISIZE
     A          K AICRDY
     A          K AISOWD
     A          K AIGLOC
     A          K AICUST
