     A*     INVENTORY ALLOCATION DETAIL FILE BY ITEM, SIZE, READY DATE
     A*     FILE NAME - FALITEML
     A*
     A
     A          R RALITEM                   PFILE(FALITEM)
     A*
     A          K AIITEM
     A          K AISIZE
     A          K AICRDY
