     A*     INVENTORY ALLOCATION DETAIL FILE  BY LOT NUMBER
     A*     FILE NAME - FALITEML BY LOTRD KEY
     A*          ORD# OSEQ ITEM SIZE CRDY GLOC CUST
     A
     A          R RALITEM                   PFILE(FALITEM)
     A*
     A          K AIORD#
     A          K AIOSEQ
     A          K AIITEM
     A          K AISIZE
     A          K AICRDY
     A          K AIGLOC
     A          K AICUST
