     A*     INVENTORY ALLOCATION DETAIL FILE  BY LOT NUMBER
     A*     FILE NAME - FALITEML
     A*
     A
     A          R RALITEM                   PFILE(FALITEM)
     A*
     A          K AIORD#
     A          K AIOSEQ
     A          K AIITEM
     A          K AISIZE
     A          K AISOWD
     A          K AIGLOC
     A          K AICUST
     A          K AISHPD
