     A*     INVENTORY ALLOCATION DETAIL FILE  BY ORDER # AND SEQ #
     A*     FILE NAME - FALITEML
     A*
     A
     A          R RALITEM                   PFILE(FALITEM)
     A*
     A          K AIORD#
     A          K AIOSEQ
