     A*     A/P CHECK FILE
     A*     FILE NAME - FAPCHK
     A*                 LOGICAL FILE FOR CHECK PRINTING
     A*
     A                                      FIFO
     A          R RAPCHK                    PFILE(FAPCHK)
     A*
     A          K ACCOMP
     A          K ACVEND
     A          K ACVOUC
