     A*     A/P PAYMENT HISTORY FILE
     A*     KEY = VENDOR ALPHA, VENDOR NUMBER, CHECK NUMBER
     A*     FILE NAME - FAPDTP
     A*
     A                                      FIFO
     A          R RAPDTP                    PFILE(FAPDTP)
     A*
     A          K ATCOMP
     A          K ATLOOK
     A          K ATVEND
     A          K ATCHEK
