     A*     A/P DETAIL TRANSACTIONS FILE
     A*     KEY = CO, G/L NUMBER, ACCTG PERIOD
     A*     FILE NAME - FAPDET
     A*
     A                                      FIFO
     A          R RAPDET                    PFILE(FAPDET)
     A*
     A          K ADCOMP
     A          K ADGLA1
     A          K ADAPER
     A          K ADVOUC
     A          K ADINV#
