     A*     A/P PAYMENT HISTORY FILE
     A*     KEY = CENTURY DATE, VENDOR NUMBER
     A*     FILE NAME - FAPDTP
     A*
     A                                      FIFO
     A          R RAPDTP                    PFILE(FAPDTP)
     A*
     A          K ATLOOK
     A          K ATVEND
     A          K ATCYMD                    DESCEND
