     A*     A/P MONTHLY DISBURSEMENTS FILE
     A*     KEY = CHECK NUMBER
     A*     FILE NAME - FAPMTH
     A*
     A                                      FIFO
     A          R RAPMTH                    PFILE(FAPMTH)
     A*
     A          K AMCHEK
