     A*     A/P BATCH STATUS FILE
     A*     FILE NAME - FAPCTLB
     A*
     A                                      UNIQUE
     A          R RAPNXTWIR                 TEXT('A/P WIRE CNTRL.')
     A            NWCOMP         2S 0       TEXT('COMPANY NUMBER')
     A                                      COLHDG('Co' '#')
     A            NWWIRE         6S 0       TEXT('NEXT WIRE')
     A                                      COLHDG('NEXT' 'WIRE')
     A          K NWCOMP
