     A*     A/P OPEN FILE
     A*     FILE NAME - FAPOPN
     A*     LOGICAL BY DUE DATE AND VENDOR ALPHA
     A*
     A                                      FIFO
     A          R RAPOPN                    PFILE(FAPOPN)
     A*
     A          K APRVDU
     A          K APVEND
     A          K APVOUC
