     A*     A/P OPEN FILE
     A*     FILE NAME - FAPOPN
     A*                 LOGICAL FILE FOR CHECK DUPLICATE INVOICES
     A*
     A                                      FIFO
     A          R RAPOPN                    PFILE(FAPOPN)
     A*
     A          K APCOMP
     A          K APVEND
     A          K APINV#
     A          K APITYP
