     A*     A/P OPEN FILE
     A*     FILE NAME - FAPOPN
     A*
     A                                      FIFO
     A          R RAPOPN                    PFILE(FAPOPN)
     A*
     A          K APLOOK
     A          K APVEND
     A          K APVOUC
     A          K APINV#
     A          K APSEQ#
