     A*     A/P OPEN FILE
     A*     FILE NAME - FAPOPN
     A*                 LOGICAL FILE FOR CHECK PRINTING
     A*
     A                                      FIFO
     A          R RAPOPN                    PFILE(FAPOPN)
     A*
     A          K APCOMP
     A          K APVEND
     A          K APVOUC
     A          S APTBPD                    COMP(EQ 'Y')
     A          S APCLCD                    COMP(NE 'C')
