     A*     A/P CHECK RECONCILIATION FILE
     A*     FILE NAME - FAPREC
     A*
     A                                      UNIQUE
     A          R RAPREC                    PFILE(FAPREC)
     A*
     A          K AKCOMP
     A          K AKVEND
     A          K AKCHEK
