     A*     A/P VOUCHER ENTRY WORK FILE
     A*     FILE NAME - FAPWK
     A*
     A                                      FIFO
     A          R RAPWK                     PFILE(FAPWK)
     A*
     A          K AWCOMP
     A          K AWVOUC
