     A*     A/P VOUCHER ENTRY WORK FILE
     A*     FILE NAME - FAPWK
     A*
     A                                      FIFO
     A          R RAPWK                     PFILE(FAPWK)
     A*
     A          K AWCOMP
     A          K AWLOOK
     A          K AWVEND
     A          K AWVOUC
     A          K AWINV#
     A          K AWITYP
     A          K AWSEQ#
