     A*     A/R OPEN TEMP WORK FILE
     A*     FILE NAME - FAR210
     A*
     A                                      UNIQUE
     A          R RAR210                    TEXT('A/R OPEN WORK FILE')
     A            W1INV#         6S 0       TEXT('INV #')
     A                                      COLHDG('Inv. Number')
     A                                      EDTCDE(Z)
     A*
     A          K W1INV#
