     A*     A/R COMMENT FILE
     A*     FILE NAME - FARCMNA1
     A*
     A*     LOGICAL FILE INDEXED ON CUSTOMER NUMBER
     A*                             FOLLOW UP DATE (DESCEND)
     A*                             COUNTER
     A*
     A                                      FIFO
     A          R RARCMN                    PFILE(FARCMN)
     A*
     A          K ACCUST
     A          K ACDTFL                    DESCEND
     A          K ACCNTR
