     A*     A/R COMMENT FILE
     A*     FILE NAME - FARCMNA2
     A*
     A*     LOGICAL FILE INDEXED ON CUSTOMER NUMBER
     A*                             ENTRY DATE (DESCEND)
     A*                             COUNTER
     A*
     A                                      FIFO
     A          R RARCMN                    PFILE(FARCMN)
     A*
     A          K ACCUST
     A          K ACDTEN                    DESCEND
     A          K ACCNTR
