     A*     CUSTOMER MONTHLY A/R INFORMATION FILE
     A*     FILE NAME - FARCUST
     A* LOGICAL BY YEAR/MONTH/CUST
     A*
     A                                      UNIQUE
     A          R RARCUST                   PFILE(FARCUST)
     A*
     A          K AMYEAR
     A          K AMMTH
     A          K AMCUST
