     A*     CUSTOMER DPR A/R INFORMATION FILE
     A*     FILE NAME - FARDPRD
     A*     LOGICAL BY YEAR, DECENDING DPR,CUST ALPH
     A
     A          R RARDPR                    PFILE(FARDPR)
     A*
     A          K ADYEAR
     A          K ADDRCU                    DESCEND
     A          K ADLOOK
