     A*     A/R CLOSED FILE
     A*     FILE NAME - FARHIDTE
     A*
     A*     LOGICAL FILE INDEXED ON INVOICE DATE
     A*                             INVOICE NUMBER
     A*
     A                                      FIFO
     A          R RARHIS                    PFILE(FARHIST)
     A*
     A          K AHCUST
     A          K AHDUDT                    DESCEND
     A          K AHINV#
