     A*     A/R CLOSED FILE
     A*     FILE NAME - FARHIDTE
     A*
     A*     LOGICAL FILE INDEXED ON CUSTOMER NUMBER
     A*                             INVOICE NUMBER
     A*                             INVOICE DATE
     A*
     A                                      FIFO
     A          R RARHIS                    PFILE(FARHIST)
     A*
     A          K AHSHCU
     A          K AHINV#
     A          K AHTDAT
