     A*     A/R CLOSED FILE
     A*     FILE NAME - FARHSTL2
     A*
     A*     LOGICAL FILE INDEXED ON INVOICE DATE
     A*                             CUSTOMER NUMBER
     A*
     A                                      FIFO
     A          R RARHIS                    PFILE(FARHIST)
     A*
     A          K AHTDAT
     A          K AHCUST
