     A*     A/R OPEN FILE
     A*     FILE NAME - FAROPN
     A*
     A                                      UNIQUE
     A          R RAROPN                    PFILE(FAROPN)
     A*
     A          K ARCUST
     A          K ARINV#
     A          K ARSUFF
     A          K ARSEQ#                    DESCEND
