     A*     A/R OPEN FILE
     A*     FILE NAME - FAROPNCD
     A*
     A*     LOGICAL FILE INDEXED ON CUSTOMER NUMBER
     A*                             TRANSACTION DATE
     A*                             INVOICE NUMBER, SUFF, SEQ#
     A*
     A                                      FIFO
     A          R RAROPN                    PFILE(FAROPN)
     A*
     A          K ARCUST
     A          K ARTDAT
     A          K ARINV#
     A          K ARSUFF
     A          K ARSEQ#
