     A*     A/R OPEN FILE
     A*     FILE NAME - FAROPNSL
     A*
     A*     LOGICAL FILE INDEXED ON SALESPERSON
     A*                             CUSTOMER ALPHA
     A*                             INVOICE NUMBER
     A*
     A                                      FIFO
     A          R RAROPN                    PFILE(FAROPN)
     A*
     A          K ARSLM1
     A          K ARLOOK
     A          K ARCUST
     A          K ARINV#
