     A*     A/R OPEN FILE
     A*     FILE NAME - FAROPNAL
     A*
     A*     LOGICAL FILE INDEXED ON CUSTOMER ALPHA
     A*                             INVOICE NUMBER
     A*
     A                                      FIFO
     A          R RAROPN                    PFILE(FAROPN)
     A*
     A          K ARLOOK
     A          K ARCUST
     A          K ARINV#
