     A*     A/R OPEN FILE
     A*     FILE NAME - FAROPNAL
     A*
     A*     LOGICAL FILE FOR DILLON STATEMENTS
     A*                             SHIP TO
     A*
     A                                      FIFO
     A          R RAROPN                    PFILE(FAROPN)
     A*
     A          K ARCUST
     A          K ARSHCU
     A          K ARTDAT
     A          K ARTTYP
     A          K ARCHEK
     A          K ARINV#
     A          K ARSUFF
