     A*     A/R OPEN FILE
     A*     FILE NAME - FAROPNCC
     A*
     A*     LOGICAL FILE INDEXED ON INVOICE NUMBER, SEQ#, SUFF
     A*
     A*
     A*
     A                                      FIFO
     A          R RAROPN                    PFILE(FAROPN)
     A*
     A          K ARINV#
     A          O ARSEQ#                    COMP(NE 0)
     A          O ARSUFF                    COMP(NE '  ')
