     A*     A/R TOTAL FILE
     A*     FILE NAME - FARTOT
     A*     LOGICAL BY ZIP,ALPHA,CUST #
     A*
     A                                      UNIQUE
     A          R RARTOT                    PFILE(FARTOT)
     A*
     A          K RTZIP
     A          K RTLOOK
     A          K RTCUST
