     A*     A/R TOTAL FILE
     A*     FILE NAME - FARTOT
     A*     LOGICAL BY CUST #
     A*
     A                                      UNIQUE
     A          R RARTOT                    PFILE(FARTOT)
     A*
     A          K RTCUST
