     A*     A/R TRANSACTION FILE
     A*     FILE NAME - FARWRINV - LF BY INV DATE AND NUMBER
     A*
     A
     A          R RARWRK                    PFILE(FARWRK)
     A*
     A          K ATCOMP
     A          K ATTDAT
     A          K ATINV#
