     A*     A/R TRANSACTION FILE
     A*     FILE NAME - FARWRKA
     A*
     A
     A          R RARWRK                    PFILE(FARWRK)
     A*
     A          K ATCUST
     A          K ATTDAT
     A          K ATINV#
     A          K ATSUFF
     A          K ATSEQ#
