     A*     A/R AUTHORIZED TO VIEW CREDIT CARD INFO
     A*     FILE NAME - FAUTCC
     A*
     A                                      UNIQUE
     A          R RAUTCC                    TEXT('A/R AUTH CC')
     A            AUUSER        10A         TEXT('AUTHORIZED USER')
     A                                      COLHDG('AUTHORIZED' 'UDER ID')
     A          K AUUSER
