     A*     CALENDAR FILE
     A*     FILE NAME - FCALENCY
     A* LOGICAL BY CYMD
     A*
     A                                      UNIQUE
     A          R RCALEN                    PFILE(FCALEN)
      *
     A          K CLCENT
     A          K CLYEAR
     A          K CLWEEK
     A          O CL#Y                      COMP(NE 1)
