     A*     CALENDAR FILE
     A*     FILE NAME - FCALEX
     A* LOGICAL BY CENTURY,YEAR,WEEK, AND DAY #
     A*
     A                                      UNIQUE
     A          R RCALEN                    PFILE(FCALEN)
      *
     A          K CLCENT
     A          K CLYEAR
     A          K CLWEEK
     A          K CL#Y
