     A*     CALENDAR FILE
     A*     FILE NAME - FCALENCY
     A* LOGICAL BY CYMD
     A*
     A                                      UNIQUE
     A          R RCALEN                    PFILE(FCALEN)
      *
     A          K CLCYMD
