     A*     CART FILE
     A*     FILE NAME - FCARTCC
     A* LOGICAL BY SHIP CART #,CONTROL #,TAG#
     A*
      * Modified by William Behr for Project PS2013.
     A
     A          R RCART                     PFILE(FCART)
      *
     A          K CTCART
     A          K CTCNTL
     A          K CTTAG#
