     A*     CART FILE
     A*     FILE NAME - FCARTST
     A* LOGICAL BY TAG #
     A*
     A
     A          R RCARTS                    PFILE(FCARTS)
      *
     A          K CTTAG#
