     A*     CART FILE
     A*     FILE NAME - FCARTCS
     A* LOGICAL BY SHIP DATE, CART #
     A*
      * Modified by William Behr for Project PS2013.
     A
     A          R RCART                     PFILE(FCART)
      *
     A          K CTSHDT
     A          K CTMAST
     A          K CTITEM
     A          K CTSIZE
     A          K CTORD#
