     A*     CART FILE
     A*     FILE NAME - FCARTCS
     A* LOGICAL BY: PSDT MAST CART
     A*
      * Modified by William Behr for Project PS2013.
     A
     A          R RCART                     PFILE(FCART)
      *
     A          K CTPSDT
     A          K CTMAST
     A          K CTCART
