     A          R RCARTDT                   TEXT('Carts Details File')
     A                                      PFILE(FCARTDT)
     A          K CDCARD
     A          O CDATTT                    COMP(NE     -
     A                                        '0001-01-01-00.00.00.000000')
     A          O CDCARD                    COMP(EQ 0)
     A          O CDDATE                    COMP(LT '2006-08-01')
