     A                                      UNIQUE
     A          R RCARTDT                   TEXT('Carts Details File')
     A                                      PFILE(FCARTDT)
     A          K CDTIME
