     A*     CART FILE
     A*     FILE NAME - FCARTCC
     A* LOGICAL BY SHIP CART #,CONTROL #,ITEM,SIZE,TAG#
     A*
      * Modified by William Behr for Project PS2013.
     A
     A          R RCART                     PFILE(FCART)
      *
     A          K CTPSDT
     A          K CTMAST
     A          K CTCART
     A          K CTCNTL
     A          K CTITEM
     A          K CTSIZE
     A          K CTCSEQ
