     A*     CHEMICAL WEEKLY JOB FILE
     A*     FILE NAME - FCHMJOB
     A* LOGICAL BY ITEM,SIZE,READY DATE
     A*
     A
     A          R RCHMJOB                   PFILE(FCHMJOB)
     A*
     A          K CJITEM
     A          K CJSIZE
     A          K CJRDYD
     A          K CJWKDT
