     A*     CHEMICAL WEEKLY JOB FILE
     A*     FILE NAME - FCHMJOB
     A* LOGICAL BY WEEK,USER,JOB # (DESCEND)
     A*
     A                                      UNIQUE
     A          R RCHMJOB                   PFILE(FCHMJOB)
     A*
     A          K CJWKDT
     A          K CJUSER
     A          K CJJOB#                    DESCEND
