     A*     CHEMICAL WEEKLY SPRAYER RUN HEADER FILE
     A*     FILE NAME - FCHMTOT
     A*
     A*
     A          R RCHMTOT                   PFILE(FCHMTOT)
     A*
     A          K CTWKDT
