     A*     CHEMICAL WEEKLY JOB FILE
     A*     FILE NAME - FCHMJOB
     A* LOGICAL BY WEEK,SPRAY,PPM,BAY,ETC
     A*
     A
     A          R RCHMJOB                   PFILE(FCHMJOB)
     A*
     A          K CJWKDT
     A          K CJSPIT
     A          K CJPPM
     A          K CJHSE
     A          K CJSECT                    DESCEND
     A          K CJBAY
     A          K CJNOS
     A          K CJSPKY
