     A*     CHEMICAL WORK FILE
     A*     FILE NAME - FCHMWRK
     A*
     A*
     A                                      FIFO
     A          R RCHMWRK                   PFILE(FCHMWRK)
      ***
     A          K CWALPH
     A          K CWITEM
     A          K CWPPM
     A*
