     A*     CHEMICAL WEEKLY SPRAYER RUN HEADER FILE
     A*     FILE NAME - FCHMTOT1
     A*
     A*
     A                                      UNIQUE
     A          R RCHMTOT1                  PFILE(FCHMTOT1)
     A*
     A          K CTWKDT
     A          K CTLOOK
     A          K CTSPRY
     A          K CTSPIT
     A          K CTPPM
     A*
