     A*     APPLICATOR NAME CONTROL FILE
     A*     FILE NAME - FCHMSPY
     A*
     A*
     A                                      UNIQUE
     A          R RCHMSPY                   TEXT('APPLICATOR NAME  FILE')
      ** THE FOLLOWING IS THE NAME OF THE APPLICATOR.
     A            CHMSNM        10A         TEXT('SPRAYER NAME')
     A                                      COLHDG('NAME')
     A*
     A          K CHMSNM
