     A*     SPRAYER WEEKLY CONTROL FILE
     A*     FILE NAME - FCHMRUN
     A*
     A*
     A          R RCHMRUN                   PFILE(FCHMRUN)
     A*
     A          K CRWKDT
     A          K CRSPIT
     A          K CRPPM
