     A*      CREDIT MEMO REASON FILE
     A*      FILE NAME - FCMREASC
     A*
     A*
     A                                      FIFO
     A          R RCMREAS                   PFILE(FCMREAS)
     A*
     A          K CRREAS
