     A*     COMMISSION SALES BREAKDOWN FILE
     A*     FILE NAME - FCOMSLSD
     A*   BY DEPT, USER, DPC, CUST ALPHA
     A*
     A                                      FIFO
     A          R RCOMSLS                   PFILE(FCOMSLS)
     A*
     A          K WSSHFR
     A          K WSUSER
     A          K WSDPC
     A          K WSLOOK
     A          K WSCUST
