     A*     COMMISSION MASTER FILE
     A*     FILE NAME - FCOMWRK
     A*
     A*
     A                                      UNIQUE
     A          R RCOMWRK                   PFILE(FCOMWRK)
     A*
     A          K WOARCU
     A          K WOCUST
