     A*     COMMISSION MASTER FILE
     A*     FILE NAME - FCOMWRKF
     A*  LOGICAL BY L.V. SLSMN,DPC,CUST ALPHA,CUST #
     A*
     A
     A          R RCOMWRK                   PFILE(FCOMWRK)
     A*
     A          K WOUSEL
     A          K WODPC                     DESCEND
     A          K WOLOOK
