     A*     COMMISSION MASTER FILE
     A*     FILE NAME - FCOMWRKF
     A*  LOGICAL BY P.K. SLSMN,DPC,CUST ALPHA,CUST #
     A*
     A
     A          R RCOMWRK                   PFILE(FCOMWRK)
     A*
     A          K WOUSEP
     A          K WODPC                     DESCEND
     A          K WOLOOK
