     A*     COMMISSION MASTER FILE
     A*     FILE NAME - FCOMWRKF
     A*  LOGICAL BY SUPPLY SLSMN,DPC,CUST ALPHA,CUST #
     A*
     A
     A          R RCOMWRK                   PFILE(FCOMWRK)
     A*
     A          K WOUSES
     A          K WODPC                     DESCEND
     A          K WOLOOK
