     A                                      UNIQUE
     A          R RCRTORD                   PFILE(FCRTORD)
     A          K COORD#
     A          K COCART
