     A                                      UNIQUE
     A          R RMSECT                    PFILE(FCSECT)
     A          K GHSECT
     A          K GHBAY
     A          K GHNORS
     A          K GHEORW
     A          O GHUSED                    COMP(NE 'Y')
