     A*     Dillon Sys/36 Customer Branch Info File
     A*     FILE NAME - FCUSBRCH
     A*    LOGICAL BY OLD NUMBER AND BRANCH
     A                                      FIFO
     A          R RCUSBRCH                  PFILE(FCUSBRCH)
      *
     A          K CBCUSO
     A          K CBBR
