     A*      CUSTOMER COMMENTS  FILE
     A*      FILE NAME - FCUSTCOM
     A*
     A* SEQ 01 is used in the Customer Master Maintenance Program
     A*
     A          R RCUSTCOM                  TEXT('CUSTOMER COMMENTS')
     A                                      PFILE(FCUSTCOM)
     A*
     A          K CCUST
     A          K CCSEQ
     A          O CCSEQ                     COMP(NE 1)
