     A* PHYSICAL FILE NAME - FCUSBRCH (Customer Branch Info)
     A*  LOGICAL FILE NAME - FCUSBRCS  (BR/USER/YTD SALES DESCEND
     A                                      FIFO
     A          R RCUSBRCH                  PFILE(FCUSBRCH)
      *
     A          K CBBR
     A          K CBUSER
     A          K CBYSLS                    DESCEND
     A          K CBCUSO
