     A* PHYSICAL FILE NAME - FCUSBRCH (Customer Branch Info)
     A*  LOGICAL FILE NAME - FCUSBRCB  (BR/USER/OLDNO)
     A                                      FIFO
     A          R RCUSBRCH                  PFILE(FCUSBRCH)
      *
     A          K CBBR
     A          K CBUSER
     A          K CBCUSO
