     A*     CUSTOMER SALES WORK FILE
     A*     FILE NAME - FCUSTSLS
     A*
     A*
     A                                      UNIQUE
     A          R RCUSTSLS                  PFILE(FCUSTSLS)
     A*
     A          K CSSLS$                    DESCEND
     A          K CSCUST
