     A* PHYSICAL FILE NAME - FCUSBRCH (Customer Branch Info)
     A*  LOGICAL FILE NAME - FCUSBRCA  (BR/USER/CALLTIME/OLDNO)
     A                                      FIFO
     A          R RCUSBRCH                  PFILE(FCUSBRCH)
      *
     A          K CBBR
     A          K CBUSER
     A          K CBCOFF
     A          K CBCUSO
