     A*     CUTTING ORDER FILE
     A*     FILE NAME - FCUTORD
     A*     LOGICAL BY ORDER NUMBER, APLHA, ITEM
     A*
     A
     A          R RCUTORD                   PFILE(FCUTORD)
      *
     A          K COVEND
     A          K COORDD
     A          K COORD#
     A          K COLOOK
     A          K COITEM
     A          K COSIZE
     A          K COSOWD
