     A*     CUTTING SEQUENCE FILE
     A*     FILE NAME - FCUTSEQ
     A*
     A*
     A                                      FIFO
     A          R RCUTSEQ                   PFILE(FCUTSEQ)
      *
     A          K CSVEND
     A          K CSLOOK
