     A          R RCUTORD                   PFILE(FCUTORD)
      *
     A          K COITEM
     A          K COVEND
     A          K COORD#
     A          K COSOWD
