     A*     CUTTING ORDER FILE
     A*     FILE NAME - FCUTORD
     A*     LOGICAL BY VEND, ITEM, SIZE, SOW DATE, ORDER DATE, ORDER #
     A*
     A
     A          R RCUTORD                   PFILE(FCUTORD)
      *
     A          K COVEND
     A          K COITEM
     A          K COSIZE
     A          K COSOWD
     A          K COORDD
     A          K COQTRC                    DESCEND
     A          K COORD#
