     A*     CUTTING CONTROL FILE
     A*     FILE NAME - FCUTCTL
     A*
     A*
     A          R RCUT600                   TEXT('CUT 600')
     A                                      PFILE(FCUT600)
     A          K IMVEND
     A          K IMLOOK
     A          K OIITEM
     A          K OISOW
     A          K OIORD#
