     A*     CUTTING SEQUENCE FILE
     A*     FILE NAME - FCUTSEQ
     A*
     A*
     A                                      FIFO
     A          R RCUTVEND                  PFILE(FCUTVEND)
      *
     A          K CVLOOK
