     A*     84 TRAY DELETE/CHANGED ORDERS FOR CUTTINGS
     A*     FILE NAME - FCUTDELD
     A*     LOGICAL BY CHG DATE,ORDER NUMBER, ITEM
     A*
     A
     A          R RCUTDEL                   PFILE(FCUTDEL)
      *
     A          K CDVEND
     A          K CDCHDT
     A          K CDORD#
     A          K CDITEM
     A          K CDTIME
