     A*     CUTTING ORDER FILE
     A*     FILE NAME - FCUTORD
     A*     LOGICAL BY ORDER NUMBER, APLHA, ITEM
     A*
     A*     USE SOW DATE BEFORE VEND ALPHA 12/06/01
     A
     A          R RCUTORD                   PFILE(FCUTORD)
      *
     A          K COVEND
     A          K COORD#
     A          K COSOWD
     A          K COVNAL
     A          K COLOOK
     A          K COITEM
     A          K COSIZE
