     A*     CUTTING NEED FILE
     A*     FILE NAME - FCUTNEDA
     A*    LOGICAL BY ALPHA ETC
     A*
     A
     A          R RCUTNEED                  PFILE(FCUTNEED)
      *
     A          K CNVEND
     A          K CNSTAT
     A          K CNRYMD
     A          K CNLOOK
     A          K CNITEM
     A          K CNSIZE
     A          K CNSOWD
