     A*     CUTTING ORDER FILE
     A*     FILE NAME - FCUTORD
     A*     LOGICAL BY ORDER NUMBER, SOW DATE, ITEM
     A*
     A
     A          R RCUTORD                   PFILE(FCUTORD)
      *
     A          K COVEND
     A          K COORD#
     A          K COSOWD
     A          K COITEM
