     A*     CUTTING LOT FILE
     A*     FILE NAME - FCUTLOTA
     A*     LOGICAL BY ALPHA, ITEM, SOW DATE
     A*
     A
     A          R RCUTLOT                   PFILE(FCUTLOT)
      *
     A          K CLLOOK
     A          K CLITEM
     A          K CLSOWD
