     A*     CUTTING ORDER FILE
     A*     FILE NAME - FCUTORD
     A*     LOGICAL BY SOW DATE, APLHA, ITEM
     A*
     A
     A          R RCUTORD                   PFILE(FCUTORD)
      *
     A          K COVEND
     A          K COSOWD
     A          K COVNAL
     A          K COLOOK
     A          K COITEM
     A          K COSIZE
