     A*     INTER-DEPT MEMO PRINT FILE
     A*     FILE NAME - FDILMSG
     A*
     A*            NAME OF THIS FORMAT:  "RDILMSG"
     A          R RDILMSG                   TEXT('RDILMSG')
     A*
     A            RDLMSG        80A         TEXT('MSG TXT')
     A                                      COLHDG('MSG''TEXT')
