     A*     INVENTORY LOT BALANCE READY DATE FILE
     A* LOGICAL FILE - PARTIAL TRAY - ALLOCATED
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A*
     A          K LRITEM
     A          K LRSIZE
     A          K LRCRDY
     A          K LRSOWD
     A          K LRGLOC
     A          K LRCUST
     A          O LRQTAL                    COMP(LE 0)
     A          O LRCUST                    COMP(NE 999997)
