     A*     INVENTORY LOT BALANCE READY DATE FILE
     A* LOGICAL FILE - ALL RECORDS
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A*
     A          K LRITEM
     A          K LRSIZE
     A          K LRCRDY
     A          K LRSOWD
     A          K LRGLOC
     A          K LRCUST
     A          O LRCUST                    COMP(EQ 999990)
