     A*     INVENTORY LOT BALANCE READY DATE FILE
     A* LOGICAL FILE - CUTOMER AVAILABILITY (NOT R.B.)
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A*
     A          K LRITEM
     A          K LRSIZE
     A          K LRCRDY
     A          K LRSOWD
     A          K LRCUST
     A          K LRGLOC
     A          O LRQTAL                    COMP(GE LRQTOH)
     A          O LRGLOC                    COMP(EQ 'R  ')
