     A*     INVENTORY LOT BALANCE READY DATE FILE
     A*     FILE NAME - FDLOTRDD  READY DATE DESCENDING.
     A* LOGICAL FILE
     A                                      FIFO
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A*
     A          K LRITEM
     A          K LRSIZE
     A          K LRCODE
     A          K LRCUST
     A          K LRCRDY                    DESCEND
