     A*     INVENTORY LOT BALANCE FILE
     A*         CRDY:SIZE:ALPH:ITEM
     A          R RDLOT                     PFILE(FDLOT)
     A*
     A          K LDCRDY
     A          K LDSIZE
     A          K LDALPH
     A          K LDITEM
