     A*     INVENTORY LOT BALANCE READY DATE FILE
     A* LOGICAL FILE -  'X' RECORDS
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A*
     A          K LRITEM
     A          K LRSIZE
     A          K LRCRDY
     A          K LRSOWD
     A          K LRCUST
     A          O LRGLOC                    COMP(NE 'X')
