     A*     INVENTORY LOT BALANCE FILE
     A*     KEY = SOW LOC, ITEM, SIZE
     A*     FILE NAME - FDLOTLOC
     A*         ITEM:SIZE:WHSE:SOWD:CRDY
     A                                      FIFO
     A          R RDLOT                     PFILE(FDLOT)
     A*
     A          K LDITEM
     A          K LDSIZE
     A          K LDWHSE
     A          K LDSOWD
     A          K LDCRDY
