     A*     INVENTORY LOT BALANCE READY DATE FILE
     A* LOGICAL FILE - FOR READY BAY
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A*
     A          K LRCRDY
     A          K LRITEM
     A          K LRSIZE
     A          K LRGLOC
     A          K LRCUST
     A          K LRSOWD
     A          O LRQTAL                    COMP(GE LRQTOH)
     A          O LRCUST                    COMP(EQ 999990)
