     A*     INVENTORY LOT BALANCE READY DATE FILE
     A* LOGICAL FILE - ALLOCATED 'S' RECORDS
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A*
     A          K LRITEM
     A          K LRSIZE
     A          K LRCRDY
     A          K LRSOWD
     A          K LRGLOC
     A          K LRCUST
     A          O LRQTAL                    COMP(EQ 0)
     A          O LRCUST                    COMP(GE 999990)
     A          O LRGLOC                    COMP(NE 'S')
