     A*     INVENTORY LOT BALANCE FILE
     A*     KEY = SOW LOC, ITEM, SIZE
     A*     FILE NAME - FDLOTLOC
     A*         GLOC:ITEM:SIZE
     A                                      FIFO
     A          R RDLOT                     PFILE(FDLOT)
     A*
     A          K LDGLOC
     A          K LDITEM
     A          K LDSIZE
