     A*     INVENTORY LOT BALANCE READY DATE FILE
     A* LOGICAL FILE - AVAILABLE 'R' RECORDS
     A*      KEY: SIZE ALPH ITEM
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A*
     A          K LRSIZE
     A          K LRALPH
     A          K LRITEM
     A          O LRQTAV                    COMP(LE 0)
     A          O LRCUST                    COMP(EQ 999990)
     A          O LRGLOC                    COMP(NE 'R')
