     A*     INVENTORY LOT BALANCE FILE
     A*     KEY = SOW LOC, ITEM, SIZE
     A*     FILE NAME - FDLOTLCC
     A*
     A                                      FIFO
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A*
     A          K LRCLOC
     A          K LRITEM
     A          K LRSIZE
     A          K LRSOWD
