     A*     INVENTORY LOT BALANCE READY DATE FILE
     A*     FILE NAME - FDLOTRDCLT (CUSTOMER LOT)
     A* LOGICAL FILE
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A*
     A          K LRITEM
     A          K LRSIZE
     A          K LRWHSE
     A          K LRSOWD
     A          K LRCRDY
     A          K LRCUST
     A          K LRGLOC
     A          O LRQTOH                    COMP(LE 0)
