     A*     INVENTORY LOT BALANCE FILE
     A*     KEY =  ITEM, SIZE , CUSTOMER ,READY DATE
     A*     FILE NAME - FDLOTIRD
     A*
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A*
     A          K LRITEM
     A          K LRSIZE
     A          K LRCUST
     A          K LRCRDY
     A          K LRGLOC
