     A*     INVENTORY LOT BALANCE READY DATE FILE
     A* LOGICAL FILE - ITEM SIZE CRDY CUST SOWD
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A* ITEM SIZE CRDY CUST SOWD GLOC CLOC CODE
     A          K LRITEM
     A          K LRSIZE
     A          K LRCRDY
     A          K LRCUST
     A          K LRSOWD
     A          K LRGLOC
     A          K LRCLOC
     A          K LRCODE
