     A*     INVENTORY LOT BALANCE READY DATE FILE
     A*     FILE NAME - FDLOTRDC
     A* LOGICAL FILE   RESERVED LOTS ONLY BY CUSTOMER
     A                                      FIFO
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A*           LRCODE                    VALUES('R')
     A*
     A          K LRCUST
     A          K LRITEM
     A          K LRSIZE
     A          K LRCRDY
