     A*     INVENTORY LOT BALANCE READY DATE FILE
     A* LOGICAL FILE
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A*
     A          K LRCRDY
     A          K LRITEM
     A          K LRSIZE
     A          O LRCUST                    COMP(NE 999999)
