     A*     INVENTORY LOT BALANCE FILE
     A*     KEY = DATE, SIZE, ITEM
     A*     FILE NAME - FDLOTDSI
     A*
     A                                      FIFO
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A*
     A          K LRCRDY
     A          K LRSIZE
     A          K LRALPH
     A          K LRITEM
