     A*     INVENTORY LOT BALANCE FILE
     A*     KEY = SIZE, ALPHA, ITEM, CUST, READY DATE
     A*     FILE NAME - FDLOTSDI
     A*
     A                                      FIFO
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A*
     A          K LRSIZE
     A          K LRALPH
     A          K LRITEM
     A          K LRCUST
     A          K LRCRDY
