     A*     INVENTORY LOT BALANCE READY DATE FILE
     A* LOGICAL FILE - FOR READY BAY (PARTIAL FLATS WITH AVAIALABILITY)
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A*
     A          K LRITEM
     A          K LRSIZE
     A          K LRCRDY
     A          K LRSOWD
     A          K LRGLOC
     A          K LRCUST
     A          O LRQTAV                    COMP(LE 0)
     A          O LRCUST                    COMP(NE 999997)
