     A*     INVENTORY LOT BALANCE READY DATE FILE
     A*     FILE NAME - FDLOTRDCLT (CUSTOMER LOT)
     A* LOGICAL FILE
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A*
     A          K LRITEM
     A          K LRSIZE
     A          K LRCRDY
     A          K LRSOWD
     A          O LRCUST                    COMP(NE 999990)
