     A*     INVENTORY LOT BALANCE READY DATE FILE
     A* LOGICAL FILE
     A          R RDLOTRD                   PFILE(FDLOTRD)
     A*
     A          K LRCRDY
     A          K LRITEM
     A          K LRSIZE
     A          O LRCUST                    COMP(EQ 0)
     A          O LRQTOH                    COMP(LE LRQTAL)
     A          O LRCUST                    COMP(EQ 1521)
     A*         O                           ALL
