     A*     INVENTORY LOT BALANCE FILE
     A*         CRDY:ITEM:SIZE
     A          R RDLOT                     PFILE(FDLOT)
     A*
     A          K LDCRDY
     A          K LDITEM
     A          K LDSIZE
