     A*     INVENTORY LOT BALANCE FILE
     A*         CRDY:SOWD:ITEM:SIZE:WHSE
     A          R RDLOT                     PFILE(FDLOT)
     A*
     A          K LDCRDY
     A          K LDSOWD
     A          K LDITEM
     A          K LDSIZE
     A          K LDWHSE
