     A*     DPC CUSTOMER SUMMARY
     A*     KEY = CURR YEAR $ DECENDING
     A*     FILE NAME - FDPCST$
     A*
     A                                      FIFO
     A          R RDPCST                    PFILE(FDPCST)
     A*
     A          K DPLTM                     DESCEND
