     A*     Salespersons Monthly/Team Leaders Annual DPC Goals
     A*     FILE NAME - FDPCGOLU
     A*
     A                                      UNIQUE
     A          R RDPCGOAL                  PFILE(FDPCGOAL)
      *
     A          K DGBR
     A          K DGUSER
     A          K DGALPH
     A          K DGCUST
