     A*     DPC CUSTOMER STATUS FILE
     A*     FILE NAME - FDPCCUTA
     A*
     A                                      UNIQUE
     A          R RDPCCUST                  PFILE(FDPCCUST)
      *
     A          K DPALPH
     A          K DPCUST
