     A*     DPC CHANGE FILE BY REASON, DATE, AND CUST ALPHA
     A*     FILE NAME - FDPCCHGD
     A*
     A                                      FIFO
     A          R RDPCCHG                   PFILE(FDPCCHG)
      *
     A          K DCREAS
     A          K DCDTCH
     A          K DCALPH
