     A*     DPC CERTIFICATE FILE
     A*     FILE NAME - FDPCERT
     A*
     A                                      UNIQUE
     A          R RDPCERT                   PFILE(FDPCERT)
      *
     A          K CCSTAT
     A          K CCCERT
