     A*     DPC STATUS FILE BY ALPHA AND CUST #
     A*     FILE NAME - FDPCCSTA
     A*
     A                                      UNIQUE
     A          R RDPCCUST                  PFILE(FDPCCUST)
      *
     A          K DPALPH
     A          K DPCUST
