     A*     DAILY SALES FILE
     A*     FILE NAME - FDSALE
     A*
     A*     LOGICAL FILE INDEXED ON CO, CUST & ITEM, SLSPER, ACCTG PER
     A*
     A                                      FIFO
     A          R RDSALE                    PFILE(FDSALE)
     A*
     A          K SDCOMP
     A          K SDCUST
     A          K SDITEM
     A          K SDSIZE
     A          K SDSLM1
     A          K SDSHPR
