     A*     DAILY SALES FILE
     A*     FILE NAME - FDSALE
     A*
     A*     LOGICAL FILE INDEXED ON CO, DATE, INVOICE, SEQ #
     A*                  ONLY USED BY BIR350 IN DAILY ORDER POST
     A*
     A                                      FIFO
     A          R RDSALE                    PFILE(FDSALEO)
     A*
     A          K SDCOMP
     A          K SDTDAT
     A          K SDINV#
     A          K SDSEQ#
