     A*     DAILY SALES FILE
     A*     FILE NAME - FDSALES
     A*
     A*     LOGICAL FILE INDEXED ON COMPANY, SALESPERSON & ACCTG PER
     A*
     A                                      FIFO
     A          R RDSALE                    PFILE(FDSALE)
     A*
     A          K SDCOMP
     A          K SDSLM1
     A          K SDSHPR
