     A*     DAILY SALES FILE
     A*     FILE NAME - FDSALE
     A*
     A*     LOGICAL FILE INDEXED ON COMPANY, ITEM, SIZE & ACCTG PER
     A*
     A                                      FIFO
     A          R RDSALE                    PFILE(FDSALE)
     A*
     A          K SDCOMP
     A          K SDITEM
     A          K SDSIZE
     A          K SDWHSE
     A          K SDSHPR
