     A*     DAILY SALES FILE
     A*     FILE NAME - FDSALE
     A*
     A*     LOGICAL FILE INDEXED ON COMPANY, CUST NUMBER & ACCTG PER
     A*
     A                                      FIFO
     A          R RDSALE                    PFILE(FDSALE)
     A*
     A          K SDCOMP
     A          K SDCUST
     A          K SDSHPR
