     A*     CUSTOMER FAX FILE
     A*     FILE NAME - FFAX
     A*
     A                                      UNIQUE
     A          R RFAX                      TEXT('CUSTOMER FAX')
     A            FXCUST         6S         TEXT('CUSTOMER #                 ')
     A                                      COLHDG('Customer #')
     A            FXFAX         10S 0       TEXT('FAX')
     A                                      COLHDG('FAX #')
     A*
     A          K FXCUST
