     A*     SPRAYER WEEKLY CONTROL FILE
     A*     FILE NAME - FCHMSPY
     A*
     A*
     A                                      UNIQUE
     A          R RCHMSPY                   PFILE(FFCMSPY)
     A*
     A***       K CSWKDT
     A          K CSITEM
     A          K CSSIZE
     A          K CSPPM
