     A*     SPRAYER WEEKLY CONTROL FILE
     A*     FILE NAME - FCHMRUN
     A*
     A*
     A          R RCHMRUN                   PFILE(FFCMRUN)
     A*
     A          K CRSPIT
     A          K CRSPSZ
     A          K CRPPM
