     A*     APLLICATOR WEEKLY CONTROL FILE
     A*     FILE NAME - FCHMAPP
     A*
     A*
     A                                      UNIQUE
     A          R RCHMAPP                   PFILE(FFCMAPP)
     A*
     A          K CASPRY
     A          K CAITEM
     A          K CASIZE
     A          K CAPPM
