     A*     APPLICATOR NAME CONTROL FILE
     A*     FILE NAME - FCHMNAM
     A*
     A*
     A                                      UNIQUE
     A          R RCHMNAM                   TEXT('APPLICATOR NAME  FILE')
      ** THE FOLLOWING IS THE NAME OF THE APPLICATOR.
     A            CHMNAM        10A         TEXT('APPLIATOR NAME')
     A                                      COLHDG('NAME')
     A*
     A          K CHMNAM
