     A*     CHEMICAL WEEKLY JOB FILE
     A*     FILE NAME - FCHMJOB
     A* LOGICAL BY WEEK,SPRAY,PPM,BAY,ETC
     A*
     A
     A          R RCHMJOB                   PFILE(FFCMJOB)
     A*
     A          K CJWKDT
     A          K CJSPIT
     A          K CJPPM
     A          K CJHSE                     DESCEND
     A          K CJSECT                    DESCEND
     A          K CJBAY                     DESCEND
     A          K CJNOS
     A          K CJSEOW
     A          K CJSPOL
