     A*     CHEMICAL WEEKLY LOCATION FILE
     A*     FILE NAME - FCHMLOC
     A* LOGICAL BY POLEKEY NUMBER
     A*
     A          R RCHMLOC                   PFILE(FFCMLOC)
     A*
     A          K CLWKDT
     A          K CLSECT
     A          K CLBAY
     A          K CLNOS
     A          K CLPLKY
