     A          R RFINPPDUPL                TEXT('Finished Locations')
     A            FUDATE          L         TEXT('Planting Date')
     A            FUSHIP          L         TEXT('Shipping Date')
     A            FUPLTG         2S 0       TEXT('Planting Number')
     A            FUCUST         6S 0       TEXT('Customer')
     A            FUCABB        15A         TEXT('Customer Abrev.')
     A            FUITEM        12A         TEXT('ITEM #')
     A            FUSIZE         3A         TEXT('SIZE CODE')
     A            FUQTY          9S 0       TEXT('Quantity')
