     A          R RFINPPDUPL                TEXT('Finished Locations')
     A            FUDATE       256A         TEXT('Planting Date')
     A            FUSHIP       256A         TEXT('Shipping Date')
     A            FUPLTG       256A         TEXT('Planting Number')
     A            FUCUST       256A         TEXT('Customer')
     A            FUCABB       256A         TEXT('Customer Abrev.')
     A            FUITEM       256A         TEXT('ITEM #')
     A            FUSIZE       256A         TEXT('SIZE CODE')
     A            FUQTY        256A         TEXT('Quantity')
