     A          R FFINPRORCD
     A            FLD1       00005A
     A            FLD2       00003A
     A            FLD3       00030S06
     A            FLD4       00030S06
     A            FLD5       00008A
