     A*     PLANTING LINE SCHEDULE FILE
     A*     FILE NAME - FFINSCH
     A*
     A          R RFINSCH                   TEXT('FIN. LINE SCHEDULE')
     A                                      PFILE(FFINSCH)
     A          K FLSIZE
     A          K FLITEM
     A          K FLPLT#
     A          K FLSOWD
      ** STATUS A=Open S=Scheduled C=Complete D=Deleted
     A          O FLSTAT                    COMP( NE 'S')
