     A          R FFINPPDRCD
     A            FLD1       00010A
     A            FLD2       00010A
     A            FLD3       00030S06
     A            FLD4       00030S06
     A            FLD5       00005A
     A            FLD6       00030S06
     A            FLD7       00030S06
     A            FLD8       00030S06
