     A*     PLANTING LINE SCHEDULE FILE
     A*     FILE NAME - FFINSCH
     A*
     A          R RFINSCH                   TEXT('FIN. LINE SCHEDULE')
     A                                      PFILE(FFINSCH)
     A          K FLITEM
     A          K FLSIZE
     A          K FLSOWD
