     A*     FINISHED ITEM LOCATION FILE
     A*
     A*
     A          R RFINLOC                   TEXT('Finished Locations')
     A                                      PFILE(FFINLOC)
     A          K FLSECT
     A          K FLBAY
     A          K FLNORS
     A          K FLEORW
     A          K FLSRTP
     A          K FLENDP
     A          K FLITEM
     A          K FLSIZE
     A          K FLCUST
     A          K FLPLTG
