     A*     FREIGHT TYPE MASTER FILE
     A*     FILE NAME - FFRTYP
     A*
     A                                      UNIQUE
     A          R RFRTYP                    TEXT('FREIGHT TYPE')
     A            FRCODE         1A         TEXT('FREIGHT TYPE')
     A                                      COLHDG('Frt' 'Type')
     A            FRDESC        12A         TEXT('DESCRIPTION')
     A                                      COLHDG('Description')
     A*
     A          K FRCODE
