     A*     G/L ALLOCATIONS FILE
     A*     KEY = COMPANY AND FROM ACCOUNT NUMBER
     A*     FILE NAME - FGLALOIN
     A*
     A
     A          R RGLALO                    PFILE(FGLALO)
     A*
     A          K GACOMP
     A          K GAFRAC
