     A*     G/L ALLOCATIONS FILE
     A*     KEY = COMPANY AND TO ACCOUNT NUMBER
     A*     FILE NAME - FGLALOTO
     A*
     A
     A          R RGLALO                    PFILE(FGLALO)
     A*
     A          K GACOMP
     A          K GATOAC
