     A*     G/L SOFT CLOSE FILE
     A*     FILE NAME - FGLCLOS
     A*
     A          R RGLCLOS                   TEXT('G/L SOFT CLOSE')
     A            GZCOMP         2S 0       TEXT('COMPANY NUMBER')
     A                                      COLHDG('Co' '#')
     A            GZLIBR        10A         TEXT('LIBRARY NAME')
     A                                      COLHDG('Library' ' Name  ')
     A*
     A          K GZCOMP
