     A*     G/L TRANSACTION FILE
     A*     KEY = COMPANY, JE NUMBER, SOURCE, DATE AND ACCOUNT
     A*     FILE NAME - FGLDET
     A*
     A                                      FIFO
     A          R RGLDET                    PFILE(FGLDET)
     A*
     A          K GTCOMP
     A          K GTJEPR
     A          K GTJENM
     A          K GTJESF
     A          K GTCYMD
     A          K GTSRCE
     A          K GTACCT
