     A*     G/L CONSOLIDATION FILE
     A*     KEY = COMPANY & ACCOUNT NUMBER
     A*     FILE NAME - FGLDCON
     A*
     A                                      FIFO
     A          R RGLDCON                   PFILE(FGLDCON)
     A*
     A          K GTCOMP
     A          K GTCON#
     A          K GTACCT
     A          K GTCYMD
