     A*     G/L TRANSACTION FILE
     A*     KEY = COMPANY & ACCOUNT NUMBER
     A*     FILE NAME - FGLDET
     A*
     A                                      FIFO
     A          R RGLDET                    PFILE(FGLDET)
     A*
     A          K GTCOMP
     A          K GTACCT
     A          K GTCYMD
