     A*     G/L TRANSACTION FILE
     A*     KEY = COMPANY, ACCTG PERIOD AND ACCOUNT NUMBER
     A*     FILE NAME - FGLDET
     A*
     A                                      FIFO
     A          R RGLDET                    PFILE(FGLDET)
     A*
     A          K GTCOMP
     A          K GTPOST
     A          K GTCYMD
     A          K GTAPER
     A          K GTACCT
