     A*     G/L TRANSACTION FILE
     A*     KEY = COMPANY & ACCOUNT NUMBER
     A*     FILE NAME - FGLDET
     A*
     A                                      FIFO
     A          R RGLDET                    PFILE(LSTYR1201/FGLDET)
     A*
     A          K GTACCT
     A          K GTJENM
     A          O GTACCT                    COMP(LT 18000000)
     A          O GTACCT                    COMP(GT 19000000)
     A          O GTJENM                    COMP(LE 0)
