     A*     G/L FORMAT DETAIL FILE
     A*     FILE NAME - FGLFMIAC - BY G/L ACCOUNT NUMBER
     A*
     A
     A                                      FIFO
     A          R RGLFMI                    PFILE(FGLFMI)
     A*
     A          K GIGLAC
