     A*     G/L PRELIMINARY FILE
     A*     KEY = CO.#, SOURCE, ACCOUNT NUMBER & DATE
     A*     FILE NAME - FGLPRE
     A*
     A                                      FIFO
     A          R RGLPRE                    PFILE(FGLPRE)
     A*
     A          K GTCOMP
     A          K GTSRCE
     A          K GTACCT
     A          K GTTDAT
