     A*     G/L REPORT CROSS REFERENCE FILE
     A*     FILE NAME - FGLREFA
     A*
     A
     A          R RGLREF                    PFILE(FGLREF)
     A*
     A          K GXLOOK
     A          K GXCOMP
     A          K GXRPRT
     A          K GXRTYP
