     A*     ORDER HEADER FILE
     A*     FILE NAME - FHORDRTR
     A*             DTRY,DTCN,SHPC,ROUT,STOP,ALPH,CUST,ORD# SO
     A          R RHORDR                    PFILE(FHORDR)
     A*
     A          K OHDTRY
     A          K OHDTCN
     A          K OHSHPC
     A          K OHROUT
     A          K OHSTOP
     A          K OHALPH
     A          K OHCUST
     A          K OHORD#

     A          O OHSHPC                    COMP(NE '01')
