      *     ORDER HEADER FILE
      *     FILE NAME - FHORDWDT
      *
      *     LOGICAL FILE INDEXED ON ACTUAL SHIP DATE - WHDTAC
      *
      *     Created on 03/18/2004 by William J. Behr
      *
      *
     A          R RHORDW                    PFILE(FHORDW)
     A*
     A          K WHDTAC
     A*
