     A*     ORDER HEADER FILE
     A*     FILE NAME - FHORCBD
     A*
     A*     LOGICAL FILE INDEXED ON SHIP TO/INV DATE
     A*
     A          R RHORCW                    PFILE(FHORCW)
     A*
     A          K CHCUST
     A          K CHORDY
     A          K CHCRM#
     A*
