     A*     ORDER HEADER FILE
     A*     FILE NAME - FHORWBD
     A*
     A*     LOGICAL FILE INDEXED ON SHIP TO/INV DATE
     A*
     A          R RHORDW                    PFILE(FHORDW)
     A*
     A          K WHCUST
     A          K WHDTAC
     A          K WHINV#
     A*
