     A*     ORDER HEADER FILE
     A*     FILE NAME - FHORDRTR
     A*             DTRY,SHPC,ROUT,STOP,ALPH,CUST,ORD#,DTCN
     A          R RHORDR                    PFILE(FHORDR)
     A*
     A          K OHDTRY
     A          K OHSHPC
     A          K OHROUT
     A          K OHSTOP
     A          K OHALPH
     A          K OHCUST
     A          K OHORD#
     A          K OHDTCN

     A          O OHSHPC                    COMP(NE '02')
