     A*     ORDER HEADER FILE
     A*     FILE NAME - FHORDRSV
     A*
     A*     LOGICAL FILE INDEXED ON SHIP VIA, CUSTOMER AND ORDER #
     A*             SHPC,SHZP,ALPH,ORD#
     A                                      UNIQUE
     A          R RHORDR                    PFILE(FHORDR)
     A*
     A          K OHSHPC
     A          K OHSHZP
     A          K OHALPH
     A          K OHORD#
