     A*     ORDER HEADER FILE
     A*     FILE NAME - FHORDW
     A*
     A*     LOGICAL FILE INDEXED ON ORDER NUMBER - WHORD#
     A*
     A          R RHORDW                    PFILE(FHORDW)
     A*
     A          K WHBLCU
     A          K WHDTAC                    DESCEND
     A          K WHINV#
     A*
