     A*     ORDER HEADER FILE
     A*     FILE NAME - FHORDWRS
     A*
     A*     LOGICAL FILE INDEXED ON ORDER NUMBER - HORDW
     A*
     A          R RHORDW                    PFILE(FHORDW)
     A*
     A          K WHROUT
     A          K WHSTOP
     A*
