     A*     ORDER HEADER FILE
     A*     FILE NAME - FHORDRNTR   (NTR = NO TRUCKS)
     A*
     A* LOGICAL FILE INDEXED ON REQ SHP SHIP VIA,SHIPTO ALPHA & ORDER #
     A*             DTRY,SHPC,ALPH,CUST,ORD#,SHPC
     A          R RHORDR                    PFILE(FHORDR)
     A*
     A          K OHDTRY
     A          K OHSHPC
     A          K OHALPH
     A          K OHCUST
     A          K OHORD#
     A          O OHSHPC                    COMP(EQ '01')
