     A*     ORDER HEADER FILE
     A*     FILE NAME - FHORDWTMRS
     A*
     A*     LOGICAL FILE INDEXED ON ORDER NUMBER - HORDWTM
     A*
     A          R RHORDW                    PFILE(FHORDWTM)
     A*
     A          K WHROUT
     A          K WHSTOP
     A*
