     A*     ORDER HEADER FILE
     A*     FILE NAME - FHORDWTR
     A*
     A*     LOGICAL FILE INDEXED ON: ACTUAL SHIP DT/TRUCK RT/
     A*                              CUST ALPHA SEARCH/INV#
     A*
     A                                      UNIQUE
     A          R RHORDW                    PFILE(FHORDW)
     A*
     A          K WHDTAC
     A          K WHROUT
     A          K WHALPH
     A          K WHINV#
