     A          R RPLUGS                    JFILE(FIORDR FMSIZC)
     A          J                           JOIN(FIORDR FMSIZC)
     A                                      JFLD(OISIZE SCSIZE)
      *  FMCUST
     A            PLORD#                    RENAME(OIORD#)
     A            SCSIZE
     A            SCCATG
      *
     A          K PLORD#
     A          O SCCATG                    COMP(EQ 'PLUG')
