     A          R FINOUTR                   TEXT('FINISHED AVAILABILITY')
     A            ITEM          12A         TEXT('ITEM')
     A            SIZE           3A         TEXT('SIZE')
     A            DES1          30A         TEXT('ITEM DESCRIPTION')
     A            QTAV           7S 0       TEXT('QUANTITY AVAILABLE')
     A            SIZD          80A         TEXT('SIZE DESCRIPTION')
     A            DATE            L         TEXT('DATE')
     A            TIME            T         TEXT('TIME')
     A            RDYC          15A         TEXT('READY COLOR')
