     A*     CUSTOMER INVOICE MANIFEST DETAIL FILE
     A*     FILE NAME - FINMANDI
     A*     LOGICAL BY INVOICE AND SUFFIX
     A*
     A
     A          R RINMAND                   PFILE(FINMAND)
      *
     A          K IDINV#
     A          K IDSUFF
