     A*     CUSTOMER INVOICE MANIFEST FILE
     A*     FILE NAME - FINMAN
     A*     LOGICAL BY CUSTOMER AND DATE DESCENDING
     A*
     A                                      UNIQUE
     A          R RINMAN                    PFILE(FINMAN)
      *
     A          K INCUST
     A          K INMAN#                    DESCEND
