     A*     FINVDLY with "IDCUST" as Key (Logical File)
     A*  ALTERNATE KEY = "IDCUST" (CUSNO in Phys File)
     A*
     A*     FILE NAME USED IN CODSCRCL AND QS36F-> CODSCRFL
     A*
     A                                      FIFO
     A          R RINVDLY                   PFILE(FINVDLY)
     A*
     A*    {Key = 6 long Code}
     A          K IDCUST
