     A*     ITEM FUTURE AVAILABLIITY FILE
     A*     FILE NAME - FINVAVLR
     A*
     A*
     A                                      UNIQUE
     A          R RINVAVL                   PFILE(FINVAVL)
     A*
     A          K FAITEM
     A          K FASIZE
     A          K FAWHSE
     A          K FADTRV                    DESCEND
     A          K FAPONO
     A          K FAPSEQ
