     A*     ITEM FUTURE AVAILABLIITY FILE
     A*     FILE NAME - FINVAVLP
     A*
     A*
     A
     A          R RINVAVL                   PFILE(FINVAVL)
     A*
     A          K FAPONO
     A          K FAPSEQ
      *  OMIT NE MANUAL CHECK
     A          O FAPONO                    VALUES(000000)
