     A*     ORDER DETAIL RESOW REQUESTS
     A*     FILE NAME - FIORDR
     A*
     A*
     A          R RIORESOW                  TEXT('ORDER DETAIL RESOW REQUEST')
     A                                      PFILE(FIORESOW)
     A*
     A          K OIRORD
     A          K OIRSEQ
