     A*     ORDER DETAIL FILE
     A*     KEY = REQUESTED SHIP DATE/ORDER #/SEQ#
     A*     FILE NAME - FIORDRSD
     A*
     A                                      FIFO
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OIRVDT
     A          K OIORD#
     A          K OISEQ#
