     A*     ORDER DETAIL FILE
     A*     KEY = REQUESTED SHIP DATE/PROD CLS 1/ITEM/SIZE
     A*     FILE NAME - FIORDRRP
     A*
     A                                      FIFO
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OIRVDT
     A          K OIPRCL
     A          K OIITMA
     A          K OIITEM
     A          K OISIZE
