     A*     CREDIT MEMO DETAIL FILE
     A*     KEY = COMPANY AND ORDER NUMBER / SEQ #
     A*     FILE NAME - FIORCX
     A*
     A                                      FIFO
     A          R RIORCW                      PFILE(FIORCW)
     A*
     A          K CICOMP
     A          K CICRM#
     A          K CISEQ#
