     A*     ASSORTMENT ORDER DETAIL FILE
     A*     KEY = SHIP VIA, ITEM, SIZE, REQ DATE
     A*     FILE NAME - FIORASTS
     A*
     A
     A          R RIORAST                   PFILE(FIORAST)
     A*
     A          K IASHPC
     A          K IAITEM
     A          K IASIZE
     A          K IARVDT
