     A*     ORDER DETAIL FILE
     A*     KEY = STATUS, SIZE/ITEM ALPHA
     A*     FILE NAME - FIORDR
     A*
     A                                      FIFO
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OISTAT
     A          K OIORD#
     A          K OISEQ#
     A          O OISTAT                    COMP(NE 'A')
