     A*     ORDER DETAIL FILE
     A*     KEY = REQUESTED ORDER #, BOLIN, AND SEQ #
     A*     FILE NAME - FIORDRBO
     A*
     A                                      FIFO
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OIORD#
     A          K OIBOLN
     A          K OISEQ#
