     A*     ORDER DETAIL FILE
     A*     KEY = REQUESTED SHIP DATE/SIZE/ITEM
     A*     FILE NAME - FIORDRL7
     A*
     A                                      FIFO
     A          R RIORDRWK                  PFILE(FIORDRWK)
     A*
     A          K OIRVDT
     A          K OISIZE
     A          K OIDES1
     A          S OISIZE                    COMP(NE '   ')
