     A*     ORDER DETAIL FILE
     A*     KEY = CUSTOMER, REQ. DATE AND ORDER NUMBER
     A*     FILE NAME - FIORDR
     A*
     A                                      FIFO
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OICUST
     A          K OIRVDT
     A          K OIORD#
     A          K OISEQ#
