     A*     INVOICE DETAIL FILE
     A*     KEY = INV DATE , SHIP TO CUSTOMER
     A*     FILE NAME - FIORDWITM
     A*
     A                                      FIFO
     A          R RIORCW                    PFILE(FIORCW)
     A*
     A          K CIRIND
     A          K CICUST
     A          K CICRM#
