     A*     ORDER DETAIL FILE
     A*     KEY = REQUESTED ORDER/OILIST/OISEQ
     A*     FILE NAME - FIORDRL15
     A*
     A                                      FIFO
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OIORD#
     A          K OILIST
     A          K OISEQ#
