     A*     ORDER DETAIL FILE
     A*     KEY = STATUS, ROUT,STOP,ORDER #
     A*     FILE NAME - FIORDRSR
     A*
     A                                      FIFO
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OISTAT
     A          K OIROUT
     A          K OISTOP
     A          K OIORD#
     A          K OISEQ#
