     A*     ORDER DETAIL FILE
     A*     KEY = REQUESTED ORDER/ITEM/SIZE/SHIP DATE
     A*     FILE NAME - FIORDRRB
     A*
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OIORD#
     A          K OIITEM
     A          O OISTAT                    COMP(NE 'A')
     A          O OIITYP                    COMP(NE 'C')
     A          O OIITEM                    COMP(NE 'RB')
