     A                                      UNIQUE
     A          R RIORCUSTOM                TEXT('CUSTOM ORDERS')
     A            COORD#         6S 0       TEXT('CUSTOM ORDER NUMBER')
     A                                      COLHDG('Order #')
     A                                      EDTCDE(Z)
     A          K COORD#
