     A*     INVOICE DETAIL FILE
     A*     KEY = CUSTOMER ITEM SIZE INV DATE REVERSED
     A*     FILE NAME - FIORDWITM
     A*
     A                                      FIFO
     A          R RIORDW                    PFILE(FIORDW)
     A*
     A          K WICUST
     A          K WIITEM
     A          K WISIZE
     A          K WIWHSE
     A          K WIRIND                    DESCEND
     A          K WIINV#
