     A*     ORDER DETAIL FILE
     A*     KEY = ITEM/SIZE/REQ SHIP DATE/CUSTOMER
     A*     FILE NAME - FIORDRSI
     A*
     A                                      FIFO
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OIITEM
     A          K OISIZE
     A          K OIRVDT
     A          K OICUST
