     A*     INVOICE DETAIL FILE
     A*     KEY = INV DATE , SHIP TO CUSTOMER
     A*     FILE NAME - FIORDWITM
     A*
     A                                      FIFO
     A          R RIORDW                    PFILE(FIORDW)
     A*
     A          K WIRIND
     A          K WICUST
     A          K WIINV#
