     A*     ASSORTMENT ORDER DETAIL FILE
     A*     KEY = ROUT, STOP, ITEM,SIZE, REQ DATE
     A*     FILE NAME - FIORASTR
     A*
     A
     A          R RIORAST                   PFILE(FIORAST)
     A*
     A          K IAROUT
     A          K IASTOP
     A          K IAITEM
     A          K IASIZE
     A          K IARVDT
