     A*     ORDER DETAIL RESOW REQUESTS
     A*     FILE NAME - FIORDR
     A*
     A*
     A          R RIORESOW                  TEXT('ORDER DETAIL RESOW REQUEST')
     A                                      PFILE(FIORESOW)
     A*
     A          K OIRVDT
     A          K OICUST
     A          K OIITEM
     A          K OISIZE
     A          K OIORD#
     A          S OISTAT                    COMP(EQ 'A')
     A          O                           ALL
