     A*     ORDER DETAIL FILE
     A*     KEY = SALESPERSON, CUSTOMER AND ORDER NUMBER
     A*     FILE NAME - FIORDR
     A*
     A                                      FIFO
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OISLM1
     A          K OIALPH
     A          K OIORD#
