     A*     ORDER DETAIL FILE
     A*     KEY = SHIP DATE,LOCATION, SIZE/ITEM ALPHA
     A*     FILE NAME - FIORDR
     A*
     A                                      FIFO
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OISTAT
     A          K OISHFR
     A          K OIORD#
     A          K OIRVDT
     A          K OISIZE
     A          K OIITMA
     A          K OISEQ#
