     A*     ORDER DETAIL FILE
     A*     KEY = REQUESTED SHIP DATE/ITEM/SIZE
     A*     FILE NAME - FIORDRSI
     A*
     A                                      FIFO
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OIRVDT
     A          K OIITEM
     A          K OISIZE
