     A*     ASSORTMENT ORDER DETAIL FILE
     A*     KEY = ITEM,SIZE
     A*     FILE NAME - FIORASTI
     A*
     A
     A          R RIORAST                   PFILE(FIORAST)
     A*
     A          K IAITEM
     A          K IASIZE
