     A*     ASSORTMENT ORDER DETAIL FILE
     A*     KEY = SHIP FROM, ITEM, SIZE, REQ DATE
     A*     FILE NAME - FIORASTF
     A*
     A
     A          R RIORAST                   PFILE(FIORAST)
     A*
     A          K IASHFR
     A          K IAITEM
     A          K IASIZE
     A          K IARVDT
