     A*     ORDER DETAIL FILE
     A*     KEY = REQUESTED ITEM/SIZE/SHIP DATE
     A*     FILE NAME - FIORDRSI
     A*
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OIRVDT
     A          K OIITMA
     A          K OIITEM
     A          K OISIZE
     A          S OIITYP                    COMP(EQ ' ')
