     A*     ORDER DETAIL FILE
     A*     KEY = B2B COMMENT BY ORD#, SEQ#, LATEST TIMESTAMP
     A*     FILE NAME - FIORDRB2B1
     A*
     A          R RIORDRB2BC                PFILE(FIORDRB2BC)
     A*
     A          K B2BORD#
     A          K B2BSEQ#
     A          K B2BTIME                   DESCEND
