     A*     ORDER DETAIL FILE
     A*     KEY = PRODUCT CLASS/ITEM/ORDER #
     A*     FILE NAME - FIORDR
     A*
     A                                      FIFO
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OIPRCL
     A          K OIITEM
     A          K OISIZE
     A          K OIRVDT
     A          K OIORD#
