     A*     ORDER DETAIL FILE
     A*     KEY = ITEM NUMBER
     A*     FILE NAME - FIORDR
     A*
     A                                      FIFO
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OIITEM
     A          K OISIZE
     A          K OIORD#
