     A*     ORDER DETAIL FILE
     A*
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OIRVDT
     A          K OIITEM
     A          K OISIZE
     A          K OIORD#
     A          K OISEQ#
