     A*     ORDER DETAIL FILE
     A*     KEY = STATUS, SHIP VIA,ORDER #
     A*     FILE NAME - FIORDRSV
     A*
     A                                      FIFO
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OISTAT
     A          K OISHPC
     A          K OIORD#
     A          K OISEQ#
