     A*     ASSORTMENT ORDER DETAIL FILE
     A*     KEY = ORDER NUMBER,SEQ,ITEM,SIZE
     A*     FILE NAME - FIORASTI
     A*
     A                                      UNIQUE
     A          R RIORAST                   PFILE(FIORAST)
     A*
     A          K IAORD#
     A          K IAPSEQ
     A          K IAITEM
     A          K IASIZE
