     A*     ORDER DETAIL FILE
     A*     KEY = STATUS, SHIP FROM,ORDER #
     A*     FILE NAME - FIORDRST
     A*
     A                                      FIFO
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OISTAT
     A          K OISHFR
     A          K OIORD#
     A          K OISEQ#
