     A*     INVOICE DETAIL FILE
     A*     KEY = CUSTOMER ITEM SIZE INV DATE REVERSED
     A*     FILE NAME - FIORDWITM
     A*
     A          R RIORDW                    PFILE(FIORDW)
     A*
     A          K WIITEM
     A          K WISIZE
     A          K WIRIND
