     A*     ORDER DETAIL FILE
     A*     KEY = REQUESTED ITEM/SIZE/SHIP DATE
     A*     FILE NAME - FIORDRSI
     A*
     A                                      FIFO
     A          R RIORDR                    PFILE(FIORDR)
     A*
     A          K OIITEM
     A          K OISIZE
     A          K OIRVDT
     A          S OICOFL                    COMP(EQ 'N')
     A            OIITYP                    COMP(EQ ' ')
