     A*     ORDER DETAIL FILE
     A*     KEY = REQUESTED SHIP DATE/ITEM/SIZE
     A*     FILE NAME - FIORDRL6
     A*
     A                                      FIFO
     A          R RIORDRWK                  PFILE(FIORDRWK)
     A*
     A          K OIRVDT
     A          K OIITEM
     A          K OISIZE
     A          S OISIZE                    COMP(NE '   ')
