     A          R RLOSSLOT                  TEXT('LOSS DETAIL')
     A                                      PFILE(FLOSSLOT)
     A          K LDREDY
     A          K LDITEM
     A          K LDSIZE
