     A                                      UNIQUE
     A          R RMATTEND                  PFILE(FMATTEND)
     A                                      TEXT('Attendance Master File')
     A*
     A          K ATTIME
