     A                                      UNIQUE
     A          R RMATTEND                  PFILE(FMATTEND)
     A                                      TEXT('Attendance Master File')
     A*
     A          K ATFILE
     A          K ATDATE
     A          K ATSTRT
     A          K ATTYPE
