     A*     CUSTOMER OPTIONS MASTER FILE
     A*     FILE NAME - FMCSTOPT
     A*   LOGICAL BY ALPHA SEARCH
     A*
     A                                      FIFO
     A          R RMCSTOPT                  PFILE(FMCSTOPT)
     A*
     A          K OPLOOK
