     A*     CUSTOMER TYPE MASTER FILE
     A*     FILE NAME - FMCTYP
     A*
     A                                      UNIQUE
     A          R RMCTYP                    TEXT('CUSTOMER TYPE MASTER')
     A            CTTYPE         2A         TEXT('TYPE')
     A                                      COLHDG('Type')
     A            CTDESC        30A         TEXT('DESCRIPTION')
     A                                      COLHDG('Description')
     A*
     A          K CTTYPE
