     A*     CUSTOMER MASTER FILE
     A*     KEY = ZIP CODE
     A*     FILE NAME - FMCUST
     A*
     A                                      FIFO
     A          R RMCUST                    PFILE(FMCUST)
     A*
     A          K CMZIP
     A          K CMLOOK
