     A*     CUSTOMER MASTER FILE
     A*     KEY = STATE,ALPHA,CUST #
     A*     FILE NAME - FMCUST
     A*
     A                                      FIFO
     A          R RMCUST                    PFILE(FMCUST)
     A*
     A          K CMSTST
     A          K CMLOOK
     A          K CMCUST
