     A*     CUSTOMER MASTER FILE
     A*     KEY = BILL TO CUSTOMER NUMBER
     A*     FILE NAME - FMCUST
     A*
     A                                      FIFO
     A          R RMCUST                    PFILE(FMCUST)
     A*
     A          K CMBLCU
