     A*     CUSTOMER MASTER FILE
     A*     KEY = SHIP FROM / ALPHA SEARCH
     A*     FILE NAME - FMCUST
     A*
     A                                      FIFO
     A          R RMCUST                    PFILE(FMCUST)
     A*
     A          K CMSHFR
     A          K CMLOOK
