     A*     CUSTOMER SPECIFYING NO ROTATION OF PLUG INVENTORY
     A*     FILE NAME - FMCUSTNORO
     A*
     A                                      UNIQUE
     A          R RMCUSTNORO                TEXT('NO ROTATION')
     A            NRCUST         6S         TEXT('CUSTOMER #')
     A                                      COLHDG('Customer #')
     A                                      EDTCDE(Z)
     A*
     A          K NRCUST
