     A*     CUSTOMER MASTER FILE
     A*     KEY = CUSTOMER NUMBER
     A*     FILE NAME - FMCUST
     A*
     A          R RMCUST                    PFILE(FMCUST)
     A*
     A          K CMCUST
