     A*     CUSTOMER MASTER FILE
     A*     KEY = TYPE/ALPHA SEARCH/CUSTNO
     A*     FILE NAME - FMCUST
     A*
     A                                      FIFO
     A          R RMCUST                    PFILE(FMCUST)
     A*
     A          K CMCTYP
     A          K CMLOOK
     A          K CMCUST
