      *
     A                                      UNIQUE
     A          R RMEMPSUP                  TEXT('Supervisory Personnel')
     A            SPFILE         6S 0       TEXT('File Number')
     A                                      COLHDG('Payroll' 'File' 'Number')
      *
     A          K SPFILE
