     A          R RMEMPXREF                 PFILE(FMEMPXREF)
     A                                      TEXT('Employee Time Card Cross Ref')
     A*
     A          K TXFILE
     A          K TXCARD
