     A          R RMEMPLOY                  PFILE(FMEMPLOY)
     A                                      TEXT('Employee Master File')
     A*
     A          K EMFILE
     A          K EMCARD
