     A*     CHART OF ACCOUNTS MASTER FILE
     A*     KEY = ALPHA SEARCH
     A*     FILE NAME - FMGLCH
     A*
     A                                      FIFO
     A          R RMGLCH                    PFILE(FMGLCH)
     A*
     A          K GCLOOK
