     A*     ITEM MASTER FILE
     A*     KEY = SIZE CUT ONLY
     A*     FILE NAME - FMINVT
     A*
     A          R RMINVT                    PFILE(FMINVT)
     A*
     A            IMITEM
     A            IMSIZE
     A            IMVEND
     A          K IMITEM
     A          K IMSIZE
     A          S IMVEND                    COMP(NE 000000)
