     A*     ITEM MASTER FILE
     A*     KEY = ALPHA SEARCH
     A*     FILE NAME - FMINVT
     A* 8/30/00 EFD ADDED ITEM 3 AND SIZE TO INDEX
     A                                      FIFO
     A          R RMINVT                    PFILE(FMINVT)
     A*
     A          K IMCYCD
     A          K IMLOOK
     A          K IMITEM
     A          K IMSIZE
