     A*     ITEM MASTER FILE
     A*     KEY = LIST CODE, DEPT, ITEM, SIZE
     A*     FILE NAME - FMINVTLD
     A*
     A                                      FIFO
     A          R RMINVT                    PFILE(FMINVT)
     A*
     A          K IMLIST
     A          K IMWHSE
     A          K IMITEM
     A          K IMSIZE
