     A*     ITEM MASTER FILE
     A*     KEY = ALPHA SEARCH
     A*     FILE NAME - FMINVTVI
     A*
     A                                      FIFO
     A          R RMINVT                    PFILE(FMINVT)
     A*
     A          K IMVITM
     A          K IMITEM
     A          S IMSIZE                    VALUES('CUT')
