     A*     ITEM MASTER/SERIES X-REF FILE
     A*     FILE NAME - FMINSER
     A*     LOGICAL BY SERIES
     A*
     A
     A          R RMINSER                   PFILE(FMINSER)
     A*
     A          K ISCODE
