     A          R RMINVT                    PFILE(FMINVT)
     A          K IMLOOK
     A          K IMITEM
     A          K IMSIZE
     A          S IMLOTC                    COMP(EQ 'Y')
