     A*     ITEM MASTER FILE
     A*     KEY = ALPHA SEARCH
     A*     FILE NAME - FMINVT
     A*
     A                                      FIFO
     A          R RMINVT                    PFILE(FMINVT)
     A*
     A          K IMPCL1
     A          K IMSIZE
     A          K IMLOOK
