     A*     ITEM MASTER FILE
     A*     KEY = VENDOR NUMBER
     A*     FILE NAME - FMINVT
     A*
     A                                      FIFO
     A          R RMINVT                    PFILE(FMINVT)
     A*
     A          K IMVEND
     A          K IMITEM
     A          K IMSIZE
     A          K IMWHSE
