     A*     ITEM MASTER FILE
     A*     KEY = WHSE,PC 3,ALP
     A*     FILE NAME - FMINVT
     A*
     A                                      FIFO
     A          R RMINVT                    PFILE(FMINVT)
     A*
     A          K IMWHSE
     A          K IMPCL3
     A          K IMLOOK
