     A*     ITEM MASTER FILE
     A*     KEY = LIST CODE, ITEM, SIZE
     A*     FILE NAME - FMINVT
     A*
     A                                      FIFO
     A          R RMINVT                    PFILE(FMINVT)
     A*
     A          K IMLIST
     A          K IMITEM
     A          K IMSIZE
