     A*     ITEM MASTER FILE
     A*     KEY = LOCATION CODE
     A*     FILE NAME - FMINVT
     A*
     A                                      UNIQUE
     A          R RMINVT                    PFILE(FMINVT)
     A*
     A          K IMWHSE
     A          K IMITEM
     A          K IMSIZE
