     A*     ITEM MASTER FILE      FOR LABEL PRINTER
     A*     FILE NAME - FMINVTLB
     A*
     A                                      UNIQUE
     A          R RMINVT                    PFILE(FMINVT)
     A          K IMITEM
     A          K IMSIZE
     A          K IMWHSE
     A          S IMORDD                    COMP(EQ 'Y')
