     A          R RMINVT                    PFILE(FMINVT)
     A          K IMDES1
     A          K IMITEM
     A          K IMSIZE
     A          S IMSIZE                    COMP(EQ 'SED')
