     A*     ITEM MASTER FILE
     A*     KEY = LOCATION CODE, ALPHA SEARCH, ITEM #
     A*     FILE NAME - FMINVT
     A*
     A                                      FIFO
     A          R RMINVT                    PFILE(FMINVT)
     A*
     A          K IMWHSE
     A          K IMLOOK
     A          K IMITEM
     A          K IMSIZE
