     A*     ITEM AVAILABLE FILE
     A*     FILE NAME - FMINVA
     A* LOGICAL BY LOCATION,ALPHA,ITEM,SIZE
     A                                      UNIQUE
     A          R RMINVA                    PFILE(FMINVA)
     A*
     A          K IAWHSE
     A          K IALOOK
     A          K IAITEM
     A          K IASIZE
