     A*     ITEM MASTER FILE
     A*     KEY = SIZE CUT ONLY
     A*     FILE NAME - FMINVT
     A*
     A          R RMINVT                    PFILE(FMINVT)
     A*
     A          K IMLOOK
     A          K IMITEM
     A          K IMSIZE
     A          S IMVEND                    COMP(NE 000000)
     A          S IMFRSZ                    COMP(EQ 'CUT')
