     A*     ITEM MASTER FILE
     A*     KEY = SIZE CODE
     A*     FILE NAME - FMINVT
     A*
     A          R RMINVT                    PFILE(FMINVT)
     A*
     A          K IMSIZE
     A          K IMLOOK
     A          O IMFRSZ                    COMP(NE 'CUT')
     A          O IMSTAT                    COMP(EQ 'D')
