     A          R RMINVT                    PFILE(FMINVT)
     A          K IMITEM
     A          K IMSIZE
     A          S IMSIZE                    COMP(EQ '700')
