     A*     ITEM MASTER FILE
     A*     KEY = LIST CODE AND ALPHA
     A*     FILE NAME - FMINVT
     A*
     A                                      FIFO
     A          R RMINVT                    PFILE(FMINVT)
     A*
     A          K IMLIST
     A          K IMLOOK
