     A          R RMMAST                    TEXT('MULTIPLE MASTER DEFINITION')
     A                                      PFILE(FMMAST)
     A          K MMNUMB
     A          K MMSEQ#
