     A*     MASTER ORDER LIST FILE
     A*     FILE NAME - FMORLS
     A*
     A          R RMORLS                    PFILE(FMORLS)
     A*
     A          K OLSIZE
     A          K OLITEM
