     A*     MASTER ORDER LIST SEASON LIST FILE
     A*
     A          R RMORLSEAS                 TEXT('ORDER LIST SEASONS')
     A                                      PFILE(FMORLSEAS)
     A*
     A          K HSLIST
     A          K HSSNCD
