     A*     MASTER ORDER LIST FILE
     A*     FILE NAME - FMORLSQ - LOGICAL FILE BY SEQ #
     A*
     A          R RMORLS                    PFILE(FMORLSJ1)
     A*
     A          K OLLIST
     A          K OLSEQ#
     A          K OLLOOK
