     A*     MOVE DEFAULT DESTINATION FILE
     A*     FILE NAME - FMOVDEST
     A*
     A                                      UNIQUE
     A          R RMOVDEST                  PFILE(FMOVDEST)
     A          K DESNAM
