     A*     MOVE DEFAULT DESTINATION FILE
     A*     FILE NAME - FMOVDEST
     A*
     A*
     A                                      UNIQUE
     A          R RMOVDFT                   PFILE(FMOVDFT)
     A          K DFITEM
     A          K DFSIZE
     A          K DFUSED                    DESCEND
     A          K DFDSID                    DESCEND
