     A*     MOVE WEEKLY LOCATION FILE
     A*     FILE NAME - FMOVLOC
     A* LOGICAL BY POLEKEY NUMBER
     A*
     A                                      UNIQUE
     A          R RMOVLOC                   PFILE(FMOVLOC)
     A*
     A          K MLTDAT
     A          K MLMOVE
     A          K MLSECT
     A          K MLBAY
     A          K MLNOS
     A          K MLPLKY
