     A*     MOVE WEEKLY JOB FILE
     A*     FILE NAME - FMOVJBL1
     A* LOGICAL BY DAY.
     A*
     A
     A          R RMOVJOB                   PFILE(FMOVJB1)
     A*
     A          K MJTDAT
     A          K MJHSE
     A          K MJSECT
     A          K MJBAY
     A          K MJNOS
     A          K MJSPKY
