     A*     MOVE WEEKLY JOB FILE
     A*     FILE NAME - FMOVJBL1
     A* LOGICAL BY DAY.
     A*
     A
     A          R RMOVJOB                   PFILE(FMOVJOB)
     A*
     A          K MJTDAT
     A          K MJMOVE
     A          K MJUSER
     A          K MJHSE
     A          K MJSECT                    DESCEND
     A          K MJNOS
     A          K MJBAY                     DESCEND
