     A*     MOVE WEEKLY JOB FILE
     A* LOGICAL BY DAY.
     A*
     A
     A          R RMOVJOB                   PFILE(FMOVJOB)
     A*
     A          K MJTDAT
     A          K MJMOVE
     A          K MJHSE
     A          K MJSECT
     A          K MJBAY
     A          K MJNOS
     A          K MJSPKY
