     A*     PRODUCT CLASS MASTER FILE
     A*     KEY = PRODUCT CLASS DESCRIPTION
     A*     FILE NAME - FMPRCL
     A*
     A                                      FIFO
     A          R RMPRCL                    PFILE(FMPRCL)
     A*
     A          K PCDESC
