     A*     ROUTE MASTER FILE
     A*     FILE NAME - FMROUT
     A*
     A                                      UNIQUE
     A          R RMROUT                    TEXT('ROUTE MASTER')
     A            RTCODE         2A         TEXT('ROUTE')
     A                                      COLHDG('Route')
     A            RTDESC        30A         TEXT('DESCRIPTION')
     A                                      COLHDG('Description')
     A*
     A          K RTCODE
