     A*     MONTHLY SALES FILE
     A*     FILE NAME - FMSALEDI
     A*
     A*     LOGICAL FILE INDEXED ON CO, TRANS DATE, INVOICE NUMBER
     A*
     A                                      FIFO
     A          R RMSALE                    PFILE(FMSALE)
     A*
     A          K MSCOMP
     A          K MSTDAT
     A          K MSINV#
