     A*     MONTHLY SALES FILE
     A*     FILE NAME - FMSALEC
     A*
     A*     LOGICAL FILE INDEXED ON CO, CUST
     A*
     A                                      FIFO
     A          R RMSALE                    PFILE(FMSALE)
     A*
     A          K MSCOMP
     A          K MSCUST
