     A*     MONTHLY SALES FILE
     A*     FILE NAME - FMSALE
     A*
     A*     LOGICAL FILE INDEXED ON CO, SLSPER, CUST, ITEM, ACCTG PER
     A*
     A                                      FIFO
     A          R RMSALE                    PFILE(FMSALE)
     A*
     A          K MSCOMP
     A          K MSSLM1
     A          K MSCUST
     A          K MSINV#
     A          K MSSEQ#
