     A*     MONTHLY SALES FILE
     A*     FILE NAME - FMSALE
     A*
     A*     LOGICAL FILE INDEXED ON CO, CUST & ITEM, SLSPER, ACCTG PER
     A*
     A                                      FIFO
     A          R RMSALE                    PFILE(FMSALE)
     A*
     A          K MSCOMP
     A          K MSCUST
     A          K MSITEM
     A          K MSSIZE
     A          K MSSLM1
