     A*     MONTHLY SALES FILE
     A*     FILE NAME - FMSALEI
     A*
     A*     LOGICAL FILE INDEXED ON CO, ITEM, SIZE, WAREHOUSE
     A*
     A                                      FIFO
     A          R RMSALE                    PFILE(FMSALE)
     A*
     A          K MSCOMP
     A          K MSITEM
     A          K MSSIZE
     A          K MSWHSE
