     A          R RMSIZC                    PFILE(FMSIZC)
     A*
     A          K SCSIZE
     A          S SCCATG                    COMP(EQ 'PLUG')
     A          O                           ALL
