     A                                      UNIQUE
     A          R RMSIZCART                 TEXT('SIZE CART SPOTS')
     A            SCSIZE         3A         TEXT('Size Code')
     A                                      COLHDG('Size' 'Code')
     A            SCSPOT         2S 0       TEXT('Cart Spots')
     A                                      COLHDG('Spots' '/Cart' 'on Truck')
     A          K SCSIZE
