     A                                      UNIQUE
     A          R RMSIZC                    TEXT('SIZE MASTER')
     A            SCSIZE         3A         TEXT('Size Code')
     A                                      COLHDG('Size' 'Code')
     A            SCCATG         4A         TEXT('Category Code')
     A                                      COLHDG('Category' 'Code')
     A          K SCSIZE
