     A*     MASTER LIST WORK FILE - BY TRUCK / STOP
     A*     FILE NAME - FMASTLISTTS
     A*
     A*
     A          R RMSTCRTS                  TEXT('MASTER LIST CARTS')
     A                                      PFILE(FMSTCRTS)
     A          K OIRVDT
     A          K OIORD#
     A          K MASTER
