     A*     A/R MONTHLY TRANSACTION FILE
     A*     FILE NAME - FMTRANCD
     A*
     A*     LOGICAL FILE INDEXED ON INVOICE DATE
     A*                             INVOICE NUMBER
     A*
     A                                      FIFO
     A          R RMTRAN                    PFILE(MTRAN0111)
     A*
     A          K MTCUST
     A          K MTTDAT
     A          K MTINV#
