     A*     MONTHLY TRANSACTION FILE
     A*     FILE NAME - FMTRANTY
     A*
     A*     LOGICAL FILE INDEXED ON TRANS. DATE, CUST, CHECK #
     A*
     A                                      FIFO
     A          R RMTRAN                    PFILE(FMTRAN)
     A*
     A          K MTTDAT
     A          K MTCUST
     A          K MTCHEK
