     A*     MONTHLY TRANSACTION FILE
     A*     FILE NAME - FMTRANDT
     A*
     A*     LOGICAL FILE INDEXED ON TRANS. DATE, INVOICE, SUFF, SEQ
     A*
     A                                      FIFO
     A          R RMTRAN                    PFILE(FMTRAN)
     A*
     A          K MTTDAT
     A          K MTINV#
     A          K MTSUFF
     A          K MTSEQ#
