     A                                      UNIQUE
     A          R RMUPC                     PFILE(FMUPC)
     A*
     A          K UPCITEM
     A          K UPCSIZE
