     A*     USER MASTER FILE
     A*     FILE NAME - FMUSER
     A*
     A                                      UNIQUE
     A          R RMUSER                    PFILE(FMUSER)
     A*
     A          K USDEPT
     A          K USUSER
