     A*     VENDOR MASTER FILE
     A*     KEY = OLD DILLON NUMBER
     A*     FILE NAME - FMVEND
     A*
     A                                      UNIQUE
     A          R RMVEND                    PFILE(FMVEND)
     A*
     A          K VMOLD#
