     A*     VENDOR MASTER FILE
     A*     KEY = ZIP CODE
     A*     FILE NAME - FMVEND
     A*
     A                                      FIFO
     A          R RMVEND                    PFILE(FMVEND)
     A*
     A          K VMZIPD
