     A*     VENDOR MASTER FILE BY NAME
     A*     FILE NAME - FMVENDL3
     A*
     A*     LOGICAL FILE INDEXED BY NAME, CUST.
     A*
     A                                      FIFO
     A          R RMVEND                    PFILE(FMVEND)
     A*
     A          K VMNAME
     A          K VMVEND
