     A          R RMZIPS                    TEXT('Carts Master File')
     A                                      PFILE(*LIBL/FMZIPS)
     A          K ZMZIP
