     A*     NEXT CUSTOMER NUMBER MASTER FILE
     A*     FILE NAME - FNXTCUST
     A*
     A*
     A                                      UNIQUE
     A          R RNXTCUST                  TEXT('NEXT CUST #')
     A            NXCUST         6S         TEXT('CUSTOMER #')
     A                                      COLHDG('Customer #')
     A                                      EDTCDE(Z)
     A*
     A          K NXCUST
