     A*     ORDER ENTRY/BILLING CONTROL FILE - ZERO RECORD ONLY
     A*     FILE NAME - FOECTL0
     A*
     A                                      UNIQUE
     A          R ROECTL                    PFILE(FOECTL)
     A          K OCCOMP
     A          S OCCOMP                    COMP(EQ 0)
