     A*     EXTRACT FILE FOR THE SOW/ SHIP SUMMARY REPORTS
     A*     KEY = REQUEST DATE -CYMD
     A*     FILE NAME - FOLABL
     A*
     A                                      FIFO
     A          R ROLABL                    PFILE(*LIBL/FOLABL)
     A*
     A          K LORYMD
