     A*     EXTRACT FILE FOR THE SOW/ SHIP SUMMARY REPORTS
     A*     KEY = SOW DATE-CYMD
     A*     FILE NAME - FOLABL
     A*
     A                                      FIFO
     A          R ROLABL                    PFILE(*LIBL/FOLABL)
     A*
     A          K LOSYMD
