     A*     OLD/NEW ITEM NUMBER FILE
     A*     FILE NAME - FOLDITMX
     A*
     A
     A          R ROLDITM                   PFILE(FOLDITM)
     A*
     A          K OLITEM
     A          K OLSIZE
