     A*     OPEN ORDER VALUE FILE
     A*
     A*     LOGICAL BY A/R CUSTOMER NUMBER, ORDER NUMBER
     A*
     A*
     A
     A          R ROPNORD                   PFILE(FOPNORD)
      *
     A          K OOARCU
     A          K OOORD#
