     A*     OPEN ORDER VALUE FILE
     A*
     A*     LOGICAL BY CUSTOMER NUMBER, ORDER NUMBER
     A*
     A*
     A
     A          R ROPNORD                   PFILE(FOPNORD)
      *
     A          K OOCUST
     A          K OOORD#
