     A*     ORDER HEADER FILE
     A*     FILE NAME - FORDCHG
     A*
     A*
     A
     A          R RORDCHG                   PFILE(FORDCHG)
     A*
     A          K OHLOC
     A          K OHORD#
