     A          R RPARTIAL                  PFILE(FPARTIAL)
     A          K LDITEM
     A          K LDSIZE
     A          K LDREDY
     A          K LDSOWD
     A          K LDTAG#
