     A*     FPAYMENTI  ORDER/INVOICE PAYMENTS
     A*
     A*     LOGICAL BY INVOICE NUMBER
     A*
     A*
     A
     A          R RPAYMNT                   PFILE(FPAYMNT)
      *
     A          K PYINV#
     A          K PYSEQ#
