     A*     DFC PAYROLL TO A/R WORK FILE
     A*     FILE NAME:  FPAYARS
     A*                         CREATED IN PY18E IN QS36SRC PAYLIB
     A*     LOGICAL BY STATUS,EMP# AND W.E. DATE
     A*
     A          R RPAYAR                    PFILE(FPAYAR)
      ** STATUS A=Active  P=Posted
     A*
     A          K PASTAT
     A          K PAEMP#
     A          K PAWEND
