     A*     PRODUCT CLASS SALES FILE
     A*
     A*     LOGICAL BY JULIAN DAY OF YEAR
     A*
     A*
     A
     A          R RPCSDY                    PFILE(FPCSDY)
      *
     A          K SPDYYR
     A          K SPPCL1
