     A*     PRODUCT CLASS SALES FILE
     A*
     A*     LOGICAL BY P.C. AND CYM DATER
     A*
     A*
     A
     A          R RPCSDY                    PFILE(FPCSDY)
      *
     A          K SPPCL1
     A          K SPSHDT
