     A          R RPLGDFT                   PFILE(FPLGDFT)
     A                                      TEXT('S-VIA DEFAULTS')
     A          K PDSEQ#
     A          K PDSVIA
