     A          R RPLGSET                   PFILE(FPLGSET)
     A                                      TEXT('WEEKLY LOCATION FILE')
     A          K PGWKDT
     A          K PGMSTR
     A          K PGORD#
