     A*     POITNSETTIA INVENTORY FILE
     A*     FILE NAME - FPOIITMA
     A*     LOGICAL
     A*
     A                                      UNIQUE
     A          R RPOIITM                   PFILE(FPOIITM)
     A*
     A          K PIYEAR
     A          K PILOOK
     A          K PIITEM
