     A*     POITNSETTIA SOW SCHEDULE FILE
     A*     FILE NAME - FPOISOWA
     A*     LOGICAL
     A*  7/18/02 EFD TAKE SHIP DATE OUT OF KEY
     A*
     A                                      UNIQUE
     A          R RPOISOW                   PFILE(FPOISOW)
     A*
     A          K PSSOWD
     A          K PSSIZE
     A          K PSLOOK
     A          K PSITEM
