     A*     Section Definitions Master File
     A*     FILE NAME - FMSECTSQ
     A*
     A          R RPSECT                    PFILE(FPSECT)
     A          K GHSECT
     A          K GHNORS
     A          K GHBAY
     A          K GHLORR
     A          K GHPSEQ
     A          K GHCART
