     A*     TRUCK SCHEDULE FILE HEADER RECORDS
     A*     FILE NAME - FPUSCHD1
     A*     LOGICAL BY DATE AND TRUCK
     A*
     A*
     A
     A          R RPUHDRH                   PFILE(FPUHDRH)
      *
     A          K THSHDT
     A          K THTRK#
