     A*     TRUCK SCHEDULE FILE HEADER RECORDS
     A*     FILE NAME - FPUSCHD
     A*     LOGICAL BY DATE AND ROUT
     A*
     A*
     A
     A          R RPUHDRH                   PFILE(FPUHDRH)
      *
     A          K THSHDT
     A          K THROUT
