     A*     TRUCK SCHEDULE FILE DETAIL RECORDS
     A*     FILE NAME - FPUSCHDR
     A*     LOGICAL BY TRUCK, DATE AND STOP
     A*
     A*
     A
     A          R RPUSCHD                   PFILE(FPUSCHD)
      *
     A          K TRTRK#
     A          K TRSHDT
     A          K TRSTOP
