     A*     TRUCK SCHEDULE FILE DETAIL RECORDS
     A*     FILE NAME - FTRSCHDR
     A*     LOGICAL BY DATE AND ROUT
     A*
     A*
     A
     A          R RPUSCHD                   PFILE(FPUSCHD)
      *
     A          K TRSHDT
     A          K TRSEQ#
