     A*     TRUCK SCHEDULE FILE DETAIL RECORDS
     A*     FILE NAME - FPUSCHDC
     A*     LOGICAL BY CUSTOMER AND DATE
     A*
     A*
     A
     A          R RPUSCHD                   PFILE(FPUSCHD)
      *
     A          K TRCUST
     A          K TRSHDT
