     A*     ORDER PUT DOWN LOCATION DETAIL FILE
     A*     FILE NAME - FPUTORDI
     A*
      * Modified by William Behr for Project PS2013.
     A                                      FIFO
     A          R RPUTORD                   PFILE(FPUTORD)
     A*
     A          K PDSHPD
     A          K PDMAST
     A          K PDLOOK
     A          K PDITEM
     A          K PDSIZE
     A          K PDLOC
