     A*     TRUCK SCHEDULE FILE
     A*     FILE NAME - FPUUCKSR
     A*
     A*     LOGICAL FOR WORK
     A*
     A                                      FIFO
     A          R RPUUCKS                   PFILE(FPUUCKS)
      *
     A          K TSSHPD
     A          K TSDAY#
     A          K TSROUT
     A          K TSSTOP
     A          K TSZIP
     A          K TSLOOK
