     A*     TRUCK SCHEDULE FILE
     A*     FILE NAME - FPUUCKSC
     A*
     A*     LOGICAL FOR WORK
     A*
     A                                      FIFO
     A          R RPUUCKS                   PFILE(FPUUCKS)
      *
     A          K TSSHPD
     A          K TSSVIA
     A          K TSCUST
