     A*     READY BAY ORDER WORK FILE
     A*     FILE NAME - FRBORDRO
     A*  LOGICAL BY ORDER NUMBER,ITEM ALPHA, SIZE, ITEM
     A
     A          R RRBORDR                   PFILE(FRBORDR)
      *
     A          K TOORD#
     A          K TOLOOK
     A          K TOSIZE
     A          K TOITEM
