     A*     WORK FILE FOR TOP RANKED CUSTOMER
     A*     FILE NAME - FSACSUMD
     A*     LOGICAL BY DOLLARS DESCENDING
     A
     A          R RSACSUM                   PFILE(FSACSUM)
     A*
     A          K FSCURU                    DESCEND
