     A          R FSEDPRCRCD
     A            FLD1       00030S06
     A            FLD2       00030S06
     A            FLD3       00010A
     A            FLD4       00030A
     A            FLD5       00002A
     A            FLD6       00030S06
     A            FLD7       00010A
     A            FLD8       00010A
     A            FLD9       00031A
     A            FLD10      00013A
