     A*     SEED REQUIREMENTS FILE
     A*     FILE NAME - FSEDREQW
     A*  BY WEEK ALPHA AND ITEM
     A                                      UNIQUE
     A          R RSEDREQ                   PFILE(FSEDREQ)
     A*
     A          K SRSOWW
     A          K SRALPH
     A          K SRITEM
     A          K SRSIZE
