     A*     SERIES CODE LOGICAL FILE
     A*     FILE NAME - FSERIESA  BY DESCRIPTION
     A*
     A
     A          R RSERIES                   PFILE(FSERIES)
     A*
     A          K SEDESC
