     A*     VENDOR/SERIES PRICE LOGICAL FILE   BY SERIES
     A*     FILE NAME - FSERPRCS
     A*
     A
     A          R RSERPRC                   PFILE(FSERPRC)
     A*
     A          K SPCODE
     A          K SPVALP
