     A*     SALES HISTORY FILE - DETAIL RECORD
     A*     FILE NAME - FSHIDSCI
     A*
     A*     LOGICAL BY SALESPERSON, CUSTOMER AND ITEM
     A                                      FIFO
     A          R RSHIST                    PFILE(FSHIST)
     A*
     A          K SICOMP
     A          K SISLSM
     A          K SICMAL
     A          K SICUST
     A          K SIITEM
     A          K SISIZE
     A          S SICUST                    RANGE(000001 999999)
     A*
