     A*     SALES HISTORY FILE - SUMMARY RECORD
     A*     FILE NAME - FSHISTST
     A*
     A*     LOGICAL BY COMPANY AND DESCENDING SALES DOLLARS
     A*
     A                                      FIFO
     A          R RSHISTS                   PFILE(FSHISTS)
     A*
     A          K SHCSTL                    DESCEND
     A          K SHCOMP
