     A*     SALES HISTORY BY CUSTOMERS ONLY
     A*     KEY = CUSTOMER NUMBER
     A*     FILE NAME - FSHISTS
     A*
     A          R RSHIST                    PFILE(FSHIST)
     A*
     A          K SICUST
     A          S SICUST                    COMP(NE 0)
