     A*     SALES HISTORY FILE - SUMMARY RECORD
     A*     FILE NAME - FSHISTSL
     A*
     A*     LOGICAL BY COMPANY AND LIST CODE
     A*
     A                                      FIFO
     A          R RSHISTS                   PFILE(FSHISTS)
     A*
     A          K SHCOMP
     A          K SHLIST
