     A*     SALES HISTORY FILE - DETAIL RECORD
     A*     FILE NAME - FSHIDCI
     A*
     A*     LOGICAL BY CUSTOMER AND ITEM
     A                                      FIFO
     A          R RSHIST                    PFILE(FSHIST)
     A*
     A          K SICUST
     A          K SIITEM
     A          K SISIZE
     A*
