     A*     SALES HISTORY FILE - DETAIL RECORD
     A*     FILE NAME - FSHIDSCI
     A*
     A*     LOGICAL BY CUSTOMER AND PRODUCT CLASS
     A*
     A                                      FIFO
     A          R RSHIST                    PFILE(FSHIST)
     A*
     A          K SICOMP
     A          K SICMAL
     A          K SIPCL1
     A          S SICUST                    RANGE(000001 999999)
     A*
