     A*     SALES HISTORY FILE - SUMMARY RECORD
     A*     FILE NAME - FSHISTSI
     A*
     A*     LOGICAL BY ITEM AND SIZE
     A                                      UNIQUE
     A          R RSHISTS                   PFILE(FSHISTS)
     A*
     A          K SHITAL
     A          K SHITEM
     A          K SHSIZE
     A          K SHCOMP
     A*
     A          O SHCUST                    RANGE(000001 999999)
     A          O SHSLSM                    RANGE('A ' '99')
