     A*     SALES HISTORY FILE - DETAIL RECORD
     A*     FILE NAME - FSHIDTSC
     A*
     A*     LOGICAL BY TERRITORY, SALESPERSON, CUSTOMER
     A                                      FIFO
     A          R RSHIST                    PFILE(FSHIST)
     A*
     A          K SICOMP
     A          K SITERR
     A          K SISLSM
     A          K SICMAL
     A          S SICUST                    RANGE(000001 999999)
     A*
