     A*     SALES HISTORY FILE - SUMMARY RECORD
     A*     FILE NAME - FSHISTSS
     A*
     A*     LOGICAL BY COMPANY AND SALESPERSON
     A*
     A                                      UNIQUE
     A          R RSHISTS                   PFILE(FSHISTS)
     A*
     A          K SHCOMP
     A          K SHSLSM
     A          S SHSLSM                    RANGE('A ' '99')
