     A*     SALES HISTORY FILE - SUMMARY RECORD
     A*     FILE NAME - FSHISTSC
     A*
     A*     LOGICAL BY CUSTOMER NUMBER
     A                                      FIFO
     A          R RSHISTS                   PFILE(FSHISTS)
     A*
     A          K SHCUST
