     A*     SALES HISTORY FILE - SUMMARY RECORD
     A*     FILE NAME - FSHISTSU
     A*
     A*     LOGICAL BY COMPANY AND CUSTOMER NUMBER & TOTAL SLS QTY
     A*
     A                                      FIFO
     A          R RSHISTS                   PFILE(FSHISTS)
     A*
     A          K SHCQTL                    DESCEND
     A          K SHCOMP
