     A*     SALES HISTORY FILE - SUMMARY RECORD
     A*     FILE NAME - FSHISTSC
     A*
     A*     LOGICAL BY CUSTOMER ALPHA
     A                                      FIFO
     A          R RSHISTS                   PFILE(FSHISTS)
     A*
     A          K SHCOMP
     A          K SHCMAL
     A          S SHCUST                    RANGE(000001 999999)
