     A*     ORDERS FOR SHIP NEXT
     A*     FILE NAME - FSHPNXT
     A*
     A                                      UNIQUE
     A          R RSHPNXT                   PFILE(FSHPNXT)
     A*
     A          K SNCUST
     A          K SNORD#
