     A          R RSHPOVR
     A            SOCUST         6S 0       TEXT('CUST')
     A            SOSVIA         2A         TEXT('SHIP VIA')
     A            SOSHPR        20A         TEXT('SHIPPER NAME')
     A            SOACCT        20A         TEXT('ACCOUNT TO USE')
