     A*     SHIPPING LOCATION LOT FILE
     A*     KEY = ITEM,SIZE,LOC,SHIP DATE,CUST,PHYTO
     A*     FILE NAME - FSLOTP
     A*
     A                                      FIFO
     A          R RSLOT                     PFILE(FSLOT)
     A*
     A          K MLCOMP
     A          K MLITEM
     A          K MLSIZE
     A          K MLSLOC
     A          K MLSHPD
     A          K MLCUST
     A          K MLPHYT
