     A*     DAILY SALES FILE
     A*
     A*     LOGICAL BY JULIAN DAY OF YEAR
     A*
     A*
     A
     A          R RSLSDY                    PFILE(FSLSDY)
      *
     A          K SYDYYR
     A          K SYSHFR
