     A*     SHIPPED ORDER HISTORY
     A*
     A*     LOGICAL BY CUSTOMER, ITEM, SHIP DATE AND ORDER #
     A*
     A*
     A                                      FIFO
     A          R RSOHST                    PFILE(FSOHST)
      *
     A          K SOLOOK
     A          K SOCUST
     A          K SOPCL1
     A          K SOSIZE
     A          K SOITEM
