     A*     SHIPPED ORDER HISTORY
     A*
     A*     LOGICAL BY SHIP DATE, SIZE, PRODUCT CLASS, AND ITEM CODE
     A*
     A*
     A                                      FIFO
     A          R RSOHST                    PFILE(FSOHST)
      *
     A          K SOSHDT
     A          K SOSIZE
     A          K SOPCL1
     A          K SOITEM
