     A*     SHIPPED ORDER HISTORY
     A*
     A*     LOGICAL BY ITEM/SIZE, SHIP DATE(DESCENDING) & CUST ALPHA
     A*
     A*
     A                                      FIFO
     A          R RSOHST                    PFILE(FSOHST)
      *
     A          K SOITEM
     A          K SOSIZE
     A          K SOSHDT                    DESCEND
     A          K SOLOOK
