     A*     SHIPPED ORDER HISTORY
     A*
     A*     LOGICAL BY CUSTOMER, SHIP DATE AND ORDER #
     A* 11/16/00 EFD ADDED SIZE AND ITEM FOR KUBE PAK
     A*
     A                                      FIFO
     A          R RSOHST                    PFILE(FSOHST)
      *
     A          K SOCUST
     A          K SOSHDT                    DESCEND
     A          K SOORD#
     A          K SOSIZE
     A          K SOITEM
