     A*     SOWING TYPE MASTER FILE
     A*     FILE NAME - FSOWTYP
     A*
     A                                      UNIQUE
     A          R RSOWTYP                   TEXT('SOWING TYPE')
     A            STCODE         1A         TEXT('SOWING TYPE')
     A                                      COLHDG('Sow' 'Type')
     A            STDESC        30A         TEXT('DESCRIPTION')
     A                                      COLHDG('Description')
     A*
     A          K STCODE
