     A*     SOW LINE SCHEDULE FILE
     A
     A          R RSOWSCH                   PFILE(FSOWSCH)
     A*
     A          K SORDYD
     A          K SOLOOK
     A          K SOITEM
     A          K SOSIZE
