     A*     SOW LINE SCHEDULE FILE
     A*     FILE NAME - FSOWSCH
     A* LOGICAL BY SOW DATE, SEEDER,SIZE,DRUM,MIX,FILL TYPE,ALPHA,ITEM
     A
     A          R RSOWSCH                   PFILE(FSOWSCH)
     A*
     A          K SOSOWD
     A          K SOTRYC
     A          K SOSIZE
     A          K SOALTP
     A          K SOMSCX
     A          K SOTPSW
     A          K SOLOOK
     A          K SOITEM
     A          K SORDYD
