     A*     SOW LINE SCHEDULE FILE
     A*     FILE NAME - FSOWSCH
     A* LOGICAL BY SOW DATE, JOB #
     A
     A          R RSOWSCH                   PFILE(FSOWSCH)
     A*
     A          K SOSOWD
     A          K SOJOB#
