     A          R RSOWNBY
     A                                      PFILE(FSOWNBY)
      *
     A          K SBCARD
     A          O SBATTT                    COMP(NE     -
     A                                        '0001-01-01-00.00.00.000000')
     A          O SBCARD                    COMP(EQ 0)
     A          O SBDATE                    COMP(LT '2006-08-01')
