     A*     STANDING ORDER HEADER FILE
     A*     FILE NAME - FSTANDHC
     A*     LOGICAL BY CUST ALPHA AND ORDER #
     A*
     A                                      FIFO
     A          R RSTANDH                   PFILE(FSTANDH)
     A*
     A          K SHALPH
     A          K SHORD#
