     A*     STANDING ORDER HEADER FILE
     A*     FILE NAME - FSTANDHC
     A*     LOGICAL BY CUST# AND DESCRIPTRION
     A*
     A                                      FIFO
     A          R RSTANDH                   PFILE(FSTANDH)
     A*
     A          K SHCUST
     A          K SHDESC
