     A*     UNRELEASED STANDING ORDER DETAIL FILE
     A*     FILE NAME - FSTANDUO
     A*
     A*
     A                                      FIFO
     A          R RSTANDU                   PFILE(FSTANDU)
     A*
     A          K SUORD#
