     A*     STANDING ORDER STATUS FILE
     A*     FILE NAME - FSTANSTD
     A*     LOGICAL BY DEPARTMENT, USER, REQ DATE
     A*
     A                                      FIFO
     A          R RSTANST                   PFILE(FSTANST)
     A*
     A          K STSHFR
     A          K STRUSR
     A          K STREQY
     A          K STALPH
