     A*     STANDING ORDER DETAIL FILE
     A*     FILE NAME - FSTANDII
     A*     LOGICAL BY ITEM, SIZE, WHSE
     A*
     A
     A          R RSTANDI                   PFILE(FSTANDI)
     A*
     A          K SIITEM
     A          K SISIZE
     A          K SIWHSE
