     A*     READY ROSE ORDER HEADER FILE
     A*     FILE NAME - FSTRROHC
     A*     LOGICAL BY CUST ALPHA AND ORDER #
     A*
     A                                      FIFO
     A          R RSTRROH                   PFILE(FSTRROH)
     A*
     A          K RHALPH
     A          K RHORD#
