     A*     READY ROSE ORDER STATUS FILE
     A*     FILE NAME - FSTRRSTD
     A*     LOGICAL BY DEPARTMENT, USER, REQ DATE
     A*
     A                                      FIFO
     A          R RSTRRST                   PFILE(FSTRRST)
     A*
     A          K RTSHFR
     A          K RTRUSR
     A          K RTREQY
     A          K RTALPH
