     A*     READY ROSE ORDER HEADER FILE
     A*     FILE NAME - FSTRROHC
     A*     LOGICAL BY CUST# AND DESCRIPTRION
     A*
     A                                      FIFO
     A          R RSTRROH                   PFILE(FSTRROH)
     A*
     A          K RHCUST
     A          K RHDESC
