     A*     READY ROSE ORDER DETAIL FILE
     A*     FILE NAME - FSTRROII
     A*     LOGICAL BY ITEM, SIZE, WHSE
     A*
     A
     A          R RSTRROI                   PFILE(FSTRROI)
     A*
     A          K RIITEM
     A          K RISIZE
     A          K RIWHSE
