     A*     TAX JURISDICTION DETAIL FILE
     A*     FILE NAME - FTAXDS
     A*
     A                                      FIFO
     A          R RTAXDS                    PFILE(FTAXDS)
     A*
     A          K TDTXJU
     A          K TDYEAR
     A          K TDMTH
     A          K TDINV#
