     A*     INVENTORY TRANSACTION FILE
     A*
     A*     LOGICAL BY DATE AND TIME
     A*
     A*
     A                                      FIFO
     A          R RTINVT                    PFILE(FTINVT)
      *
     A          K ITITEM
     A          K ITSIZE
     A          K ITTWSE
