     A*     INVENTORY TRANSACTION FILE
     A*
     A*     LOGICAL BY:      REASON (ITREAS 255-257)
     A*                 REASON CODE (ITRSCD 236-236)
     A*
     A*
     A                                      FIFO
     A          R RTINVTT                   PFILE(FTINVTT)
      *
     A          K ITREAS
     A          K ITRSCD
