     A*     INVENTORY TRANSACTION FILE
     A*
     A*     LOGICAL BY:   TYPE; DATE; REF; WSE; ITEM; SIZE
     A*
     A*
     A                                      FIFO
     A          R RTINVT                    PFILE(FTINVT)
      *
     A          K ITTDAT
     A          K ITTYPE
     A          K ITTREF
     A          K ITTWSE
     A          K ITITEM
     A          K ITSIZE
