     A*     INVENTORY TRANSACTION FILE
     A*
     A*     LOGICAL BY DATE AND TYPE
     A*
     A*
     A                                      FIFO
     A          R RTINVT                    PFILE(FTINVT)
      *
     A          K ITTYPE
     A          K ITTDAT
