     A*     INVENTORY TRANSACTION FILE
     A*
     A*     LOGICAL BY DATE AND TYPE
     A*
     A*
     A                                      FIFO
     A          R RTINVT                    PFILE(FTINVT)
      *
     A          K ITTDAT
     A          K ITTYPE
     A          K ITSIZE
     A          K ITITEM
     A          S ITTYPE                    COMP(EQ 'A')
     A          S ITTYPE                    COMP(EQ 'R')
