     A*     A/P TO BE PAID FILE
     A*     FILE NAME - FTOPAY
     A*                 LOGICAL FILE FOR CHECK PROCESSING
     A*
     A                                      FIFO
     A          R RTOPAY                    PFILE(FTOPAY)
     A*
     A          K TPCOMP
     A          K TPCHEK
     A          K TPVEND
     A          K TPVOUC
     A          K TPINV#
     A          K TPSEQ#
     A          K TPITYP
