     A*     A/P TO BE PAID FILE
     A*     FILE NAME - FTOPAY
     A*                 LOGICAL FILE FOR CHECK REGISTER
     A*
     A                                      FIFO
     A          R RTOPAY                    PFILE(FTOPAY)
     A*
     A          K TPCOMP
     A          K TPCHEK
