     A*     TRAY FILE   LOGICAL BY READY DATE/ITEM/SIZE
     A*     FILE NAME - FTRAYD
     A*      KEYS:CRDT:ITEM:SIZE
     A*
     A          R RTRAY                     PFILE(FTRAY)
      *
     A          K TRCRDT
     A          K TRITEM
     A          K TRSIZE
