     A*     TRAY FILE   LOGICAL BY SOW DATE/ITEM/SIZE
     A*     FILE NAME - FTRAYSIS
     A*      KEYS:CRDT:ALPH:ITEM:SIZE
     A*
     A          R RTRAY                     PFILE(FTRAY)
      *
     A          K TRCRDT
     A          K TRALPH
     A          K TRITEM
     A          K TRSIZE
