     A          R RTRAYFIXED
     A                                      PFILE(FTRAYFIXED)
      *
     A          K TFTIME
     A          O TFSTAT                    COMP(NE 'P')
