     A*     TRAY FILE   LOGICAL BY SOW DATE/LINE/ITEM/SIZE
     A*     FILE NAME - FTRAYD
     A*      KEYS:SCYW:JOB#:TAG#
     A*
     A          R RTRAY                     PFILE(FTRAY)
      *
     A          K TRSCYW
     A          K TRJOB#
     A          K TRTAG#
