     A*     CONTAINS TRANSFERS OF GREENHOUSE PRODUCTS TO SALES BRS
     A*     FILE NAME - FTRANSFD
     A*     LOGICAL BY DATE
     A
     A          R RTRANSF                   PFILE(FTRANSF)
     A*
     A          K TRDATE
     A          K TRITEM
     A          K TRSIZE
     A*
