     A*     TRAY FILE   LOGICAL BY SOW DATE/ITEM/SIZE
     A*     FILE NAME - FTRAYSIS
     A*      KEYS:ITEM:SCYM:SIZE
     A*
     A          R RTRAY                     PFILE(FTRAY)
      *
     A          K TRITEM
     A          K TRSCYM
     A          K TRSIZE
