     A          R RTRAYFIXED
     A                                      PFILE(FTRAYFIXED)
      *
     A          K TFCARD
     A          O TFATTT                    COMP(NE     -
     A                                        '0001-01-01-00.00.00.000000')
     A          O TFCARD                    COMP(EQ 0)
