     A*     TRAY FILE   LOGICAL BY SOW DATE/LINE/ITEM/SIZE
     A*     FILE NAME - FTRAYD
     A*      KEYS:SCYM:ALPH:ITEM:SIZE
     A*
     A          R RTRAYR                    PFILE(FTRAYR)
      *
     A          K TRSCYM
     A          K TRALPH
     A          K TRITEM
     A          K TRSIZE
