     A*     TRAY FILE   LOGICAL BY ITEM/SIZE/SOW DATE/READY DATE
     A* 10/06/97 EFD ADD READY WEEK AS PART OF KEY
     A*     FILE NAME - FTRAYD
     A*      KEYS:ITEM:SIZE:SCYW:ACYW
     A*
     A          R RTRAYR                    PFILE(FTRAYR)
      *
     A          K TRITEM
     A          K TRSIZE
     A          K TRSCYW
     A          K TRACYW
