     A*     CONTAINS TRANSFERS OF GREENHOUSE PRODUCTS TO SALES BRS
     A*     FILE NAME - FTRANSFF
     A*     LOGICAL BY "FROM BR"
     A
     A          R RTRANSF                   PFILE(FTRANSF)
     A*
     A          K TRFRBR
     A          K TRTOBR
     A          K TRLIST
     A          K TRDATE
     A          K TRITEM
     A          K TRSIZE
     A*
