      *     TRAY FILE   LOGICAL BY ITEM/SIZE/SOW DATE/READY DATE
      *     FILE NAME - FTRAYLOT
      *      KEYS:ITEM:SIZE:SCYM:CRDT
     A          R RTRAY                     PFILE(FTRAY)
      *
     A          K TRITEM
     A          K TRSIZE
     A          K TRSCYM
     A          K TRCRDT
