     A*     TRAY FILE   LOGICAL BY SOW DATE/LINE/ITEM/SIZE
     A*     FILE NAME - FTRAYD
     A*      KEYS:SCYW:LIN#:ITEM:SIZE
     A*
     A          R RTRAY                     PFILE(FTRAY)
      *
     A          K TRSCYW
     A          K TRLIN#
     A          K TRITEM
     A          K TRSIZE
