     A*     CONTAINS TRANSFERS OF GREENHOUSE PRODUCTS TO SALES BRS
     A*     FILE NAME - FTRANSFI
     A*     LOGICAL BY INVOICE # AND ITEM/SIZE
     A
     A          R RTRANSF                   PFILE(FTRANSF)
     A*
     A          K TRINV
     A          K TRITEM
     A          K TRSIZE
     A*
