     A*     TRUCK SCHEDULE FILE HEADER RECORDS
     A*     FILE NAME - FTRSCHD1
     A*     LOGICAL BY DATE AND TRUCK
     A*
     A*
     A
     A          R RTRHDRH                   PFILE(FTRHDRH)
      *
     A          K THSHDT
     A          K THTRK#
