     A*     TRUCK SCHEDULE FILE HEADER RECORDS
     A*     FILE NAME - FTRSCHD
     A*     LOGICAL BY DATE AND ROUT
     A*
     A*
     A
     A          R RTRHDRH                   PFILE(FTRHDRH)
      *
     A          K THSHDT
     A          K THROUT
