     A*     ORDER TRAY FILE
     A*     FILE NAME - FTRORDO
     A* LOGICAL BY ORDER NUMBER AND SEQ
     A*
     A
     A          R RTRORD                    PFILE(FTRORD)
      *
     A          K TOSHDT
     A          K TOMAST
     A          K TOORD#
     A          K TOSEQ#
