     A*     ORDER TRAY FILE
     A*     FILE NAME - FTRORDO
     A* LOGICAL BY: SHDT ORD# TAG#
     A*
     A
     A          R RTRORD                    PFILE(FTRORD)
      *
     A          K TOSHDT
     A          K TOORD#
     A          K TOTAG#
