     A*     TRUCK SCHEDULE FILE DETAIL RECORDS
     A*     FILE NAME - FTRSCHDTO
     A*     LOGICAL BY TRUCK AND ORDER NUMBER
     A*
     A*
     A
     A          R RTRSCHD                   PFILE(FTRSCHD)
      *
     A          K TRTRK#
     A          K TRORD#
     A          K TRSHDT
