     A*     TRUCK SCHEDULE FILE DETAIL RECORDS
     A*     FILE NAME - FTRSCHDR
     A*     LOGICAL BY TRUCK, DATE AND STOP
     A*
     A*
     A
     A          R RTRSCHD                   PFILE(FTRSCHD)
      *
     A          K TRTRK#
     A          K TRSHDT
     A          K TRSTOP
