     A*     TRUCK SCHEDULE FILE DETAIL RECORDS
     A*     FILE NAME - FTRSCHDR
     A*     LOGICAL BY DATE AND CUSTOMER
     A*
     A*
     A
     A          R RTRSCHD                   PFILE(FTRSCHD)
      *
     A          K TRSHDT
     A          K TRCUST
