     A*     TRUCK SCHEDULE FILE DETAIL RECORDS
     A*     FILE NAME - FTRSCHDC
     A*     LOGICAL BY CUSTOMER AND DATE
     A*
     A*
     A
     A          R RTRSCHD                   PFILE(FTRSCHD)
      *
     A          K TRSHDT
     A          K TRCUST
     A          K TRORD#
