     A*     TRUCK SCHEDULE FILE
     A*     FILE NAME - FTRUCKSC
     A*
     A*     LOGICAL FOR WORK
     A*
     A                                      FIFO
     A          R RTRUCKS                   PFILE(FTRUCKS)
      *
     A          K TSSHPD
     A          K TSSVIA
     A          K TSCUST
