     A*     TRUCK SCHEDULE FILE
     A*     FILE NAME - FTRUCKSR
     A*
     A*     LOGICAL FOR WORK
     A*
     A                                      FIFO
     A          R RTRUCKS                   PFILE(FTRUCKS)
      *
     A          K TSSHPD
     A          K TSDAY#
     A          K TSROUT
     A          K TSSTOP
     A          K TSZIP
     A          K TSLOOK
