     A*      FREIGHT ZONE MASTER FILE
     A*      FILE NAME - FUZONE
     A*
     A                                      FIFO
     A          R RUZONE                    PFILE(FUZONE)
     A*
     A          K FZONE
