     A*     WEEKLY ORDER STATUS FILE BY: SHDT MAST ORD#
     A*     FILE NAME - FWKORDS
     A*
      * Modified by William Behr for Project PS2013.
     A
     A          R RWKORD                    PFILE(FWKORD)
      *
     A          K OWSHDT
     A          K OWMAST
     A          K OWORD#
