     A          R DGDTL                     PFILE(HGPODT)
     A          K DDVNDR
     A          K DDLOOK
     A          K DDITEM
     A          K DDSIZE
