     A                                      UNIQUE
     A          R DGHDR                     PFILE(HGPOHD)
     A          K DGVNDR
     A          K DGPOYR
     A          K DGDGPO
     A          S DGOST                     COMP(EQ 'O')
