     A                                      UNIQUE
     A          R DGHDR                     PFILE(HGPOHD)
     A          K DGPOYR
     A          K DGDGPO
     A          S DGPRTF                    COMP(NE ' ')
