     A          R DGREC                     PFILE(HGPORC)
     A          K DRPOYR
     A          K DRDGPO
     A          K DRREC#
     A          K DRITEM
     A          K DRSIZE
