     A                                      UNIQUE
     A          R DGRHDR                    PFILE(HGROHD)
     A          K DGVNDR
     A          K DGPOYR
     A          K DGDGPO
