     A          R DGRDTL                    PFILE(HGRODT)
     A          K DDLOOK
     A          K DDITEM
     A          K DDSIZE
     A          K DDVNDR
