     A          R DGRDTL                    PFILE(HGRODT)
     A          K DDVNDR
     A          K DDLOOK
     A          K DDRCID
     A          K DDITEM
     A          K DDSIZE
