     A                                      UNIQUE
     A          R DGRHDR                    PFILE(HGROHD)
     A          K DGPOYR
     A          K DGDGPO
     A          S DGOST                     COMP(EQ 'H')
