     A                                      UNIQUE
     A          R DGRHDR                    PFILE(HGROHD)
     A          K DGPODC
     A          K DGPODY
     A          K DGPODM
     A          K DGPODD
     A          K DGPOYR
     A          K DGDGPO
     A          S DGOST                     COMP(EQ 'O')
