     A          R DGRDTL                    PFILE(HGRODT)
     A          K DDPOYR
     A          K DDDGPO
     A          K DDLOOK
     A          K DDITEM
     A          K DDSIZE
     A          S DDRSTS                    COMP(EQ 'O')
