     A          R DGHISTR                   PFILE(KPHIST)
     A          K DHPITM
     A          K DHPSIZ
     A          K DHCYMD                    DESCEND
