     A          R DGHISTR                   PFILE(KPHIST)
     A          K DHCYMD                    DESCEND
     A          K DHCLOK
     A          K DHPITM
     A          K DHPSIZ
