     A                                      UNIQUE
     A          R ITMWHSR                   PFILE(KPITMWHS)
     A          K IWPITM
     A          K IWSIZE
     A          K IWWHSE
