     A                                      UNIQUE
     A          R DGHDR                     PFILE(KPPOHD)
     A          K DGPODC
     A          K DGPODY
     A          K DGPODM
     A          K DGPODD
     A          K DGPOYR
     A          K DGDGPO
