     A          R DGDTL                     PFILE(KPPODT)
     A          K DDPOYR
     A          K DDDGPO
     A          K DDLOOK
     A          K DDITEM
     A          K DDSIZE
     A          S DDRSTS                    COMP(EQ 'O')
