     A                                      UNIQUE
     A          R DGHDR                     PFILE(KPPOHD)
     A          K DGPOYR
     A          K DGDGPO
     A          S DGPRTF                    COMP(NE ' ')
