     A          R DGDTL                     PFILE(KPPODT)
     A          K DDVNDR
     A          K DDLOOK
     A          K DDITEM
     A          K DDSIZE
