     A                                      UNIQUE
     A          R DGRHDR                    PFILE(KPROHD)
     A          K DGPODC
     A          K DGPODY
     A          K DGPODM
     A          K DGPODD
     A          K DGPOYR
     A          K DGDGPO
