     A                                      UNIQUE
     A          R DGRHDR                    PFILE(KPROHD)
     A          K DGVNDR
     A          K DGPOYR
     A          K DGDGPO
     A          S DGOST                     COMP(EQ 'H')
