     A                                      UNIQUE
     A          R DGRHDR                    PFILE(KPROHD)
     A          K DGPOYR
     A          K DGDGPO
     A          S DGPRTF                    COMP(NE ' ')
     A            DGRCID                    COMP(EQ 'IM')
