     A                                      UNIQUE
     A          R WHSE                      PFILE(KPWHOUSE)
     A          K WHWCNM
     A          K WHWHSE
