     A          R LASTUSEDR                 TEXT('LAST USED')
     A            OBJECT        10A         TEXT('OBJECT USED')
     A            LIBRARY       10A         TEXT('OBJECT LIBRARY')
     A            STAMP           Z         TEXT('TIMESTAMP USED')
     A            INTBAT         1A         TEXT('INTERACTIVE / BATCH')
     A            JOBNAME       10A         TEXT('JOB NAME')
     A            JOBUSER       10A         TEXT('JOB USER')
     A            JOBNUMBER      6S 0       TEXT('JOB NUMBER')
