     A          R MASTERTRCD
     A            FLD1       00006A
     A            FLD2       00008A
     A            FLD3       00006A
     A            FLD4       00007A
     A            FLD5       00015A
     A            FLD6       00015A
     A            FLD7       00010A
     A            FLD8       00030A
     A            FLD9       00030A
     A            FLD10      00029A
     A            FLD11      00018A
     A            FLD12      00002A
     A            FLD13      00005A
