     A          R RMTDROP                   PFILE(MTDSHIST)
     A*
     A          K MTORD#
     A          K MTTMSTMP
     A          K MTSDAT
     A          K MTPROD
