     A*     CART FILE
     A*     FILE NAME - FCARTCC
     A* LOGICAL BY SHIP CART #,CONTROL #,ITEM,SIZE,TAG#
     A*
     A
     A          R RCART                     PFILE(NCART)
      *
     A          K CTCART
     A          K CTCNTL
     A          K CTSHDT
     A          K CTMSTR
     A          K CTITEM
     A          K CTSIZE
     A          K CTCSEQ
