     A*     CART FILE
     A*
     A
     A          R RCART                     PFILE(NCART)
      *
     A          K CTSHDT
     A          K CTMSTR
     A          K CTITEM
     A          K CTSIZE
     A          K CTTIME
     A          K CTORD#
     A          K CTSEQ#
