     A*     CART FILE
     A*     FILE NAME - FCARTCI
     A* LOGICAL BY CART, CONTROL,LOCATION,SIZE,ALPHA AND ITEM
     A* 5/17/02 EFD ADD ORDER NUMBER TO KEY
     A
     A          R RCART                     PFILE(NCART)
      *
     A          K CTCART
     A          K CTCNTL
     A          K CTSHDT
     A          K CTMSTR
     A          K CTLOC
     A          K CTORD#
     A          K CTSIZE
     A          K CTLOOK
     A          K CTITEM
