     A*     CART FILE
     A*     FILE NAME - FCARTCS
     A* LOGICAL BY SHIP DATE, CART #
     A*
     A
     A          R RCART                     PFILE(NCART)
      *
     A          K CTSHDT
     A          K CTMSTR
     A          K CTCART
