     A*     ORDER PUT DOWN LOCATION DETAIL FILE
     A*     FILE NAME - FPUTERRA
     A*
     A                                      FIFO
     A          R RPUTERR                   PFILE(NPUTERR)
     A*
     A          K PESHPD
     A          K PEMSTR
     A          K PESIZE
     A          K PELOOK
