     A*     ORDER PUT DOWN LOCATION DETAIL FILE
     A*     FILE NAME - FPUTSCNUPC
     A*
     A                                      FIFO
     A          R RPUTSCN                   PFILE(NPUTSCN)
     A*
     A          K PSSHPD
     A          K PSMSTR
     A          K PSORD#
     A          K PSSIZE
     A          K PSITEM
