     A*     ORDER PUT DOWN LOCATION DETAIL FILE
     A*     FILE NAME - FPUTORDI
     A*
     A                                      FIFO
     A          R RPUTORD                   PFILE(NPUTORD)
     A*
     A          K PDSHPD
     A          K PDMSTR
     A          K PDITEM
     A          K PDSIZE
     A          K PDLOC
