     A*     ORDER PUT DOWN LOCATION DETAIL FILE
     A*     FILE NAME - FPUTERRA
     A*         KEYS:  PESHPD:PEMSTR:PEUPC:PEOVER:PESHRT:PEORD#
     A                                      FIFO
     A          R RPUTERR                   PFILE(NPUTERR)
     A*
     A          K PESHPD
     A          K PEMSTR
     A          K PEUPC
     A          K PEOVER                    DESCEND
     A          K PESHRT                    DESCEND
     A          K PEORD#                    DESCEND
