     A*     ORDER TRAY ERROR FILE
     A*     FILE NAME - FTROREO
     A* LOGICAL BY ORDER NUMBER
     A*
     A
     A          R RTRORE                    PFILE(NTRORE)
      *
     A          K TESHDT
     A          K TEMSTR
     A          K TEORD#
