     A*     WEEKLY ORDER STATUS FILE
     A*     FILE NAME - FWKORDS
     A*
     A
     A          R RWKORD                    PFILE(NWKORD)
      *
     A          K OWSHDT
     A          K OWMSTR
     A          K OWORD#
