     A                                      UNIQUE
     A          R PCK900R                   TEXT('PCK900 FLAG')
     A            ORDER#         6S 0       TEXT('ORDER')
     A            PCK900         1A         TEXT('PCK900 RUN')
     A            TIMESTAMP       Z         TEXT('TIMESTAMP')
     A          K ORDER#
