     A*     RB2014FILE
     A*
      * Files Modified by William Behr for Project RB2014.
     A
     A          R RFILE                     TEXT('FILE')
     A            PROJFILE      10A         TEXT('Project File')
     A                                      COLHDG('Project' 'File')
