     A          R ROTATER                   PFILE(RB_ROTATE)
      *
     A*  SHPD MAST SIZE ALPH ITEM
     A          K RTSHPD
     A          K RTMAST
     A          K RTSIZE
     A          K RTALPH
     A          K RTITEM
