     A          R RINVUSER                  TEXT('RB INV USERS')
     A            RBIUSR        10A         TEXT('RB INV USER')
     A                                      COLHDG('RB' 'Inventory' 'User')
     A          K RBIUSR
