     A*     INVENTORY LOT BALANCE READY DATE FILE
     A*     FILE NAME - FDLOTRD
     A          R RDLOTRD                   PFILE(RBLOTRD)
     A          K LRITEM
     A          K LRSIZE
     A          K LRSOWD
     A          K LRCRDY
     A          K LRCUST                    DESCEND
     A          O LRCUST                    COMP(EQ 999997)
