     A                                      UNIQUE
     A          R FUTURER                   PFILE(READYFW)
     A          K DES1
     A          K ITEM
     A          K SIZE
