     A          R FUTURED                   TEXT('FUTURE AVAILABILITY')
     A            ITEM          12A         TEXT('ITEM')
     A            SIZE           3A         TEXT('SIZE')
     A            DES1          30A         TEXT('ITEM DESCRIPTION')
     A            QTAVW1         7A         TEXT('QTY WK 1')
     A            QTAVW2         7A         TEXT('QTY WK 2')
     A            QTAVW3         7A         TEXT('QTY WK 3')
     A            QTAVW4         7A         TEXT('QTY WK 4')
     A            QTAVW5         7A         TEXT('QTY WK 5')
