     A          R TESTSFR                   TEXT('TEST S/F')
     A            IMITEM        12A         TEXT('ITEM')
     A            IMSIZE         3A         TEXT('SIZE')
     A            PTABID         2A         TEXT('TABLE')
     A            ORDER          7S 0       TEXT('ORDERED')
     A            TOSOW          7S 0       TEXT('TO SOW')
     A            FIXERS         7S 0       TEXT('FIXERS')
     A            RATE           5S 2       TEXT('% RATE')
