     A*     TEST FILE
     A*     FILE NAME - TESTF
     A*
     A          R RTESTF                    TEXT('TEST')
     A            TSAMNT         9A         TEXT('AMOUNT')
     A                                      COLHDG('AMOUNT')
