     A*     VENDOR X-REF FILE
     A*     FILE NAME - VENOLD
     A*     LOGICAL BY NEW #
     A                                      UNIQUE
     A          R RVENOLD                   PFILE(VENOLD)
     A*
     A          K NEWNO
