     A*     VENDOR X-REF FILE
     A*     FILE NAME - VENOLD
     A*
     A                                      UNIQUE
     A          R RVENOLD                   TEXT('VENDOR X-REF')
     A            OLDNO          5A         TEXT('OLD #')
     A                                      COLHDG('Old #')
     A            NEWNO          6S         TEXT('NEW CUST #                 ')
     A                                      COLHDG('New Vend #')
     A*
     A          K OLDNO
