     A                                      UNIQUE
     A          R TBMASTR                   PFILE(XATABL)
     A            TBTB               I      SST(TBTBCD 1 2)
     A            TBC6               I      SST(TBTBCD 3 6)
     A            TBSHRT
     A            TBLONG
     A            TBKEYP
     A          K TBC6
     A          S TBTB                      COMP(EQ 'TB')
