     A                                      UNIQUE
     A          R TBMASTR                   PFILE(XATABL)
     A            TBBROK
     A            TBTBCD
     A            TBSHRT
     A            TBLONG
     A            TBTB               I      SST(TBTBCD 1 2)
     A          K TBBROK
     A          K TBTBCD
     A          O TBTB                      COMP(NE 'BR')
