     A*%%TS  SD  20060824  162609  BILLB       REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R CLOCK01
     A*%%TS  SD  20060824  162609  BILLB       REL-V5R3M0  5722-WDS
     A                                      CF12(12 'Cancel')
     A                                      CF04(04 'View Attendance')
     A                                      CF03(03 'Exit')
     A                                      CF07(07 'exit')
     A                                      RTNCSRLOC(*RECNAME &CSRRCD &CSRFLD)
     A                                      WINDOW(4 35 12 42)
     A                                  3  1'          Scan User Bar Code      -
     A                                              '
     A                                      DSPATR(RI)
     A                                      COLOR(PNK)
     A                                  4  1'                                  -
     A                                              '
     A                                      DSPATR(RI)
     A                                      COLOR(PNK)
     A                                      DSPATR(UL)
     A                                  2  1'                                  -
     A                                              '
     A                                      DSPATR(RI)
     A                                      COLOR(PNK)
     A                                  1  1'                                #T-
     A                                      imeClock'
     A                                      DSPATR(UL)
     A                                      COLOR(PNK)
     A            CSRRCD        10A  H
     A            CSRFLD        10A  H
     A                                 10 32'F12'
     A                                      DSPATR(HI)
     A                                 10 36'=Cancel'
     A                                      COLOR(BLU)
     A            $#MSID         7A  P
     A  50        ERRMSG        40A  B 11  1DSPATR(HI)
     A                                      MSGID(&$#MSID KPMSGF)
     A                                  9  1'F4'
     A                                      DSPATR(HI)
     A                                  9  4'=View Attendance'
     A                                      COLOR(BLU)
     A                                  7  6'Employee Number:'
     A            EMPLOYEE#      8Y 0B  7 24EDTCDE(4)
     A                                      CHECK(ER)
     A                                      DSPATR(PC)
     A                                 10  1'F3'
     A                                      DSPATR(HI)
     A                                 10  4'=Exit'
     A                                      COLOR(BLU)
     A          R CLOCK02
     A*%%TS  SD  20060824  160645  BILLB       REL-V5R3M0  5722-WDS
     A                                      WINDOW(4 35 12 42)
     A                                      CF11(11 'Toggle In/Out')
     A                                      CF12(12 'Cancel')
     A                                      CF08(08 'Change Job Code')
     A                                      CF06(06 'Print Labels')
     A                                      CF03(03 'Exit')
     A                                      RTNCSRLOC(*RECNAME &CSRRCD &CSRFLD)
     A  61                              3  1'          User Clock OUT Function -
     A                                              '
     A                                      DSPATR(RI)
     A  61                                  COLOR(RED)
     A                                  4  1'                                  -
     A                                              '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A  61                                  COLOR(RED)
     A                                  2  1'                                  -
     A                                              '
     A                                      DSPATR(RI)
     A  61                                  COLOR(RED)
     A                                  1  1'                                #T-
     A                                      imeClock'
     A                                      DSPATR(UL)
     A  61                                  COLOR(RED)
     A            CSRRCD        10A  H
     A            CSRFLD        10A  H
     A                                 10 32'F12'
     A                                      DSPATR(HI)
     A                                 10 36'=Cancel'
     A                                      COLOR(BLU)
     A            $#MSID         7A  P
     A N61                              3  1'          User Clock IN Function  -
     A                                              '
     A                                      DSPATR(RI)
     A  61                                  COLOR(RED)
     A  50        ERRMSG        40A  B 11  1DSPATR(HI)
     A                                      MSGID(&$#MSID KPMSGF)
     A                                  6  4'Name:'
     A            NAME          30A  O  6 10
     A                                 10  1'F11'
     A                                      DSPATR(HI)
     A  61                             10  5'=Clock IN'
     A  61                                  COLOR(BLU)
     A N61                             10  5'=Clock OUT'
     A N61                                  COLOR(BLU)
     A                                  7 28'F8'
     A                                      DSPATR(HI)
     A                                  7 31'=Chg Job'
     A                                      COLOR(BLU)
     A            JOB       R        O  7 11REFFLD(TBMASTR/TBSHRT *LIBL/XATABL)
     A                                 10 18'F6'
     A                                      DSPATR(HI)
     A                                 10 21'=Labels'
     A                                      COLOR(BLU)
     A                                  9  1'F3'
     A                                      DSPATR(HI)
     A                                  9  5'=Exit'
     A                                      COLOR(BLU)
     A                                  9 17'<ENTER>'
     A                                      DSPATR(HI)
     A                                  9 25'=Continue'
     A                                      COLOR(BLU)
     A          R ASSUME
     A*%%TS  SD  20040423  114217  BILLB       REL-V5R1M0  5722-WDS
     A                                      ASSUME
     A                                  1  3' ASSUME                           -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                  '
