     A*%%TS  SD  20000906  102455  EFD         REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF07
     A                                      CF06
     A          R SCRNA
     A*%%TS  SD  20000906  102455  EFD         REL-V3R7M0  5716-PW1
     A                                  1  2'ALPADA'
     A                                  1 21' Call Item Alpha Search Available -
     A                                      Only '
     A                                      DSPATR(RI)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 73TIME
     A                                 12 23'Department:'
     A            DEDESC        30A  O 12 41
     A                                  6 23'Alpha Search:'
     A            VALPHA        15A  B  6 37
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A                                      DSPATR(PC)
     A  10                                  ERRMSG('*** You must enter a search-
     A                                       word.      Press RESET')
     A                                  8 23'Size Code?'
     A            SIZE           3A  B  8 37
     A  20                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  20                                  DSPATR(PC)
     A  20                                  ERRMSG('*** Invalid Size code enter-
     A                                      ed.         Press RESET')
     A                                 10 13'NOTE: Only enter a size to limit s-
     A                                      earch to a size code.'
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'          Enter to Process        -
     A                                       F6=Restart         F3/F7=End Job  -
     A                                               '
     A                                      DSPATR(UL)
     A            DEPT           3   B 12 37
     A  30                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  30                                  DSPATR(PC)
     A  30                                  ERRMSG('*** Invalid Department Ente-
     A                                      red.       Press RESET')
     A          R SCRNE
     A*%%TS  SD  19980826  202722  EFD         REL-V3R7M0  5716-PW1
     A                                  1  2'ALPAE'
     A                                  2  2USER
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  1 29' Call Item Alpha Search '
     A                                      DSPATR(RI)
     A                                  9 10' You cannot use the program. You h-
     A                                      ave NO assigned Department. '
     A                                      DSPATR(RI)
     A                                 12 29' Press Enter to Return.'
     A                                      DSPATR(RI)
