     A*%%TS  SD  19990713  095204  TGMS        REL-V4R2M0  5769-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      USRDSPMGT
     A          R SCRNA
     A*%%TS  SD  19990713  095204  TGMS        REL-V4R2M0  5769-PW1
     A                                      CF03
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A            PROGID        10A  O  1  2
     A                                  1 28' A/P Open Payables Report '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 33'For Company:'
     A            LCO            2S 0O  2 46DSPATR(HI)
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  5 26'As of Date:'
     A            LDATE          6Y 0B  5 47DSPATR(CS)
     A                                      EDTCDE(Y)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A  10                                  ERRMSG('*** Enter A Valid Date.    -
     A                                         Press Reset')
     A                                  7 26'Report Sequence:'
     A            LSEQ           1Y 0B  7 54EDTCDE(Z)
     A                                      DSPATR(CS)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A  20                                  ERRMSG('*** Valid Entries Are 1 or -
     A                                      2.    Press Reset')
     A                                  7 58' 1 = By Alpha Search  '
     A                                  8 58' 2 = By Vendor Number '
     A                                 10 26'Printer ID:'
     A            LPRTR         10A  B 10 45DSPATR(CS)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A  50                                  ERRMSG('*** Printer ID Is Required.-
     A                                           Press Reset')
     A                                 11 26'Forms Number:'
     A            LFORM         10A  B 11 45DSPATR(CS)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A  51                                  ERRMSG('*** Forms Number Is Require-
     A                                      d.   Press Reset')
     A                                 12 26'Number of Copies:'
     A            LCOPY          2Y 0B 12 53EDTCDE(Z)
     A                                      DSPATR(CS)
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A  52                                  ERRMSG('*** Number Of Copies Is Req-
     A                                      uired.    Press Reset')
     A                                 13 26'Run From JobQ:'
     A            LJOBQ          1A  B 13 54DSPATR(CS)
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A  53                                  ERRMSG('*** Valid Entries Are Y or -
     A                                      N.     Press Reset')
     A                                 14 26'Print Status:'
     A            VOUT           1Y 0B 14 54EDTCDE(Z)
     A                                      DSPATR(CS)
     A  54                                  DSPATR(RI)
     A  54                                  DSPATR(PC)
     A  54                                  ERRMSG('*** Valid Entries Are 1, 2 -
     A                                      or 3.    Press Reset')
     A                                 14 57'1 = Print'
     A                                 15 57'2 = Print/Save'
     A                                 16 57'3 = Hold'
     A                                 19  3' *  ''AS OF'' Date is compared to -
     A                                      the Accounting Period Date in open -
     A                                      payables.'
     A                                      DSPATR(HI)
     A                                 20 13'Payments or Vouchers with a later -
     A                                      date are not included.'
     A                                      DSPATR(HI)
     A                                 21 16' Validate Data - Change or Press E-
     A                                      nter to Accept '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'                Enter to Process  -
     A                                         F3/F7=Cancel Job                -
     A                                               '
     A                                      DSPATR(UL)
