     A*%%TS  SD  19991011  102930  TGMS        REL-V4R2M0  5769-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      USRDSPMGT
     A                                      INDARA
     A          R SCRNA
     A*%%TS  SD  19991011  102930  TGMS        REL-V4R2M0  5769-PW1
     A                                      CF03
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HLPRTN
     A                                      HOME
     A                                      HELP
     A                                      ALWROL
     A                                      INVITE
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A  99                                  PUTOVR
     A                                      PRINT(*PGM)
     A                                  1 24' A/P Check Print Recover from Jam '
     A                                      DSPATR(RI)
     A  99                                  OVRATR
     A                                  1 66'Date:'
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 66'Time:'
     A                                  2 72TIME
     A            LSTGDC         6Y 0B  8 57
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  10N11N12                            ERRMSG('*** Last Good Check Number -
     A                                      Is Required.    Press Reset')
     A  10 11                               ERRMSG('*** Last Good Check Number -
     A                                      Must be in range of Current Batch. -
     A                                       Press Reset')
     A            LSTCHK         6  0O 16 57EDTCDE(Z)
     A  11                                  DSPATR(RI)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A  99                                  OVRATR
     A                                 23  2'                  Enter to Process-
     A                                               F3/F7=Cancel Job          -
     A                                               '
     A                                      DSPATR(UL)
     A                                  1  2'APC332A'
     A                                  8 17'Enter Check Number of Last Good Ch-
     A                                      eck:'
     A                                 10 17'Enter Check Number to Restart Prin-
     A                                      ting:'
     A            VCHECK         6Y 0B 10 57
     A  20                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  20                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  20N21                               ERRMSG('*** Check Number Is Require-
     A                                      d.    Press Reset')
     A  21                                  ERRMSG('*** Check Number Must Be Hi-
     A                                      gher Than Last Good Check Printed. -
     A                                       Press Reset')
     A                                 15 17'First Check Number in Current Batc-
     A                                      h:'
     A                                 16 17'Last Check Number in Current Batch-
     A                                      :'
     A                                 20  3' WARNING: Beginning check # is mor-
     A                                      e than 10 numbers higher than last -
     A                                      check # '
     A  96                                  DSPATR(RI)
     A N96                                  DSPATR(ND)
     A                                 21 12' Change check number - or - Press -
     A                                      Enter to continue '
     A  96                                  DSPATR(RI)
     A N96                                  DSPATR(ND)
     A            FSTCHK         6  0O 15 57EDTCDE(Z)
     A  11                                  DSPATR(RI)
     A          R SCRNB
     A*%%TS  SD  19990415  055817  EFD         REL-V3R1M0  5763-PW1
     A                                      DSPMOD(*DS3)
     A                                      PRINT(*PGM)
     A                                      INVITE
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A  99                                  PUTOVR
     A                                      ALWROL
     A                                      CF03
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HLPRTN
     A                                      HOME
     A                                      HELP
     A                                  1  2'APC332B'
     A                                  1 24' A/P Check Print Recover From Jam '
     A                                      DSPATR(RI)
     A  99                                  OVRATR
     A                                  1 66'Date:'
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 66'Time:'
     A                                  2 72TIME
     A                                  6 24'Date to Print on Check:'
     A            LDATE          6Y 0B  6 51
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      EDTCDE(Y)
     A  11                                  ERRMSG('*** Enter A Valid Date.    -
     A                                      Press Reset')
     A  12                                  ERRMSG('*** Payment Approval Has No-
     A                                      t Been Run - or - Has Errors.    Pr-
     A                                      ess Reset')
     A  15                                  ERRMSG('*** Check Date Earlier Than-
     A                                       Beginning Of Fiscal Year.   Press -
     A                                      Reset')
     A  62                                  ERRMSG('*** Previous Check Run Must-
     A                                       Be Posted Before Printing Checks. -
     A                                       Press Reset')
     A                                  8 24'Number of Checks to Void:'
     A            LVOID          2Y 0B  8 57DSPATR(CS)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A                                 10 15'Checks:'
     A                                 10 24'Printer ID:'
     A            LPRTR1        10A  B 10 49CHECK(FE)
     A                                      DSPATR(CS)
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A  99                                  OVRATR
     A  52                                  ERRMSG('*** Check Printer ID Is Req-
     A                                      uired.    Press Reset')
     A                                 11 24'Forms Number:'
     A            LFORM1        10A  B 11 49DSPATR(CS)
     A  99                                  OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A  30                                  ERRMSG('*** Check Forms Number Is R-
     A                                      equired.   Press Reset')
     A                                 14 15'Report:'
     A                                 14 24'Printer ID:'
     A            LPRTR2        10A  B 14 49CHECK(FE)
     A                                      DSPATR(CS)
     A  99                                  OVRATR
     A                                 15 24'Forms Number:'
     A            LFORM2        10A  B 15 49DSPATR(CS)
     A  99                                  OVRATR
     A                                 16 24'Print Status:'
     A            VOUT           1Y 0B 16 58
     A  53                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  53                                  DSPATR(PC)
     A                                      EDTCDE(Z)
     A  53                                  ERRMSG('*** Valid Entries Are 1, 2 -
     A                                      or 3.     Press Reset')
     A                                 16 62'1 = Print'
     A                                 17 62'2 = Print/Save'
     A                                 18 62'3 = Hold'
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A  99                                  OVRATR
     A                                 23  2'                  Enter to Process-
     A                                                  F7=Cancel Job          -
     A                                               '
     A                                      DSPATR(UL)
     A          R SCRNERR
     A*%%TS  SD  19990414  190328  EFD         REL-V3R1M0  5763-PW1
     A                                      DSPMOD(*DS3)
     A                                      PRINT(*PGM)
     A                                      INVITE
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A  99                                  PUTOVR
     A                                      ALWROL
     A                                      CF03
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HLPRTN
     A                                      HOME
     A                                      HELP
     A                                  1 24' A/P Check Print Recover from Jam '
     A                                      DSPATR(RI)
     A  99                                  OVRATR
     A                                  1 66'Date:'
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 66'Time:'
     A                                  2 72TIME
     A                                  1  2'APC332ERR'
     A                                  8  9' There is no open check run to rec-
     A                                      over. Press Enter to end job. '
     A                                      DSPATR(RI)
