     A*%%TS  SD  19990713  095343  TGMS        REL-V4R2M0  5769-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      USRDSPMGT
     A          R SCRNA
     A*%%TS  SD  19990713  095343  TGMS        REL-V4R2M0  5769-PW1
     A                                      CF03
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A          H                           HLPRCD(SCRHELP)
     A  *DS3                                HLPARA(01 002 24 080)
     A  *DS4                                HLPARA(01 002 24 080)
     A            PROGID        10A  O  1  2
     A                                  1 15'Help'
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                  1 31' A/P Start Up Post '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  5 31'Company Number:'
     A            LCO            2Y 0B  5 48
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A  11                                  ERRMSG('*** Enter A Valid Company N-
     A                                      umber.    Press Reset')
     A  12                                  ERRMSG('*** Start Up Edit Must Be R-
     A                                      un Before Post.    Press Reset')
     A                                 13 14'* NOTE:'
     A                                      DSPATR(RI)
     A                                      COLOR(RED)
     A                                 13 25'No other users can be in Accounts'
     A                                 14 25'Payable while this post is running-
     A                                      .'
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'                  Enter to Process-
     A                                               F3/F7=Cancel Job          -
     A                                               '
     A                                      DSPATR(UL)
     A          R SCRHELP
     A*%%TS  SD  19990713  095343  TGMS        REL-V4R2M0  5769-PW1
     A                                 17  2' Start Up Post                    -
     A                                                                    Overv-
     A                                      iew     '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  2'                                  -
     A                                                                         -
     A                                              '
     A                                      DSPATR(HI)
     A                                 19  2' The accounts payable records ente-
     A                                      red in A/P Start Up Entry will be a-
     A                                      dded    '
     A                                      DSPATR(HI)
     A                                 20  2' to the open accounts payable file-
     A                                       for the company entered here.     -
     A                                              '
     A                                      DSPATR(HI)
     A                                 21  2'                                  -
     A                                                                         -
     A                                              '
     A                                      DSPATR(HI)
     A                                 22  2' You can not change the data in th-
     A                                      is file after you run this post.   -
     A                                              '
     A                                      DSPATR(HI)
     A                                 23  2'                                  -
     A                                                                         -
     A                                              '
     A                                      DSPATR(HI)
     A                                 24  2'                            Press -
     A                                      Enter To Return                    -
     A                                              '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
