     A*%%TS  SD  19990323  065531  EFD         REL-V3R1M0  5763-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      USRDSPMGT
     A          R SCRNA
     A*%%TS  SD  19990323  065531  EFD         REL-V3R1M0  5763-PW1
     A                                      CF03
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A          H                           HLPRCD(OHELP)
     A  *DS3                                HLPARA(01 002 24 080)
     A  *DS4                                HLPARA(01 002 24 080)
     A            PROGID        10A  O  1  2
     A                                  1 15'Help'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  1 26' A/R Summary Invoice Register '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  6 28'Company Number:'
     A                                 10 28'Forms Number:'
     A            VFORM          4A  B 10 52DSPATR(CS)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A  50                                  ERRMSG('*** Forms Number Is Require-
     A                                      d.    Press Reset')
     A                                 11 28'Number of Copies:'
     A            VCOPY          2Y 0B 11 54
     A  51                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  51                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A  51                                  ERRMSG('*** Number of Copies Is Req-
     A                                      uired.    Press Reset')
     A                                 12 28'Printer ID:'
     A            VPRTR         10A  B 12 46DSPATR(CS)
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A  52                                  ERRMSG('*** Printer ID Is Required.-
     A                                           Press Reset')
     A                                 13 28'Print Status:'
     A            VOUT           1Y 0B 13 55
     A  53                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  53                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A  53                                  ERRMSG('*** Valid Entries Are 1, 2 -
     A                                      or 3.    Press Reset')
     A                                 13 59'1 = Print'
     A                                 14 59'2 = Print/Save'
     A                                 15 59'3 = Hold'
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'                 Enter to Process -
     A                                                F7=Cancel Job            -
     A                                               '
     A                                      DSPATR(UL)
     A            LCO            2  0O  6 54
     A          R OHELP
     A*%%TS  SD  19990204  080625  EFD         REL-V3R1M0  5763-PW1
     A                                 17  2' Summary Invoice Entry Edit Regist-
     A                                      er                             Over-
     A                                      view     '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(HI)
     A                                 19  2' The invoice edit register prints -
     A                                      a list of the unposted invoices tha-
     A                                      t were   '
     A                                      DSPATR(HI)
     A                                 20  2' entered in Summary Invoice Entry.-
     A                                        It is suggested that this report -
     A                                      be       '
     A                                      DSPATR(HI)
     A                                 21  2' reviewed for accuracy before you -
     A                                      post these invoices.               -
     A                                               '
     A                                      DSPATR(HI)
     A                                 23  2'                            Press -
     A                                      Enter to Return                    -
     A                                               '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(HI)
