     A*%%TS  SD  19990924  073440  TGMS        REL-V4R2M0  5769-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      USRDSPMGT
     A                                      INDARA
     A          R SCRNA
     A*%%TS  SD  19990924  073440  TGMS        REL-V4R2M0  5769-PW1
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF03
     A                                      CF02
     A                                      CF05
     A                                      INVITE
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                      PRINT(*PGM)
     A          H                           HLPRCD(OHELP)
     A  *DS3                                HLPARA(01 002 24 080)
     A  *DS4                                HLPARA(01 002 24 080)
     A            LPROG          8A  O  1  2
     A                                  1 15'Help'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  1 25' Monthly Cash Receipts Journal '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  5 26'Accounting Period:'
     A            VACTP          2D 0B  5 52DSPATR(CS)
     A                                      CHECK(RZ)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A  10                                  ERRMSG('*** Enter A Valid Accountin-
     A                                      g Period.     Press Reset')
     A                                  9 26'Printer ID:'
     A            LPRTR         10A  B  9 44DSPATR(CS)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A  50                                  ERRMSG('*** Printer ID Is Required.-
     A                                           Press Reset')
     A                                 10 26'Forms Number:'
     A            LFORM         10A  B 10 44DSPATR(CS)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A  51                                  ERRMSG('*** Forms Number Is Require-
     A                                      d.    Press Reset')
     A                                 11 26'Number of Copies:'
     A            LCOPY          2Y 0B 11 52
     A  52                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  52                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A  52                                  ERRMSG('*** Number of Copies Is Req-
     A                                      uired.    Press Reset')
     A                                 12 26'Run From JobQ:'
     A            LJOBQ          1A  B 12 53DSPATR(CS)
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A  53                                  ERRMSG('*** Valid Entries Are Y or -
     A                                      N.     Press Reset')
     A                                 13 26'Print Status:'
     A            VOUT           1Y 0B 13 53
     A  54                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  54                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A  54                                  ERRMSG('*** Valid Entries Are 1, 2 -
     A                                      or 3.    Press Reset')
     A                                 13 57'1 = Print'
     A                                 14 57'2 = Print/Save'
     A                                 15 57'3 = Hold'
     A                                 21 16' Validate Data - Change or Press E-
     A                                      nter to Accept '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2' Enter to Process   F2=Disp Acctg -
     A                                      Periods   F5=Selections   F3/F7=Can-
     A                                      cel Job  '
     A                                      DSPATR(UL)
     A                                  2 33'For Company:'
     A            LCO            2S 0O  2 46DSPATR(HI)
     A          R SCRNB
     A*%%TS  SD  19990924  073440  TGMS        REL-V4R2M0  5769-PW1
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF02
     A                                      CF03
     A                                      INVITE
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                      PRINT(*PGM)
     A            LPROG          8A  O  1  2
     A                                  1 25' Monthly Cash Receipts Journal '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  3 31' Report Selections '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  5  2'Include Only Cash Receipts:'
     A                                  7 27'Dated:'
     A                                  7 41'From:'
     A            VBDATE         6Y 0B  7 48DSPATR(CS)
     A                                      EDTCDE(Y)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A  12                                  ERRMSG('*** Enter A Valid Date.    -
     A                                       Press Reset')
     A  11                                  ERRMSG('*** From Date Is Required. -
     A                                            Press Reset')
     A  13                                  ERRMSG('*** From Date Cannot Be Hig-
     A                                      her Than To Date.    Press Reset')
     A                                  7 58'To:'
     A            VEDATE         6Y 0B  7 63DSPATR(CS)
     A                                      EDTCDE(Y)
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A  18                                  ERRMSG('*** Enter A Valid Date.    -
     A                                         Press Reset')
     A                                  9 27'For Salesperson?'
     A            LSLSM          2A  B  9 54DSPATR(CS)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A  20                                  ERRMSG('*** Enter A Valid Salespers-
     A                                      on.     Press Reset')
     A                                 11 27'For A/R Customer:'
     A            LARCST         6Y 0B 11 50DSPATR(CS)
     A                                      EDTCDE(Z)
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A  40                                  ERRMSG('*** Enter A Valid Customer -
     A                                      Number.    Press Reset')
     A                                 13 27'Coded As Adjustment:'
     A            LADJ           1A  B 13 55DSPATR(CS)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A  50                                  ERRMSG('*** Valid Entries Are Y or -
     A                                      N.    Press Reset')
     A                                 15 27'Coded As On Account:'
     A            LONACT         1A  B 15 55DSPATR(CS)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A  65                                  ERRMSG('*** Valid Entries Are Y or -
     A                                      N.     Press Reset')
     A                                 21 16' Validate Data - Change or Press E-
     A                                      nter to Accept '
     A  55                                  DSPATR(RI)
     A N55                                  DSPATR(ND)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'     Enter to Process     F2=Looku-
     A                                      p A/R Customer      F3/F7=Cancel Jo-
     A                                      b        '
     A                                      DSPATR(UL)
     A          R OHELP
     A*%%TS  SD  19990327  075953  EFD         REL-V3R1M0  5763-PW1
     A                                  8  3' Monthly Cash Receipts Journal    -
     A                                                                     Over-
     A                                      view    '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9  3'                                  -
     A                                                                         -
     A                                              '
     A                                      DSPATR(HI)
     A                                 10  3' The monthly cash receipts journal-
     A                                       is a list of all the cash receipts-
     A                                       that   '
     A                                      DSPATR(HI)
     A                                 11  3' were entered into the system duri-
     A                                      ng a particular accounting period. -
     A                                      One line'
     A                                      DSPATR(HI)
     A                                 12  3' per receipt is printed showing th-
     A                                      e receipt date, a/r customer number-
     A                                       and    '
     A                                      DSPATR(HI)
     A                                 13  3' name, invoice number, type of pay-
     A                                      ment, check number, amount of payme-
     A                                      nt, and '
     A                                      DSPATR(HI)
     A                                 14  3' general ledger number for adjustm-
     A                                      ents.                              -
     A                                              '
     A                                      DSPATR(HI)
     A                                 15  3'                                  -
     A                                                                         -
     A                                              '
     A                                      DSPATR(HI)
     A                                 16  3' The report selections lets you fu-
     A                                      rther define the receipts that you -
     A                                      want    '
     A                                      DSPATR(HI)
     A                                 17  3' printed on this report.          -
     A                                                                         -
     A                                              '
     A                                      DSPATR(HI)
     A                                 18  3'                                  -
     A                                                                         -
     A                                              '
     A                                      DSPATR(HI)
     A                                 19  2'  While it is called the  Monthly -
     A                                       Cash Receipts Journal, you can pri-
     A                                      nt the   '
     A                                      DSPATR(HI)
     A                                 20  3' report any time during the month.-
     A                                        It is recommended that it is prin-
     A                                      ted at  '
     A                                      DSPATR(HI)
     A                                 22  3' trail for all of that accounting -
     A                                      periods cash receipts.             -
     A                                              '
     A                                      DSPATR(HI)
     A                                 21  3' month end with no report selectio-
     A                                      ns.  This report will provide the a-
     A                                      udit    '
     A                                      DSPATR(HI)
     A                                 23  3'                                  -
     A                                                                         -
     A                                              '
     A                                      DSPATR(HI)
     A                                 24  3'                           Press E-
     A                                      nter to Return                     -
     A                                              '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
