     A*%%TS  SD  20020627  155132  EFD         REL-V5R1M0  5722-WDS
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A          R SCRNA
     A*%%TS  SD  20020627  155132  EFD         REL-V5R1M0  5722-WDS
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF03
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 33'For Company:'
     A            LCO            2S 0O  2 46DSPATR(HI)
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  5 23'A/R Customer Number:'
     A            VACUST         6Y 0B  5 48EDTCDE(Z)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A  11                                  ERRMSG('*** Enter A Valid Customer -
     A                                      Number.   Press Reset')
     A  12                                  ERRMSG('*** Enter Either Customer o-
     A                                      r Alpha.   Press Reset')
     A                                  6 23'or Alpha Search'
     A            VALPHA        15A  B  6 48DSPATR(CS)
     A                                  7 23'or Telephone Number'
     A            VATELE        10A  B  7 48DSPATR(CS)
     A            CANAME        30A  O  8 48
     A                                 11 23'Begining Date:'
     A            BDATE          6Y 0B 11 48DSPATR(CS)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                      EDTWRD('  /  /  ')
     A  20                                  ERRMSG('*** Enter A Valid Date.    -
     A                                           Press Reset')
     A                                 15 23'Printer ID:'
     A            LPRTR         10A  B 15 48DSPATR(CS)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A  50                                  ERRMSG('*** Printer ID Is Required.-
     A                                           Press Reset')
     A                                 16 23'Forms Number:'
     A            LFORM         10A  B 16 48DSPATR(CS)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A  51                                  ERRMSG('*** Forms Number Is Require-
     A                                      d.    Press Reset')
     A                                 17 23'Number of Copies:'
     A            LCOPY          2Y 0B 17 56
     A  52                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  52                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A  52                                  ERRMSG('*** Number of Copies Is Req-
     A                                      uired.    Press Reset')
     A                                 18 23'Run From JobQ:'
     A            LJOBQ          1A  B 18 57
     A  53                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  53                                  DSPATR(PC)
     A  53                                  ERRMSG('*** Valid Entries Are Y or -
     A                                      N.     Press Reset')
     A                                 19 23'Print Status:'
     A            VOUT           1Y 0B 19 57
     A  54                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  54                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A  54                                  ERRMSG('*** Valid Entries Are 1, 2 -
     A                                      or 3.    Press Reset')
     A                                 19 62'1 = Print'
     A                                 20 62'2 = Print/Save'
     A                                 21 62'3 = Hold'
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'            Enter to Process      -
     A                                            F3/F7=End of Job             -
     A                                               '
     A                                      DSPATR(UL)
     A                                  1  2'ARCDAYA'
     A                                  1 27' Days to Pay Report Prompt '
     A                                      DSPATR(RI)
     A                                 13 23'Ending Date:'
     A            EDATE          6Y 0B 13 48EDTCDE(Y)
     A                                      DSPATR(CS)
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A  30N31                               ERRMSG('*** Enter A Valid Date.    -
     A                                           Press Reset')
     A  31                                  ERRMSG('*** Ending Date cannot be l-
     A                                      ess than Begining date.     Press R-
     A                                      ESET')
     A                                 10 23'Date range of invoices to include -
     A                                      on report.'
     A                                      DSPATR(UL)
     A                                 11 58'Leave blank for all'
     A                                 12 58'invoices.'
