     A*%%TS  SD  19990622  161312  EFD         REL-V3R7M0  5716-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      USRDSPMGT
     A          R SCRNA
     A*%%TS  SD  19990622  160124  EFD         REL-V3R7M0  5716-PW1
     A                                      CF03
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A          H                           HLPRCD(HELPA1)
     A  *DS3                                HLPARA(05 055 06 069)
     A  *DS4                                HLPARA(05 055 06 069)
     A          H
     A N95                                  HLPRCD(HELPA1)
     A  *DS3                                HLPARA(05 055 06 069)
     A  *DS4                                HLPARA(05 055 06 069)
     A                                  1  2'ARV011A'
     A                                  1 26' Customer Master Maintenance '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  3  2'Help'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  5 26'Customer Number:'
     A            VCUST          6Y 0B  5 47
     A  14                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  14                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  11 14 99                            ERRMSG('*** Either Customer Number -
     A                                      or Alpha Search is Required.   Pres-
     A                                      s Reset')
     A  17 14 99                            ERRMSG('*** Either Customer Number -
     A                                      or Alpha Search Can Be Entered - No-
     A                                      t Both')
     A  36 14 99                            ERRMSG('*** This Customer Number Is-
     A                                       Not on File.     Press Reset')
     A  37 14 99                            ERRMSG('*** Customer Number is Dele-
     A                                      ted.                Press Reset')
     A                                  6 26'or Alpha Search'
     A            VALPHA        15A  B  6 47DSPATR(CS)
     A                                      DSPATR(MDT)
     A  14                                  DSPATR(RI)
     A            CMNAME        30A  O  7 47
     A                                  9 26'Company Number:'
     A            VCO            2D 0B  9 47CHECK(RZ)
     A                                      DSPATR(CS)
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A  19 99                               ERRMSG('*** Company Number is Inval-
     A                                      id.         Press Reset')
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'                      Enter to Pro-
     A                                      cess     F3/F7=End of Job          -
     A                                               '
     A                                      DSPATR(UL)
     A          R SCRNF
     A*%%TS  SD  19990622  161312  EFD         REL-V3R7M0  5716-PW1
     A                                      CF02
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF05
     A                                      ALWROL
     A                                      INVITE
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A          H                           HLPRCD(HELPF)
     A  *DS3                                HLPARA(01 001 22 078)
     A  *DS4                                HLPARA(01 001 22 078)
     A                                  1  2'ARV011F'
     A                                  1 26' Customer Master Maintenance '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  5 21'T R U C K   R O U T E S   &   S T -
     A                                      O P S'
     A                                      DSPATR(UL)
     A                                  7 38'Route'
     A                                      DSPATR(UL)
     A                                  7 52'Stop'
     A                                      DSPATR(UL)
     A                                  9 21'Monday'
     A            CMRTE1         2A  B  9 40
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A            CMSTP1         3Y 0B  9 53
     A N50                                  DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 10 21'Tuesday'
     A            CMRTE2         2A  B 10 40
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A            CMSTP2         3Y 0B 10 53
     A N50                                  DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 11 21'Wednesday'
     A            CMRTE3         2A  B 11 40
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A            CMSTP3         3Y 0B 11 53
     A N50                                  DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 12 21'Thursday'
     A            CMRTE4         2A  B 12 40
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A            CMSTP4         3Y 0B 12 53
     A N50                                  DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 13 21'Friday'
     A            CMRTE5         2A  B 13 40
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A            CMSTP5         3Y 0B 13 53
     A N50                                  DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 14 21'Saturday'
     A            CMRTE6         2A  B 14 40
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A            CMSTP6         3Y 0B 14 53
     A N50                                  DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 15 21'Sunday'
     A            CMRTE7         2A  B 15 40
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A            CMSTP7         3Y 0B 15 53
     A N50                                  DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 21 16' Validate Data - Change or Press E-
     A                                      nter to Accept '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2' Enter to Process                 -
     A                                                 F3/F7=End of Job        -
     A                                               '
     A                                      DSPATR(UL)
     A                                 17 27'F5 = Dup Monday in all days'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A          R SCRNH
     A*%%TS  SD  19990622  161312  EFD         REL-V3R7M0  5716-PW1
     A                                      CF02
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF03
     A                                      ALWROL
     A                                      INVITE
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A          H                           HLPRCD(HELPH)
     A  *DS3                                HLPARA(08 001 20 077)
     A  *DS4                                HLPARA(08 001 20 077)
     A                                  1  2'ARV011H'
     A                                  1 26' Customer Master Maintenance '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A            VMODE         10A  O  2 34DSPATR(RI)
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  4  2'Customer:'
     A            CMCUST         6Y 0O  4 13EDTCDE(Z)
     A            CMNAME        30A  O  4 22
     A                                  6 31'D I R E C T I O N S'
     A                                      DSPATR(RI)
     A                                  8  2'Map Coordinates:'
     A            CMCOR1         2A  B  8 19
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A                                  8 22'-'
     A            CMCOR2         2A  B  8 24
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A            CMDR01        72A  B 10  6
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            CMDR02        72A  B 11  6
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            CMDR03        72A  B 12  6
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            CMDR04        72A  B 13  6
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            CMDR05        72A  B 14  6
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            CMDR06        72A  B 15  6
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            CMDR07        72A  B 16  6
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            CMDR08        72A  B 17  6
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            CMDR09        72A  B 18  6
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            CMDR10        72A  B 19  6
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            CMDR11        72A  B 20  6
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A                                      CHECK(LC)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2' Enter to Process       F2=Previou-
     A                                      s Screen       F3/F7=End of Job    -
     A                                               '
     A                                      DSPATR(UL)
     A          R HELPA
     A*%%TS  SD  19940121  121854  GINNY       REL-V2R2M0  5738-PW1
     A                                      CLRL(*NO)
     A                                 24  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(RI)
     A                                  9  2' '
     A                                      DSPATR(RI)
     A                                 13  2' '
     A                                      DSPATR(RI)
     A                                 14  2' '
     A                                      DSPATR(RI)
     A                                 15  2' '
     A                                      DSPATR(RI)
     A                                  9 79' '
     A                                      DSPATR(RI)
     A                                 17  4' next available Customer Number to-
     A                                       this Customer.           '
     A                                 16  2' '
     A                                      DSPATR(RI)
     A                                 17  2' '
     A                                      DSPATR(RI)
     A                                 18  2' '
     A                                      DSPATR(RI)
     A                                 19  4' On a Change, Delete, Reactivate o-
     A                                      r Inquiry - enter either the Custom-
     A                                      er   '
     A                                 19  2' '
     A                                      DSPATR(RI)
     A                                 20  4' Number or Alpha Search Name to lo-
     A                                      ok up the Customer Number.         -
     A                                           '
     A                                 20  2' '
     A                                      DSPATR(RI)
     A                                 21  2' '
     A                                      DSPATR(RI)
     A                                 22  2' '
     A                                      DSPATR(RI)
     A                                 23  2' '
     A                                      DSPATR(RI)
     A                                 22  4' A valid Company Number to which t-
     A                                      his Customer is affiliated is requi-
     A                                      red.'
     A                                  8  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(RI)
     A                                  9  4'                                  -
     A                                                                         -
     A                                           '
     A                                 10  4' This Customer Number contains the-
     A                                       data associated with the Ship To  -
     A                                          '
     A                                 10  2' '
     A                                      DSPATR(RI)
     A                                 12  2' '
     A                                      DSPATR(RI)
     A                                 11  5'Location.  On the next screen, you-
     A                                       can enter different Customer Numbe-
     A                                      rs  '
     A                                 11  2' '
     A                                      DSPATR(RI)
     A                                 12  5'to determine where Accounts Receiv-
     A                                      able, Invoicing and Sales Analysis -
     A                                         '
     A                                 13  5'data should be posted when shipmen-
     A                                      ts or credit memos are processed   -
     A                                        '
     A                                 14  5'for this Ship To Location.        -
     A                                                                         -
     A                                        '
     A                                 10 79' '
     A                                      DSPATR(RI)
     A                                 11 79' '
     A                                      DSPATR(RI)
     A                                 12 79' '
     A                                      DSPATR(RI)
     A                                 13 79' '
     A                                      DSPATR(RI)
     A                                 14 79' '
     A                                      DSPATR(RI)
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 16  5'On an Add - do not enter a Custome-
     A                                      r Number - the system will assign t-
     A                                      he'
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 19 79' '
     A                                      DSPATR(RI)
     A                                 20 79' '
     A                                      DSPATR(RI)
     A                                 21 79' '
     A                                      DSPATR(RI)
     A                                 22 79' '
     A                                      DSPATR(RI)
     A                                 23 79' '
     A                                      DSPATR(RI)
     A                                 15  4'                                  -
     A                                                                         -
     A                                           '
     A                                 18  4'                                  -
     A                                                                         -
     A                                           '
     A                                 21  4'                                  -
     A                                                                         -
     A                                           '
     A                                 23  4'                                  -
     A                                                                         -
     A                                           '
     A          R HELPA1
     A*%%TS  SD  19950410  095942  EFD         REL-V2R2M0  5738-PW1
     A                                      CLRL(*NO)
     A                                 22 26'                                  -
     A                                                     '
     A                                      DSPATR(RI)
     A                                 10 26' '
     A                                      DSPATR(RI)
     A                                 11 26' '
     A                                      DSPATR(RI)
     A                                 12 26' '
     A                                      DSPATR(RI)
     A                                 13 26' '
     A                                      DSPATR(RI)
     A                                 11 28' For an Add - Enter a Customer Num-
     A                                      ber that   '
     A                                 10 74' '
     A                                      DSPATR(RI)
     A                                 11 74' '
     A                                      DSPATR(RI)
     A                                 12 74' '
     A                                      DSPATR(RI)
     A                                 13 74' '
     A                                      DSPATR(RI)
     A                                 12 29'is not on file.                   -
     A                                               '
     A                                 14 26' '
     A                                      DSPATR(RI)
     A                                 14 74' '
     A                                      DSPATR(RI)
     A                                 15 26' '
     A                                      DSPATR(RI)
     A                                 15 74' '
     A                                      DSPATR(RI)
     A                                 16 26' '
     A                                      DSPATR(RI)
     A                                 14 29'For a Change, Delete, Reactivate o-
     A                                      r Inquiry'
     A                                 16 74' '
     A                                      DSPATR(RI)
     A                                 17 26' '
     A                                      DSPATR(RI)
     A                                 15 29'you must enter either a Customer N-
     A                                      umber or '
     A                                 17 74' '
     A                                      DSPATR(RI)
     A                                 18 26' '
     A                                      DSPATR(RI)
     A                                 16 29'the Alpha Search characters.      -
     A                                               '
     A                                 18 74' '
     A                                      DSPATR(RI)
     A                                 19 26' '
     A                                      DSPATR(RI)
     A                                 19 74' '
     A                                      DSPATR(RI)
     A                                 20 26' '
     A                                      DSPATR(RI)
     A                                 20 74' '
     A                                      DSPATR(RI)
     A                                 21 26' '
     A                                      DSPATR(RI)
     A                                 21 74' '
     A                                      DSPATR(RI)
     A                                 18 29'The Company Number with which this-
     A                                       customer'
     A                                 19 28' is associated is Required and mus-
     A                                      t be       '
     A                                  9 26'                                  -
     A                                                     '
     A                                      DSPATR(RI)
     A                                 10 29'                                  -
     A                                               '
     A                                 20 28' defined in the Company Control Fi-
     A                                      le.        '
     A          R SCRNB
     A*%%TS  SD  19990525  171310  EFD         REL-V3R7M0  5716-PW1
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF06
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF04
     A                                      CF08
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A          H                           HLPRCD(HBNAME)
     A  *DS3                                HLPARA(06 015 06 044)
     A  *DS4                                HLPARA(06 015 06 044)
     A          H                           HLPRCD(HBALPHA)
     A  *DS3                                HLPARA(06 063 06 077)
     A  *DS4                                HLPARA(06 063 06 077)
     A          H                           HLPRCD(HBADDR)
     A  *DS3                                HLPARA(07 015 09 044)
     A  *DS4                                HLPARA(07 015 09 044)
     A          H                           HLPRCD(HBCSZ)
     A  *DS3                                HLPARA(10 015 10 070)
     A  *DS4                                HLPARA(10 015 10 070)
     A          H                           HLPRCD(HBTEL)
     A  *DS3                                HLPARA(12 015 13 052)
     A  *DS4                                HLPARA(12 015 13 052)
     A          H                           HLPRCD(HBCAR)
     A  *DS3                                HLPARA(15 020 15 025)
     A  *DS4                                HLPARA(15 020 15 025)
     A          H                           HLPRCD(HBSLSP)
     A  *DS3                                HLPARA(15 049 15 050)
     A  *DS4                                HLPARA(15 049 15 050)
     A          H                           HLPRCD(HBTYPE)
     A  *DS3                                HLPARA(15 075 15 076)
     A  *DS4                                HLPARA(15 075 15 076)
     A          H                           HLPRCD(HBCSA)
     A  *DS3                                HLPARA(16 020 16 025)
     A  *DS4                                HLPARA(16 020 16 025)
     A          H                           HLPRCD(HBTERR)
     A  *DS3                                HLPARA(16 049 16 050)
     A  *DS4                                HLPARA(16 049 16 050)
     A          H                           HLPRCD(HBORDL)
     A  *DS3                                HLPARA(16 071 16 076)
     A  *DS4                                HLPARA(16 071 16 076)
     A          H                           HLPRCD(HBCBI)
     A  *DS3                                HLPARA(17 020 17 025)
     A  *DS4                                HLPARA(17 020 17 025)
     A          H                           HLPRCD(HBCOMM)
     A  *DS3                                HLPARA(17 046 17 050)
     A  *DS4                                HLPARA(17 046 17 050)
     A          H                           HLPRCD(HBBROK)
     A  *DS3                                HLPARA(17 076 17 076)
     A  *DS4                                HLPARA(17 076 17 076)
     A          H                           HLPRCD(HBXREF)
     A  *DS3                                HLPARA(18 020 18 025)
     A  *DS4                                HLPARA(18 020 18 025)
     A          H                           HLPRCD(HBNOTES)
     A  *DS3                                HLPARA(20 011 20 076)
     A  *DS4                                HLPARA(20 013 20 076)
     A          H                           HLPRCD(HBCNAM)
     A  *DS3                                HLPARA(11 015 11 044)
     A  *DS4                                HLPARA(11 015 11 044)
     A          H                           HLPRCD(HBPORQ)
     A  *DS3                                HLPARA(18 050 18 050)
     A  *DS4                                HLPARA(18 050 18 050)
     A                                  1  2'ARV010B'
     A                                  1 26' Customer Master Maintenance '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A            VMODE         10A  O  2 35DSPATR(RI)
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  3  2'Help'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  4  9' This customer will be deleted.   -
     A                                      Press F6 to cancel deletion. '
     A  70                                  DSPATR(RI)
     A N70                                  DSPATR(ND)
     A                                  5  5'Number:'
     A            CMCUST         6Y 0O  5 15EDTCDE(Z)
     A  50                                  DSPATR(PC)
     A                                  6  7'Name:'
     A            CMNAME        30A  B  6 15
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  20                                  DSPATR(RI)
     A N50N99                               DSPATR(PC)
     A                                      CHECK(LC)
     A  20 99                               ERRMSG('*** Customer Name is Requir-
     A                                      ed.         Press Reset')
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                  6 49'Alpha Search:'
     A            CMLOOK        15A  B  6 63
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A  21 99                               ERRMSG('*** Alpha Search is Require-
     A                                      d.          Press Reset')
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                  7  2'Address 2:'
     A            CMADD2        30A  B  7 15
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A                                      CHECK(LC)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                  8  2'Address 3:'
     A            CMADD3        30A  B  8 15
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A                                      CHECK(LC)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                  9  2'Address 4:'
     A            CMADD4        30A  B  9 15
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A                                      CHECK(LC)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 10  7'City:'
     A            CMCITY        18A  B 10 15
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A                                      CHECK(LC)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 10 36'State:'
     A            CMSTST         2A  B 10 43
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A  50                                  DSPATR(PR)
     A  22 99                               ERRMSG('*** Invalid State Entered. -
     A                                                  Press Reset')
     A  50                                  DSPATR(HI)
     A                                 10 48'Zip Code:'
     A            CMZIP          9A  B 10 58
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 11  4'Country:'
     A            CMCOUN        10A  B 11 15
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                      CHECK(LC)
     A                                 12  4'Contact:'
     A            CMCNME        30A  B 12 15
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A                                      CHECK(LC)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 13  4'Tel. #1:'
     A            CMPHON        10Y 0B 13 15
     A N50                                  DSPATR(CS)
     A                                      EDTWRD('   -   -    ')
     A                                      CHECK(FE)
     A  50                                  DSPATR(PR)
     A                                      CHECK(RB)
     A  50                                  DSPATR(HI)
     A                                 13 30'Tel. #2:'
     A            CMPHO2        10Y 0B 13 41
     A N50                                  DSPATR(CS)
     A                                      EDTWRD('   -   -    ')
     A                                      CHECK(FE)
     A  50                                  DSPATR(PR)
     A                                      CHECK(RB)
     A  50                                  DSPATR(HI)
     A                                 13 55'Fax:'
     A            HSFAX         10Y 0B 13 62
     A N50                                  DSPATR(CS)
     A                                      EDTWRD('   -   -    ')
     A  50                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A  50                                  DSPATR(HI)
     A                                 15  9'A/R Cust#'
     A            CMARCU         6Y 0B 15 20CHECK(FE)
     A                                      CHECK(RB)
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A  23 99                               ERRMSG('*** Invalid Accounts Receiv-
     A                                      able Customer Number.       Press R-
     A                                      eset')
     A                                      EDTCDE(Z)
     A  50                                  DSPATR(HI)
     A                                 15 32'Salesperson?'
     A            CMSLSM         2A  B 15 49
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A  50                                  DSPATR(PR)
     A  24 99                               ERRMSG('*** Invalid Salesperson Num-
     A                                      ber.        Press Reset')
     A  50                                  DSPATR(HI)
     A                                 15 55'Customer Type:'
     A            CMCTYP         2A  B 15 75DSPATR(CS)
     A  82                                  DSPATR(PC)
     A  82                                  ERRMSG('*** You Must enter a custom-
     A                                      er type.    Press RESET')
     A  82                                  DSPATR(RI)
     A                                 16  9'S/A Cust#'
     A            CMSACU         6Y 0B 16 20CHECK(FE)
     A                                      CHECK(RB)
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(MDT)
     A  26 99                               ERRMSG('*** Invalid Sales Analysis -
     A                                      Customer Number.   Press Enter')
     A                                      EDTCDE(Z)
     A  50                                  DSPATR(HI)
     A                                 16 34'Territory?'
     A            CMTERR         2A  B 16 49
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A  50                                  DSPATR(HI)
     A  27 99                               ERRMSG('*** Territory is Invalid.  -
     A                                                  Press Reset')
     A                                 16 58'Order List?'
     A            CMORLS         6A  B 16 71
     A N50                                  DSPATR(CS)
     A  40                                  DSPATR(RI)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A  40                                  ERRMSG('*** Invalid Order List.    -
     A                                             Press Reset')
     A                                 17  8'Bill Cust#'
     A            CMBLCU         6Y 0B 17 20CHECK(FE)
     A                                      CHECK(RB)
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A  29 99                               ERRMSG('*** Billing Customer Number-
     A                                       is Invalid.     Press Reset')
     A                                      EDTCDE(Z)
     A  50                                  DSPATR(HI)
     A                                 17 31'Commission %:'
     A            CMCOMM         4Y 2B 17 46
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A                                      EDTCDE(3)
     A                                      CHECK(FE)
     A  50                                  DSPATR(HI)
     A                                 17 57'Broker? Y/N:'
     A            CMJOBR         1A  B 17 76
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A                                      VALUES('Y' 'N')
     A  50                                  DSPATR(HI)
     A                                 18  1'Cust/Item # XRef#'
     A            CMIREF         6Y 0B 18 20CHECK(FE)
     A                                      CHECK(RB)
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A                                      EDTCDE(Z)
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A  30 99                               ERRMSG('*** Customer Item Cross Ref-
     A                                      erence Not Valid.    Press Reset')
     A  50                                  DSPATR(HI)
     A                                 18 30'P.O. Required:'
     A            CMPORQ         1A  B 18 50
     A N50                                  DSPATR(CS)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A  50                                  DSPATR(HI)
     A  50                                  DSPATR(PR)
     A  39                                  ERRMSG('*** Valid Entries are Y or -
     A                                      N.     Press Reset')
     A  42                                  ERRMSG('*** Bill To Customer Requir-
     A                                      es A P.O.   Press Reset')
     A                                 18 57'Broker Abbr:'
     A            CMBABB         5A  B 18 72
     A N50                                  DSPATR(CS)
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A  45                                  DSPATR(PR)
     A  49                                  ERRMSG('*** Broker Abbreviation is -
     A                                      Required.   Press Reset')
     A  47                                  ERRMSG('*** Abbreviation Cannot Be -
     A                                      Entered, Cust. Not Assoc With Broke-
     A                                      r.  Press Reset')
     A  50                                  DSPATR(HI)
     A                                 20  3'Notes:'
     A            CCCOM1        30A  B 20 11
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A                                      CHECK(LC)
     A  50                                  DSPATR(HI)
     A            CCCOM2        30A  B 20 43
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A                                      CHECK(LC)
     A  50                                  DSPATR(HI)
     A                                 21 16' Validate Data - Change or Press E-
     A                                      nter to Accept '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                 22  2' # = Enter 999999 for alpha search-
     A                                                  F4=Additional (DPC) Inf-
     A                                      ormation '
     A                                      DSPATR(UL)
     A                                 23  2' Enter to Process     F6=Restart  -
     A                                         F7=End of Job     F1=Primary Con-
     A                                      tact Data'
     A                                      DSPATR(UL)
     A                                  5 25'Old Customer Number:'
     A            OLDNO          5A  O  5 47DSPATR(HI)
     A                                      DSPATR(UL)
     A                                 14  1'Speed Dial:'
     A            CASPDL         3Y 0B 14 15
     A N50                                  DSPATR(CS)
     A                                      CHECK(FE)
     A  50                                  DSPATR(PR)
     A                                      CHECK(RB)
     A  50                                  DSPATR(HI)
     A                                 14 55'Call before Faxing:'
     A            HSFXCF         1A  B 14 76
     A  51                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  51                                  DSPATR(PC)
     A  51                                  ERRMSG('*** Fax call first must be -
     A                                      Y/N.        Press RESET')
     A                                  3  9'F8=Customer Inquiry'
     A* COMPANY NAME
     A          R HBNAME
     A*%%TS  SD  19940218  154531  GINNY       REL-V2R2M0  5738-PW1
     A                                 17  4'     Name:                        -
     A                                                                Required -
     A                                         '
     A                                      DSPATR(RI)
     A                                 21  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                 19  4' '
     A                                      DSPATR(RI)
     A                                 20  4' '
     A                                      DSPATR(RI)
     A                                 18  4' '
     A                                      DSPATR(RI)
     A                                 18 75' '
     A                                      DSPATR(RI)
     A                                 19 75' '
     A                                      DSPATR(RI)
     A                                 20 75' '
     A                                      DSPATR(RI)
     A                                 19  6'   Enter the Company Name for this-
     A                                       Customer up to 30 characters.   '
     A                                 18  6'                                  -
     A                                                                        '
     A                                 20  6'                                  -
     A                                                                        '
     A          R HBALPHA
     A*%%TS  SD  19940218  110238  GINNY       REL-V2R2M0  5738-PW1
     A                                 14  5'    Enter up to 15 characters to d-
     A                                      efine the Alpha Search.            -
     A                                          '
     A                                 15  2' '
     A                                      DSPATR(RI)
     A                                 15 80' '
     A                                      DSPATR(RI)
     A                                 12  2'   Alpha Search:                  -
     A                                                                       Re-
     A                                      quired    '
     A                                      DSPATR(RI)
     A                                 21  2'                                  -
     A                                                                         -
     A                                                '
     A                                      DSPATR(RI)
     A                                 13  2' '
     A                                      DSPATR(RI)
     A                                 14 80' '
     A                                      DSPATR(RI)
     A                                 13 80' '
     A                                      DSPATR(RI)
     A                                 16  2' '
     A                                      DSPATR(RI)
     A                                 16  5'    The Alpha Search field is used-
     A                                      :                                  -
     A                                          '
     A                                 19  2' '
     A                                      DSPATR(RI)
     A                                 20  2' '
     A                                      DSPATR(RI)
     A                                 17  4'        1. Look up an unknown cust-
     A                                      omer number                        -
     A                                            '
     A                                 18  4'        2. Determine the sequence -
     A                                      for reports printed alphabetically -
     A                                            '
     A                                 18  2' '
     A                                      DSPATR(RI)
     A                                 19  4'           by customer            -
     A                                                                         -
     A                                            '
     A                                 16 80' '
     A                                      DSPATR(RI)
     A                                 17 80' '
     A                                      DSPATR(RI)
     A                                 18 80' '
     A                                      DSPATR(RI)
     A                                 19 80' '
     A                                      DSPATR(RI)
     A                                 20 80' '
     A                                      DSPATR(RI)
     A                                 15  4'                                  -
     A                                                                         -
     A                                           '
     A                                 20  4'                                  -
     A                                                                         -
     A                                            '
     A                                 13  4'                                  -
     A                                                                         -
     A                                            '
     A                                 14  2' '
     A                                      DSPATR(RI)
     A                                 17  2' '
     A                                      DSPATR(RI)
     A          R HBADDR
     A*%%TS  SD  19940218  094358  GINNY       REL-V2R2M0  5738-PW1
     A                                 17  4'     3 Address Lines:             -
     A                                                                 Optional-
     A                                         '
     A                                      DSPATR(RI)
     A                                 22  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                 19  4' '
     A                                      DSPATR(RI)
     A                                 21  4' '
     A                                      DSPATR(RI)
     A                                 18  4' '
     A                                      DSPATR(RI)
     A                                 18 75' '
     A                                      DSPATR(RI)
     A                                 19 75' '
     A                                      DSPATR(RI)
     A                                 21 75' '
     A                                      DSPATR(RI)
     A                                 19  6'   Enter up to three 30 character -
     A                                      lines for the address for this    '
     A                                 20  4' '
     A                                      DSPATR(RI)
     A                                 20 75' '
     A                                      DSPATR(RI)
     A                                 20  6'   Customer.                      -
     A                                                                        '
     A                                 18  6'                                  -
     A                                                                        '
     A          R HBCSZ
     A*%%TS  SD  19940218  110238  GINNY       REL-V2R2M0  5738-PW1
     A                                 17  4'    City State and Zip:           -
     A                                                               Optional  -
     A                                         '
     A                                      DSPATR(RI)
     A                                 22  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                 19  4' '
     A                                      DSPATR(RI)
     A                                 21  4' '
     A                                      DSPATR(RI)
     A                                 18  4' '
     A                                      DSPATR(RI)
     A                                 18 75' '
     A                                      DSPATR(RI)
     A                                 19 75' '
     A                                      DSPATR(RI)
     A                                 21 75' '
     A                                      DSPATR(RI)
     A                                 19  6'  Enter City, State and Zip Code. -
     A                                       If State is entered - it must   '
     A                                 20  4' '
     A                                      DSPATR(RI)
     A                                 20 75' '
     A                                      DSPATR(RI)
     A                                 20  6'  be defined in the State File in -
     A                                      the Company Control File.         '
     A                                 18  6'                                  -
     A                                                                        '
     A                                 21  6'                                  -
     A                                                                        '
     A          R HBCNAM
     A*%%TS  SD  19940218  154531  GINNY       REL-V2R2M0  5738-PW1
     A                                 17  4'     Contact Name:                -
     A                                                               Optional  -
     A                                         '
     A                                      DSPATR(RI)
     A                                 22  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                 19  4' '
     A                                      DSPATR(RI)
     A                                 21  4' '
     A                                      DSPATR(RI)
     A                                 18  4' '
     A                                      DSPATR(RI)
     A                                 18 75' '
     A                                      DSPATR(RI)
     A                                 19 75' '
     A                                      DSPATR(RI)
     A                                 21 75' '
     A                                      DSPATR(RI)
     A                                 19  6'   Enter the name of the person yo-
     A                                      u contact at this customer for    '
     A                                 20  4' '
     A                                      DSPATR(RI)
     A                                 20 75' '
     A                                      DSPATR(RI)
     A                                 20  6'   order and shipping information.-
     A                                                                        '
     A                                 21  6'                                  -
     A                                                                        '
     A                                 18  6'                                  -
     A                                                                        '
     A          R HBTEL
     A*%%TS  SD  19940317  124723  GINNY       REL-V2R2M0  5738-PW1
     A                                 17  4'    Telephone & Fax Numbers:      -
     A                                                                 Optional-
     A                                         '
     A                                      DSPATR(RI)
     A                                 22  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                 19  4' '
     A                                      DSPATR(RI)
     A                                 18  4' '
     A                                      DSPATR(RI)
     A                                 18 75' '
     A                                      DSPATR(RI)
     A                                 19 75' '
     A                                      DSPATR(RI)
     A                                 19  6'  Enter Telephone & Fax Numbers.  -
     A                                      Can be entered as 215-555-1212    '
     A                                 20  4' '
     A                                      DSPATR(RI)
     A                                 20 75' '
     A                                      DSPATR(RI)
     A                                 20  6'  pr 2155551212.        Press Fiel-
     A                                      d Exit after entering data.       '
     A                                 21  4' '
     A                                      DSPATR(RI)
     A                                 21  6'                                  -
     A                                                                        '
     A                                 21 75' '
     A                                      DSPATR(RI)
     A                                 18  6'                                  -
     A                                                                        '
     A          R HBCAR
     A*%%TS  SD  19940218  110238  GINNY       REL-V2R2M0  5738-PW1
     A                                 16  4'    A/R Customer Number:          -
     A                                                                Required -
     A                                         '
     A                                      DSPATR(RI)
     A                                 23  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                 18  4' '
     A                                      DSPATR(RI)
     A                                 20  4' '
     A                                      DSPATR(RI)
     A                                 17  4' '
     A                                      DSPATR(RI)
     A                                 17 75' '
     A                                      DSPATR(RI)
     A                                 18 75' '
     A                                      DSPATR(RI)
     A                                 20 75' '
     A                                      DSPATR(RI)
     A                                 18  6'  Enter the Number for the Custome-
     A                                      r whose Accounts Receivable will  '
     A                                 19  4' '
     A                                      DSPATR(RI)
     A                                 19 75' '
     A                                      DSPATR(RI)
     A                                 19  6'  be posted for Invoices and Credi-
     A                                      t Memos associated with this      '
     A                                 20  6'  Shipping Customer Location.  Thi-
     A                                      s will default to the Shipping    '
     A                                 22  4' '
     A                                      DSPATR(RI)
     A                                 21  6'  Customer Number but can be chang-
     A                                      ed to any valid Customer Number.  '
     A                                 21 75' '
     A                                      DSPATR(RI)
     A                                 21  4' '
     A                                      DSPATR(RI)
     A                                 22 75' '
     A                                      DSPATR(RI)
     A                                 17  6'                                  -
     A                                                                        '
     A                                 22  6'                                  -
     A                                                                        '
     A          R HBSLSP
     A*%%TS  SD  19940218  094358  GINNY       REL-V2R2M0  5738-PW1
     A                                  6  2'   Salesperson Code:              -
     A                                                                     Requ-
     A                                      ired     '
     A                                      DSPATR(RI)
     A                                 14  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(RI)
     A                                  8  2' '
     A                                      DSPATR(RI)
     A                                 10  2' '
     A                                      DSPATR(RI)
     A                                  7  2' '
     A                                      DSPATR(RI)
     A                                  7 79' '
     A                                      DSPATR(RI)
     A                                 10 79' '
     A                                      DSPATR(RI)
     A                                  8  4' Enter the Code for the Salesperso-
     A                                      n assigned to this customer.  This -
     A                                      will '
     A                                  9 79' '
     A                                      DSPATR(RI)
     A                                 10  4' any valid Salesperson Code.  If f-
     A                                      or some reason, another Salesperson-
     A                                           '
     A                                 13  2' '
     A                                      DSPATR(RI)
     A                                 13 79' '
     A                                      DSPATR(RI)
     A                                  7  4'                                  -
     A                                                                         -
     A                                           '
     A                                  9  4' default to the Code in the Compan-
     A                                      y Defaults File but can be changed -
     A                                      to   '
     A                                 11  4' should get credit for an order sh-
     A                                      ipped to this customer, the Salespe-
     A                                      rson '
     A                                 12  4' can be changed during order entry-
     A                                      .                                  -
     A                                           '
     A                                 11  2' '
     A                                      DSPATR(RI)
     A                                 12  2' '
     A                                      DSPATR(RI)
     A                                 12 79' '
     A                                      DSPATR(RI)
     A                                 11 79' '
     A                                      DSPATR(RI)
     A                                 13  4'                                  -
     A                                                                         -
     A                                           '
     A                                  8 79' '
     A                                      DSPATR(RI)
     A                                  9  2' '
     A                                      DSPATR(RI)
     A          R HBTYPE
     A*%%TS  SD  19990610  155218  EFD         REL-V3R7M0  5716-PW1
     A                                 16  4'   Customer Type:                 -
     A                                                                Optional -
     A                                         '
     A                                      DSPATR(RI)
     A                                 23  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                 18  4' '
     A                                      DSPATR(RI)
     A                                 20  4' '
     A                                      DSPATR(RI)
     A                                 17  4' '
     A                                      DSPATR(RI)
     A                                 17 75' '
     A                                      DSPATR(RI)
     A                                 18 75' '
     A                                      DSPATR(RI)
     A                                 20 75' '
     A                                      DSPATR(RI)
     A                                 18  6' Valid Customer types: R-Retail Fl-
     A                                      orist  G-Garden Center            '
     A                                 19  4' '
     A                                      DSPATR(RI)
     A                                 19 75' '
     A                                      DSPATR(RI)
     A                                 20  6' E-Employee  S-Schools   W-Wholesa-
     A                                      le Florist  I-Interior Landscaper '
     A                                 21  4' '
     A                                      DSPATR(RI)
     A                                 21 75' '
     A                                      DSPATR(RI)
     A                                 17  6'                                  -
     A                                                                        '
     A                                 21  7'F-Retail Florist with Garden Cente-
     A                                      r.                              '
     A                                 19  6' N-Non-Floral Retailer  M-Mass Mar-
     A                                      ket  XX-On Hold  O-Other          '
     A                                 22  4' '
     A                                      DSPATR(RI)
     A                                 22 75' '
     A                                      DSPATR(RI)
     A                                 22  6'                                  -
     A                                                                        '
     A          R HBCSA
     A*%%TS  SD  19940218  110238  GINNY       REL-V2R2M0  5738-PW1
     A                                 16  4'    Sales Analysis Customer Number-
     A                                      :                         Required -
     A                                         '
     A                                      DSPATR(RI)
     A                                 23  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                 18  4' '
     A                                      DSPATR(RI)
     A                                 20  4' '
     A                                      DSPATR(RI)
     A                                 17  4' '
     A                                      DSPATR(RI)
     A                                 17 75' '
     A                                      DSPATR(RI)
     A                                 18 75' '
     A                                      DSPATR(RI)
     A                                 20 75' '
     A                                      DSPATR(RI)
     A                                 18  6'  Enter the Number for the Custome-
     A                                      r whose Sales Analysis will       '
     A                                 19  4' '
     A                                      DSPATR(RI)
     A                                 19 75' '
     A                                      DSPATR(RI)
     A                                 19  6'  be posted for Invoices and Credi-
     A                                      t Memos associated with this      '
     A                                 20  6'  Shipping Customer Location.  Thi-
     A                                      s will default to the Shipping    '
     A                                 22  4' '
     A                                      DSPATR(RI)
     A                                 21  6'  Customer Number but can be chang-
     A                                      ed to any valid Customer Number.  '
     A                                 21 75' '
     A                                      DSPATR(RI)
     A                                 21  4' '
     A                                      DSPATR(RI)
     A                                 22 75' '
     A                                      DSPATR(RI)
     A                                 17  6'                                  -
     A                                                                        '
     A                                 22  6'                                  -
     A                                                                        '
     A          R HBTERR
     A*%%TS  SD  19940218  110238  GINNY       REL-V2R2M0  5738-PW1
     A                                 16  4'   Territory Code:                -
     A                                                                Required -
     A                                         '
     A                                      DSPATR(RI)
     A                                 22  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                 18  4' '
     A                                      DSPATR(RI)
     A                                 20  4' '
     A                                      DSPATR(RI)
     A                                 17  4' '
     A                                      DSPATR(RI)
     A                                 17 75' '
     A                                      DSPATR(RI)
     A                                 18 75' '
     A                                      DSPATR(RI)
     A                                 20 75' '
     A                                      DSPATR(RI)
     A                                 18  6' Enter the Code for the Territory -
     A                                      to which this customer belongs.   '
     A                                 19  4' '
     A                                      DSPATR(RI)
     A                                 19 75' '
     A                                      DSPATR(RI)
     A                                 20  6' This must be a valid code in the -
     A                                      Territory Master File.            '
     A                                 21  4' '
     A                                      DSPATR(RI)
     A                                 21 75' '
     A                                      DSPATR(RI)
     A                                 17  6'                                  -
     A                                                                        '
     A                                 19  6' There are various Sales reports t-
     A                                      hat run in Territory sequence.   '
     A                                 21  6'                                  -
     A                                                                        '
     A          R HBORDL
     A*%%TS  SD  19940218  110238  GINNY       REL-V2R2M0  5738-PW1
     A                                 16  4'    Order List:                   -
     A                                                                 Required-
     A                                         '
     A                                      DSPATR(RI)
     A                                 22  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                 18  4' '
     A                                      DSPATR(RI)
     A                                 20  4' '
     A                                      DSPATR(RI)
     A                                 17  4' '
     A                                      DSPATR(RI)
     A                                 17 75' '
     A                                      DSPATR(RI)
     A                                 18 75' '
     A                                      DSPATR(RI)
     A                                 20 75' '
     A                                      DSPATR(RI)
     A                                 18  6'  Which order list number contains-
     A                                       the items most ordered by this   '
     A                                 19  4' '
     A                                      DSPATR(RI)
     A                                 19 75' '
     A                                      DSPATR(RI)
     A                                 19  6'  customer.  This order list will -
     A                                      be the first list displayed       '
     A                                 20  6'  during Telephone Order Entry for-
     A                                       this customer.                   '
     A                                 21  4' '
     A                                      DSPATR(RI)
     A                                 21 75' '
     A                                      DSPATR(RI)
     A                                 17  6'                                  -
     A                                                                        '
     A                                 21  6'                                  -
     A                                                                        '
     A          R HBCBI
     A*%%TS  SD  19940218  094358  GINNY       REL-V2R2M0  5738-PW1
     A                                 23  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                 18  4' '
     A                                      DSPATR(RI)
     A                                 20  4' '
     A                                      DSPATR(RI)
     A                                 17  4' '
     A                                      DSPATR(RI)
     A                                 17 75' '
     A                                      DSPATR(RI)
     A                                 18 75' '
     A                                      DSPATR(RI)
     A                                 20 75' '
     A                                      DSPATR(RI)
     A                                 18  6' Enter the Number for the Customer-
     A                                       whose data will be used for      '
     A                                 19  4' '
     A                                      DSPATR(RI)
     A                                 19 75' '
     A                                      DSPATR(RI)
     A                                 19  6' printing the Invoices and Credit -
     A                                      Memos associated with this        '
     A                                 20  6' Shipping Customer Location.  This-
     A                                       will default to the Shipping     '
     A                                 22  4' '
     A                                      DSPATR(RI)
     A                                 21  6' Customer Number but can be change-
     A                                      d to any valid Customer Number.   '
     A                                 21 75' '
     A                                      DSPATR(RI)
     A                                 21  4' '
     A                                      DSPATR(RI)
     A                                 22 75' '
     A                                      DSPATR(RI)
     A                                 17  6'                                  -
     A                                                                        '
     A                                 16  4'   Billing Customer Number:       -
     A                                                                  Require-
     A                                      d  '
     A                                      DSPATR(RI)
     A                                 22  6'                                  -
     A                                                                        '
     A          R HBCOMM
     A*%%TS  SD  19940218  094358  GINNY       REL-V2R2M0  5738-PW1
     A                                 14  4'   Commission Percent:            -
     A                                                               Optional  -
     A                                         '
     A                                      DSPATR(RI)
     A                                 22  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                 16  4' '
     A                                      DSPATR(RI)
     A                                 18  4' '
     A                                      DSPATR(RI)
     A                                 15  4' '
     A                                      DSPATR(RI)
     A                                 15 75' '
     A                                      DSPATR(RI)
     A                                 16 75' '
     A                                      DSPATR(RI)
     A                                 18 75' '
     A                                      DSPATR(RI)
     A                                 16  7'If the Salesperson assigned to thi-
     A                                      s customer is paid commission on'
     A                                 17  4' '
     A                                      DSPATR(RI)
     A                                 17 75' '
     A                                      DSPATR(RI)
     A                                 18  6' is the only commission percent us-
     A                                      ed to calculate commissions.  The '
     A                                 21  4' '
     A                                      DSPATR(RI)
     A                                 21 75' '
     A                                      DSPATR(RI)
     A                                 15  6'                                  -
     A                                                                        '
     A                                 17  6' sales to this customer - enter th-
     A                                      e commission percent here.  This  '
     A                                 19  4' '
     A                                      DSPATR(RI)
     A                                 19  6' commission percents in the salesp-
     A                                      erson and item files are informa- '
     A                                 20  4' '
     A                                      DSPATR(RI)
     A                                 20  6' tional only.  Enter 5% commission-
     A                                       as 5.00.                         '
     A                                 19 75' '
     A                                      DSPATR(RI)
     A                                 20 75' '
     A                                      DSPATR(RI)
     A                                 21  6'                                  -
     A                                                                        '
     A          R HBBROK
     A*%%TS  SD  19951214  135931  GINNY       REL-V3R1M0  5763-PW1
     A                                 16  4'   Broker?                        -
     A                                                                Required -
     A                                         '
     A                                      DSPATR(RI)
     A                                 21  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                 18  4' '
     A                                      DSPATR(RI)
     A                                 20  4' '
     A                                      DSPATR(RI)
     A                                 17  4' '
     A                                      DSPATR(RI)
     A                                 17 75' '
     A                                      DSPATR(RI)
     A                                 18 75' '
     A                                      DSPATR(RI)
     A                                 20 75' '
     A                                      DSPATR(RI)
     A                                 18  6' Is this customer a Broker?  Enter-
     A                                       Y or N.                          '
     A                                 19  4' '
     A                                      DSPATR(RI)
     A                                 19 75' '
     A                                      DSPATR(RI)
     A                                 19  6' This is an information only field-
     A                                      .                                 '
     A                                 17  6'                                  -
     A                                                                        '
     A                                 20  6'                                  -
     A                                                                        '
     A          R HBXREF
     A*%%TS  SD  19940218  094358  GINNY       REL-V2R2M0  5738-PW1
     A                                  4  2'      Customer/Item Cross Referenc-
     A                                      e Number:                     Optio-
     A                                      nal     '
     A                                      DSPATR(RI)
     A                                 17  2'                                  -
     A                                                                         -
     A                                              '
     A                                      DSPATR(RI)
     A                                  6  2' '
     A                                      DSPATR(RI)
     A                                  8  2' '
     A                                      DSPATR(RI)
     A                                  5  2' '
     A                                      DSPATR(RI)
     A                                  5 78' '
     A                                      DSPATR(RI)
     A                                  6 78' '
     A                                      DSPATR(RI)
     A                                  8 78' '
     A                                      DSPATR(RI)
     A                                  6  4'    Some of your customers may req-
     A                                      uire that their UPC number be      -
     A                                          '
     A                                  7  2' '
     A                                      DSPATR(RI)
     A                                  7 78' '
     A                                      DSPATR(RI)
     A                                  7  4'    printed on Order Acknowledgeme-
     A                                      nts and Invoices.  Each group of   -
     A                                          '
     A                                  8  4'    UPC numbers is associated with-
     A                                       a customer number.  If this cust- -
     A                                          '
     A                                 10  2' '
     A                                      DSPATR(RI)
     A                                  9  4'    omer needs their UPC numbers p-
     A                                      rinted, enter the customer number  -
     A                                          '
     A                                  9 78' '
     A                                      DSPATR(RI)
     A                                  9  2' '
     A                                      DSPATR(RI)
     A                                 10 78' '
     A                                      DSPATR(RI)
     A                                  5  4'                                  -
     A                                                                         -
     A                                          '
     A                                 10  4'    associated with these UPC numb-
     A                                      ers.                               -
     A                                          '
     A                                 11  4'    For Example:                  -
     A                                                                         -
     A                                          '
     A                                 11  2' '
     A                                      DSPATR(RI)
     A                                 12  2' '
     A                                      DSPATR(RI)
     A                                 14  2' '
     A                                      DSPATR(RI)
     A                                 12  4'    Ryans Inc. has 25 garden cente-
     A                                      rs.  The main office and each cente-
     A                                      r   '
     A                                 13  4'    have their own customer number-
     A                                      .  You set up Ryans UPC numbers    -
     A                                          '
     A                                 14  4'    under the main office customer-
     A                                       number.  This customer number woul-
     A                                      d   '
     A                                 15  4'    become the Cust/Item XRef # fo-
     A                                      r the 25 garden centers.           -
     A                                          '
     A                                 13  2' '
     A                                      DSPATR(RI)
     A                                 15  2' '
     A                                      DSPATR(RI)
     A                                 16  2' '
     A                                      DSPATR(RI)
     A                                 11 78' '
     A                                      DSPATR(RI)
     A                                 12 78' '
     A                                      DSPATR(RI)
     A                                 13 78' '
     A                                      DSPATR(RI)
     A                                 14 78' '
     A                                      DSPATR(RI)
     A                                 15 78' '
     A                                      DSPATR(RI)
     A                                 16 78' '
     A                                      DSPATR(RI)
     A                                 16  4'                                  -
     A                                                                         -
     A                                          '
     A          R HBNOTES
     A*%%TS  SD  19940218  094358  GINNY       REL-V2R2M0  5738-PW1
     A                                  6  3'    Customer Notes:               -
     A                                                                 Optional-
     A                                         '
     A                                      DSPATR(RI)
     A                                 11  3'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                  8  3' '
     A                                      DSPATR(RI)
     A                                  9  3' '
     A                                      DSPATR(RI)
     A                                  7 74' '
     A                                      DSPATR(RI)
     A                                  8 74' '
     A                                      DSPATR(RI)
     A                                  9 74' '
     A                                      DSPATR(RI)
     A                                  8  5'  Enter up to (2) 30 chararcter fi-
     A                                      elds of notes for this customer.  '
     A                                  9  5'  They only display in this progra-
     A                                      m but could be used with Query.   '
     A                                 10  3' '
     A                                      DSPATR(RI)
     A                                 10 74' '
     A                                      DSPATR(RI)
     A                                  7  3' '
     A                                      DSPATR(RI)
     A                                  7  5'                                  -
     A                                                                        '
     A                                 10  5'                                  -
     A                                                                        '
     A          R HBPORQ
     A*%%TS  SD  19951214  135931  GINNY       REL-V3R1M0  5763-PW1
     A                                 16  4'   P.O. Required?                 -
     A                                                                Required -
     A                                         '
     A                                      DSPATR(RI)
     A                                 21  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                 18  4' '
     A                                      DSPATR(RI)
     A                                 20  4' '
     A                                      DSPATR(RI)
     A                                 17  4' '
     A                                      DSPATR(RI)
     A                                 17 75' '
     A                                      DSPATR(RI)
     A                                 18 75' '
     A                                      DSPATR(RI)
     A                                 20 75' '
     A                                      DSPATR(RI)
     A                                 18  6' Does this customer all orders be -
     A                                      placed by Purchase Order.  If Y   '
     A                                 19  4' '
     A                                      DSPATR(RI)
     A                                 19 75' '
     A                                      DSPATR(RI)
     A                                 19  6' is entered, a P.O. Number must be-
     A                                       entered during order entry.      '
     A                                 17  6'                                  -
     A                                                                        '
     A                                 20  6'                                  -
     A                                                                        '
     A          R SCRNC
     A*%%TS  SD  19990525  171310  EFD         REL-V3R7M0  5716-PW1
     A                                      CF02
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF05
     A                                      CF03
     A                                      CF04
     A                                      ALWROL
     A                                      INVITE
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A          H                           HLPRCD(HELPC1)
     A  *DS3                                HLPARA(07 017 07 017)
     A  *DS4                                HLPARA(07 017 07 017)
     A          H                           HLPRCD(HELPC2)
     A  *DS3                                HLPARA(07 031 07 031)
     A  *DS4                                HLPARA(07 031 07 031)
     A          H                           HLPRCD(HELPC3)
     A  *DS3                                HLPARA(07 048 07 048)
     A  *DS4                                HLPARA(07 048 07 048)
     A          H                           HLPRCD(HELPC4)
     A  *DS3                                HLPARA(07 063 07 063)
     A  *DS4                                HLPARA(07 063 07 063)
     A          H                           HLPRCD(HELPC5)
     A  *DS3                                HLPARA(07 074 07 078)
     A  *DS4                                HLPARA(07 074 07 078)
     A          H                           HLPRCD(HELPC6)
     A  *DS3                                HLPARA(09 019 09 048)
     A  *DS4                                HLPARA(09 019 09 048)
     A          H                           HLPRCD(HCFRTZ)
     A  *DS3                                HLPARA(09 078 09 078)
     A  *DS4                                HLPARA(09 071 09 071)
     A          H                           HLPRCD(HCSPEC)
     A  *DS3                                HLPARA(10 019 10 048)
     A  *DS4                                HLPARA(10 019 10 048)
     A          H                           HLPRCD(HCSVIA)
     A  *DS3                                HLPARA(11 019 11 020)
     A  *DS4                                HLPARA(11 019 11 020)
     A          H                           HLPRCD(HCTAX)
     A  *DS3                                HLPARA(13 020 13 080)
     A  *DS4                                HLPARA(12 020 12 080)
     A          H                           HLPRCD(HCTERM)
     A  *DS3                                HLPARA(16 015 16 016)
     A  *DS4                                HLPARA(15 015 15 016)
     A          H                           HLPRCD(HCCRDL)
     A  *DS3                                HLPARA(16 069 16 078)
     A  *DS4                                HLPARA(15 069 15 078)
     A          H                           HLPRCD(HCCNAM)
     A  *DS3                                HLPARA(17 020 17 049)
     A  *DS4                                HLPARA(16 020 16 049)
     A          H                           HLPRCD(HCARTYP)
     A  *DS3                                HLPARA(17 078 17 078)
     A  *DS4                                HLPARA(16 078 16 078)
     A          H                           HLPRCD(HCLATC)
     A  *DS3                                HLPARA(18 031 18 031)
     A  *DS4                                HLPARA(17 031 17 031)
     A          H                           HLPRCD(HCSTMCY)
     A  *DS3                                HLPARA(18 078 18 078)
     A  *DS4                                HLPARA(17 078 17 078)
     A          H                           HLPRCD(HCCOD)
     A  *DS3                                HLPARA(19 031 19 031)
     A  *DS4                                HLPARA(18 031 18 031)
     A          H                           HLPRCD(HCCOPY)
     A  *DS3                                HLPARA(19 078 19 078)
     A  *DS4                                HLPARA(18 078 18 078)
     A          H                           HLPRCD(HCPSLS)
     A  *DS3                                HLPARA(20 031 20 031)
     A  *DS4                                HLPARA(19 031 19 031)
     A          H                           HLPRCD(HCOACK)
     A  *DS3                                HLPARA(20 078 20 078)
     A  *DS4                                HLPARA(19 078 19 078)
     A          H                           HLPRCD(HPHYTO)
     A  *DS3                                HLPARA(10 078 10 078)
     A  *DS4                                HLPARA(10 075 10 075)
     A          H                           HLPRCD(HFLOC)
     A  *DS3                                HLPARA(11 076 11 078)
     A  *DS4                                HLPARA(11 076 11 078)
     A                                  1  2'ARV010C'
     A                                  1 26' Customer Master Maintenance '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A            VMODE         10A  O  2 35DSPATR(RI)
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  3  2'Help'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  4  2'Customer:'
     A            CMCUST         6Y 0O  4 12EDTCDE(Z)
     A  50                                  DSPATR(PC)
     A  50                                  DSPATR(HI)
     A            CMNAME        30A  O  4 20
     A  50                                  DSPATR(HI)
     A                                  5  2'Company:'
     A            VCO            2S 0O  5 16
     A  50                                  DSPATR(HI)
     A            CNAME         30A  O  5 20
     A  50                                  DSPATR(HI)
     A                                  6 56'  D I S C O U N T S  '
     A                                      DSPATR(UL)
     A                                  7  2'Pricing Code:'
     A            CMPRCD         1D 0B  7 16
     A N50                                  DSPATR(CS)
     A  54                                  DSPATR(RI)
     A  54                                  DSPATR(PC)
     A  54 99                               ERRMSG('*** Valid Pricing Codes are-
     A                                       1, 2, 3, 4 or 5.   Press Reset')
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                  7 19'Contract:'
     A            CMCTCD         1A  B  7 29
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A  51 99                               ERRMSG('*** Valid Entries are Y or -
     A                                      N.          Press Reset')
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                  7 32'B/O Allowed:'
     A            CMBOOK         1A  B  7 45
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A  52 99                               ERRMSG('*** Valid Entries are Y or -
     A                                      N.          Press Reset')
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                  7 55'Quantity and Volume:'
     A            CMQDIS         1A  B  7 77
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A  53 99                               ERRMSG('*** Valid Entries are Y or -
     A                                      N.          Press Reset')
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                  8 55'Trade:'
     A            CMTRDC         4Y 2B  8 73
     A N50                                  DSPATR(CS)
     A                                      EDTCDE(2)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 10  2'Shipping Inst:'
     A            CMSHIN        30A  B 10 18
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A                                      CHECK(LC)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 10 55'Freight Zone:'
     A            CMUPSZ         1D 0B 10 78
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 11  2'Special Inst:'
     A            CMSPIN        30A  B 11 18
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A                                      CHECK(LC)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 11 55'Override Phyto Code:'
     A            CMPHYT         1A  B 11 78
     A N50                                  DSPATR(CS)
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A  32                                  ERRMSG('*** Phyto Code Cannot Be Lo-
     A                                      wer Than State Phyto Code.   Press -
     A                                      Reset')
     A  33                                  ERRMSG('*** This Is Not A Valid Phy-
     A                                      to Code.   Press Reset')
     A  50                                  DSPATR(HI)
     A                                 12  2'Ship Via Code?'
     A            CMSVCD         2A  B 12 18
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A  73 99                               ERRMSG('*** Ship Via Code is Requir-
     A                                      ed.         Press Reset')
     A  74 99                               ERRMSG('*** Ship Via Code is Not Va-
     A                                      lid.        Press Reset')
     A            CMSHPV        30A  O 12 21
     A  50                                  DSPATR(HI)
     A                                 12 55'Service Branch?'
     A            CMSHFR         3A  B 12 76
     A N50                                  DSPATR(CS)
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A  50                                  DSPATR(HI)
     A  38                                  ERRMSG('*** This is not a Valid Bra-
     A                                      nch Code.    Press RESET')
     A                                 13  2'Taxes:'
     A                                 13 11'Exempt:'
     A            CMTXST         1A  B 13 19
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A  56 99                               ERRMSG('*** Valid Entries are Y or -
     A                                      N.          Press Reset')
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 13 24'Tax Jurisdiction:'
     A            CMTXJU         3A  B 13 42
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A  50                                  DSPATR(PR)
     A  58 99                               ERRMSG('*** Invalid Tax Jurisdictio-
     A                                      n.          Press Reset')
     A  50                                  DSPATR(HI)
     A                                 13 48'Tax I.D.'
     A            CMTXID         9A  B 13 57
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 13 68'Apply FET?'
     A                                      DSPATR(ND)
     A            CMFETD         1A  B 13 80DSPATR(MDT)
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A  50                                  DSPATR(PR)
     A                                      DSPATR(ND)
     A                                 15 23'A C C O U N T S   R E C E I V A B -
     A                                      L E'
     A                                      DSPATR(UL)
     A                                 16  2'Terms Code?'
     A            VTRMCD         2A  B 16 15
     A  50                                  DSPATR(HI)
     A  57                                  DSPATR(RI)
     A N50                                  DSPATR(CS)
     A  57                                  DSPATR(PC)
     A  50                                  DSPATR(PR)
     A  57                                  ERRMSG('*** Enter A Valid Terms Cod-
     A                                      e.     Press Reset')
     A            TCDESC        30A  O 16 20
     A  50                                  DSPATR(HI)
     A                                 16 55'Credit Limit:'
     A            CMCRL$         9Y 2B 16 69EDTWRD('       .  ')
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 18  2'A/R Contact:'
     A            CMCNAM        30A  B 18 20
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A                                      CHECK(LC)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 17 55'A/R Type:'
     A            CMARCD         1A  B 17 78
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A  50                                  DSPATR(PR)
     A  61 99                               ERRMSG('*** Valid Entries are O for-
     A                                       Open Item or B for Balance Forward-
     A                                      .  Press Reset')
     A  50                                  DSPATR(HI)
     A                                 19 33'Apply Late Chrgs:'
     A            CMAPLC         1A  B 19 51
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A  50                                  DSPATR(PR)
     A  62 99                               ERRMSG('*** Valid Entries are Y or -
     A                                      N.          Press Reset')
     A  50                                  DSPATR(HI)
     A                                 18 55'Statement Cycle:'
     A            CMSMCD         1D 0B 18 78
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A  60 99                               ERRMSG('*** Enter a Statement Code -
     A                                      Between 1 - 9.    Press Reset')
     A  50                                  DSPATR(HI)
     A                                 19  2'Cash or Cash/Check Only:'
     A            CMCODF         1A  B 19 31
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A  64 99                               ERRMSG('*** Valid Codes are C, K or-
     A                                       N. C=Cash only - K=Cash or Check --
     A                                       N=All methods')
     A                                 19 55'Stmt/Invoice Copies:'
     A            CMCOPY         1D 0B 19 78
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A  59 99                               ERRMSG('*** Valid Entries are 1, 2,-
     A                                       or 3.      Press Reset')
     A  50                                  DSPATR(HI)
     A                                 20  2'Post Detail Sales History?'
     A            CMDSHF         1A  B 20 31
     A N50                                  DSPATR(CS)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A  50                                  DSPATR(PR)
     A  63 99                               ERRMSG('*** Valid Entries are Y or -
     A                                      N.          Press Reset')
     A  50                                  DSPATR(HI)
     A                                 20 55'Print Order Acks:'
     A            CMACK          1A  B 20 78
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A  50                                  DSPATR(PR)
     A  65 99                               ERRMSG('*** Valid Entries are Y or -
     A                                      N.          Press Reset')
     A  50                                  DSPATR(HI)
     A                                 21 16' Validate Data - Change or Press E-
     A                                      nter to Accept '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                 22  2'                                  -
     A                                               F4=Get Branch Information -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'Enter to Process     F2=Previous S-
     A                                      creen    F5=Truck Stops     F7=End -
     A                                      of Job   '
     A                                      DSPATR(UL)
     A                                 17  2'C.O.D. + Amount:'
     A            CACODP         5Y 2B 17 20DSPATR(CS)
     A                                      EDTCDE(4)
     A          R HELPC1
     A*%%TS  SD  19940218  110238  GINNY       REL-V2R2M0  5738-PW1
     A                                 14  3' The Pricing Code relates to the 5-
     A                                       prices that can be entered for eac-
     A                                      h     '
     A                                 15  1' '
     A                                      DSPATR(RI)
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 12  1'   Pricing Code:                  -
     A                                                                       Re-
     A                                      quired    '
     A                                      DSPATR(RI)
     A                                 22  1'                                  -
     A                                                                         -
     A                                                '
     A                                      DSPATR(RI)
     A                                 14  1' '
     A                                      DSPATR(RI)
     A                                 13  1' '
     A                                      DSPATR(RI)
     A                                 14 79' '
     A                                      DSPATR(RI)
     A                                 13 79' '
     A                                      DSPATR(RI)
     A                                 16  1' '
     A                                      DSPATR(RI)
     A                                 20  1' '
     A                                      DSPATR(RI)
     A                                 21  1' '
     A                                      DSPATR(RI)
     A                                 17  1' '
     A                                      DSPATR(RI)
     A                                 18  1' '
     A                                      DSPATR(RI)
     A                                 18  3' customer will be based on the pri-
     A                                      cing code entered in the customer f-
     A                                      ile.  '
     A                                 19  1' '
     A                                      DSPATR(RI)
     A                                 20  3' This price can be changed during -
     A                                      order entry.                       -
     A                                            '
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 19 79' '
     A                                      DSPATR(RI)
     A                                 20 79' '
     A                                      DSPATR(RI)
     A                                 21 79' '
     A                                      DSPATR(RI)
     A                                 15  3' item in your inventory.   Refer t-
     A                                      o Item Master File.                -
     A                                            '
     A                                 17  3' When you enter orders - the defau-
     A                                      lt price that the system uses for e-
     A                                      ach   '
     A                                 21  4'                                  -
     A                                                                         -
     A                                          '
     A                                 16  3'                                  -
     A                                                                         -
     A                                            '
     A                                 19  3'                                  -
     A                                                                         -
     A                                            '
     A          R HELPC2
     A*%%TS  SD  19940218  110238  GINNY       REL-V2R2M0  5738-PW1
     A                                 16  3' Do you allow this customer to hav-
     A                                      e contract pricing.  Enter Y or N. -
     A                                           '
     A                                 17  1' '
     A                                      DSPATR(RI)
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 14  1'   Contract Pricing:              -
     A                                                                      Req-
     A                                      uired     '
     A                                      DSPATR(RI)
     A                                 21  1'                                  -
     A                                                                         -
     A                                                '
     A                                      DSPATR(RI)
     A                                 16  1' '
     A                                      DSPATR(RI)
     A                                 15  1' '
     A                                      DSPATR(RI)
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 18  1' '
     A                                      DSPATR(RI)
     A                                 19  1' '
     A                                      DSPATR(RI)
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 19 79' '
     A                                      DSPATR(RI)
     A                                 20 79' '
     A                                      DSPATR(RI)
     A                                 15  3'                                  -
     A                                                                         -
     A                                            '
     A                                 19  3' this customer in the Contract Pri-
     A                                      ce Master File.                    -
     A                                            '
     A                                 20  3'                                  -
     A                                                                         -
     A                                            '
     A                                 17  3'                                  -
     A                                                                         -
     A                                            '
     A                                 18  3' If coded N - you will not be able-
     A                                       to enter a contract price schedule-
     A                                       for  '
     A                                 20  1' '
     A                                      DSPATR(RI)
     A                                 16 79' '
     A                                      DSPATR(RI)
     A          R HELPC3
     A*%%TS  SD  19940218  110238  GINNY       REL-V2R2M0  5738-PW1
     A                                 16  3' Does this customer allow you to p-
     A                                      artially ship an order and back ord-
     A                                      er    '
     A                                 17  1' '
     A                                      DSPATR(RI)
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 14  1'   Backorders Allowed:            -
     A                                                                      Req-
     A                                      uired     '
     A                                      DSPATR(RI)
     A                                 21  1'                                  -
     A                                                                         -
     A                                                '
     A                                      DSPATR(RI)
     A                                 16  1' '
     A                                      DSPATR(RI)
     A                                 15  1' '
     A                                      DSPATR(RI)
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 18  1' '
     A                                      DSPATR(RI)
     A                                 19  1' '
     A                                      DSPATR(RI)
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 19 79' '
     A                                      DSPATR(RI)
     A                                 20 79' '
     A                                      DSPATR(RI)
     A                                 15  3'                                  -
     A                                                                         -
     A                                            '
     A                                 19  3' any unshipped items on an order d-
     A                                      uring Shipment Confirmation.       -
     A                                            '
     A                                 20  3'                                  -
     A                                                                         -
     A                                            '
     A                                 17  3' the balance - or - does this cust-
     A                                      omer require that you cancel unship-
     A                                      ped   '
     A                                 18  3' items?  If you enter N for NO - T-
     A                                      GMS will not allow you to back orde-
     A                                      r     '
     A                                 20  1' '
     A                                      DSPATR(RI)
     A          R HELPC4
     A*%%TS  SD  19940218  110238  GINNY       REL-V2R2M0  5738-PW1
     A                                 18  3' If you offer quantity discounts o-
     A                                      n inventory items (See Item Master -
     A                                      File) '
     A                                 19  1' '
     A                                      DSPATR(RI)
     A                                 19 79' '
     A                                      DSPATR(RI)
     A                                 16  1'   Quantity Discount:             -
     A                                                                     Requ-
     A                                      ired      '
     A                                      DSPATR(RI)
     A                                 21  1'                                  -
     A                                                                         -
     A                                                '
     A                                      DSPATR(RI)
     A                                 18  1' '
     A                                      DSPATR(RI)
     A                                 17  1' '
     A                                      DSPATR(RI)
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 20 79' '
     A                                      DSPATR(RI)
     A                                 20  3'                                  -
     A                                                                         -
     A                                           '
     A                                 19  3' is this customer eligible to rece-
     A                                      ive this discount?                 -
     A                                           '
     A                                 20  1' '
     A                                      DSPATR(RI)
     A                                 17  3'                                  -
     A                                                                         -
     A                                           '
     A          R HELPC5
     A*%%TS  SD  19940218  110238  GINNY       REL-V2R2M0  5738-PW1
     A                                 16  3' Trade Discount is a discount that-
     A                                       is taken on the entire invoice aft-
     A                                      er all'
     A                                 17  1' '
     A                                      DSPATR(RI)
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 14  1'   Trade Discount:                -
     A                                                                      Opt-
     A                                      ional     '
     A                                      DSPATR(RI)
     A                                 21  1'                                  -
     A                                                                         -
     A                                                '
     A                                      DSPATR(RI)
     A                                 16  1' '
     A                                      DSPATR(RI)
     A                                 15  1' '
     A                                      DSPATR(RI)
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 18  1' '
     A                                      DSPATR(RI)
     A                                 19  1' '
     A                                      DSPATR(RI)
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 19 79' '
     A                                      DSPATR(RI)
     A                                 20 79' '
     A                                      DSPATR(RI)
     A                                 15  3'                                  -
     A                                                                         -
     A                                            '
     A                                 19  3' during order entry.  Example:  En-
     A                                      ter 5% - 5.00                      -
     A                                            '
     A                                 20  4'                                  -
     A                                                                         -
     A                                          '
     A                                 17  3' other pricing and discounts have -
     A                                      been calculated for inventory items-
     A                                      .     '
     A                                 18  3' Enter the applicable discount per-
     A                                      cent here.  This can be added or ch-
     A                                      anged '
     A                                 20  1' '
     A                                      DSPATR(RI)
     A          R HELPC6
     A*%%TS  SD  19940218  110238  GINNY       REL-V2R2M0  5738-PW1
     A                                 16  3' Enter up to 30 characters to desc-
     A                                      ribe Shipping Instructions.        -
     A                                            '
     A                                 17  1' '
     A                                      DSPATR(RI)
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 14  1'   Shipping Instructions:         -
     A                                                                       Op-
     A                                      tional    '
     A                                      DSPATR(RI)
     A                                 20  1'                                  -
     A                                                                         -
     A                                                '
     A                                      DSPATR(RI)
     A                                 16  1' '
     A                                      DSPATR(RI)
     A                                 15  1' '
     A                                      DSPATR(RI)
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 18  1' '
     A                                      DSPATR(RI)
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 19 79' '
     A                                      DSPATR(RI)
     A                                 15  3'                                  -
     A                                                                         -
     A                                            '
     A                                 19  3'                                  -
     A                                                                         -
     A                                            '
     A                                 17  3' Shipping Instructions print on Pi-
     A                                      ck Slips, Order Acknowledgements an-
     A                                      d     '
     A                                 18  3' Invoices.   These instructions ca-
     A                                      n be changed during Order Entry.   -
     A                                            '
     A                                 19  1' '
     A                                      DSPATR(RI)
     A          R HCFRTZ
     A*%%TS  SD  19940317  124723  GINNY       REL-V2R2M0  5738-PW1
     A                                 16  3' Enter the Freight Zone used for a-
     A                                      utomatic freight charge calculation-
     A                                       for  '
     A                                 17  1' '
     A                                      DSPATR(RI)
     A  *DS4                           17  1
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 14  1'   Freight Zone:                  -
     A                                                                       Op-
     A                                      tional    '
     A                                      DSPATR(RI)
     A  *DS4                           14  1
     A                                 20  1'                                  -
     A                                                                         -
     A                                                '
     A                                      DSPATR(RI)
     A  *DS4                           20  1
     A                                 16  1' '
     A                                      DSPATR(RI)
     A  *DS4                           16  1
     A                                 15  1' '
     A                                      DSPATR(RI)
     A  *DS4                           15  1
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 18  1' '
     A                                      DSPATR(RI)
     A  *DS4                           18  1
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 19 79' '
     A                                      DSPATR(RI)
     A                                 15  3'                                  -
     A                                                                         -
     A                                            '
     A                                 19  3'                                  -
     A                                                                         -
     A                                            '
     A                                 17  3' this customer.  This must be a va-
     A                                      lid freight zone.  This can be chan-
     A                                      ged   '
     A                                 18  3' during order entry.              -
     A                                                                         -
     A                                            '
     A                                 19  1' '
     A                                      DSPATR(RI)
     A  *DS4                           19  1
     A          R HCSPEC
     A*%%TS  SD  19940218  154531  GINNY       REL-V2R2M0  5738-PW1
     A                                 16  3' Enter up to 30 characters to desc-
     A                                      ribe Special Instructions for custo-
     A                                      mer.  '
     A                                 17  1' '
     A                                      DSPATR(RI)
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 14  1'   Special Instructions:          -
     A                                                                       Op-
     A                                      tional    '
     A                                      DSPATR(RI)
     A                                 20  1'                                  -
     A                                                                         -
     A                                                '
     A                                      DSPATR(RI)
     A                                 16  1' '
     A                                      DSPATR(RI)
     A                                 15  1' '
     A                                      DSPATR(RI)
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 18  1' '
     A                                      DSPATR(RI)
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 19 79' '
     A                                      DSPATR(RI)
     A                                 15  3'                                  -
     A                                                                         -
     A                                            '
     A                                 19  3'                                  -
     A                                                                         -
     A                                            '
     A                                 17  3' Special Instructions print on Pic-
     A                                      k Slips, Order Acknowledgements and-
     A                                            '
     A                                 18  3' Invoices.   These instructions ca-
     A                                      n be changed during Order Entry.   -
     A                                            '
     A                                 19  1' '
     A                                      DSPATR(RI)
     A          R HCPHYT
     A*%%TS  SD  19951030  164001  GINNY       REL-V3R1M0  5763-PW1
     A                                 16  3' Phyto codes are normally determin-
     A                                      ed by state.  If this customer has -
     A                                      a     '
     A                                 17  1' '
     A                                      DSPATR(RI)
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 14  1'   Override Phyto Code:           -
     A                                                                       Op-
     A                                      tional    '
     A                                      DSPATR(RI)
     A                                 20  1'                                  -
     A                                                                         -
     A                                                '
     A                                      DSPATR(RI)
     A                                 16  1' '
     A                                      DSPATR(RI)
     A                                 15  1' '
     A                                      DSPATR(RI)
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 18  1' '
     A                                      DSPATR(RI)
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 19 79' '
     A                                      DSPATR(RI)
     A                                 15  3'                                  -
     A                                                                         -
     A                                            '
     A                                 19  3'                                  -
     A                                                                         -
     A                                            '
     A                                 17  3' higher requirement than the state-
     A                                      , you can enter that phyto code her-
     A                                      e.    '
     A                                 18  3' This will supercede the state cod-
     A                                      e for all shipments for this custom-
     A                                      er.   '
     A                                 19  1' '
     A                                      DSPATR(RI)
     A          R HCSVIA
     A*%%TS  SD  19940317  124723  GINNY       REL-V2R2M0  5738-PW1
     A                                 16  3' Enter a valid Ship Via Code to de-
     A                                      scribe the most frequent method of -
     A                                      ship- '
     A                                 17  1' '
     A                                      DSPATR(RI)
     A  *DS4                           17  1
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 14  1'   Ship Via:                      -
     A                                                                       Op-
     A                                      tional    '
     A                                      DSPATR(RI)
     A  *DS4                           14  1
     A                                 20  1'                                  -
     A                                                                         -
     A                                                '
     A                                      DSPATR(RI)
     A  *DS4                           20  1
     A                                 16  1' '
     A                                      DSPATR(RI)
     A  *DS4                           16  1
     A                                 15  1' '
     A                                      DSPATR(RI)
     A  *DS4                           15  1
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 18  1' '
     A                                      DSPATR(RI)
     A  *DS4                           18  1
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 19 79' '
     A                                      DSPATR(RI)
     A                                 15  3'                                  -
     A                                                                         -
     A                                            '
     A                                 19  3'                                  -
     A                                                                         -
     A                                            '
     A                                 17  3' ing for customer.   This can be c-
     A                                      hanged during order enter.  This mu-
     A                                      st be '
     A                                 18  3' a valid Ship Via Code in the Comp-
     A                                      any Control File.                  -
     A                                            '
     A                                 19  1' '
     A                                      DSPATR(RI)
     A  *DS4                           19  1
     A          R HFLOC
     A*%%TS  SD  19951031  114417  GINNY       REL-V3R1M0  5763-PW1
     A                                 16  3' Orders shipped to this customer a-
     A                                      re normally shipped from this locat-
     A                                      ion.  '
     A                                 17  1' '
     A                                      DSPATR(RI)
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 14  1'   Default Ship From Location:    -
     A                                                                       Op-
     A                                      tional    '
     A                                      DSPATR(RI)
     A                                 20  1'                                  -
     A                                                                         -
     A                                                '
     A                                      DSPATR(RI)
     A                                 16  1' '
     A                                      DSPATR(RI)
     A                                 15  1' '
     A                                      DSPATR(RI)
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 18  1' '
     A                                      DSPATR(RI)
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 19 79' '
     A                                      DSPATR(RI)
     A                                 15  3'                                  -
     A                                                                         -
     A                                            '
     A                                 19  3'                                  -
     A                                                                         -
     A                                            '
     A                                 17  3' If a location is entered here, it-
     A                                       must be a valid location that has -
     A                                      been  '
     A                                 18  3' defined in the Location Master fi-
     A                                      le.                                -
     A                                            '
     A                                 19  1' '
     A                                      DSPATR(RI)
     A          R HCTAX
     A*%%TS  SD  19940218  110238  GINNY       REL-V2R2M0  5738-PW1
     A                                 15  3' 1.  If this Customer is Tax Exemp-
     A                                      t - Enter Y.   If Taxable - Enter N-
     A                                      .     '
     A                                 16  1' '
     A                                      DSPATR(RI)
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 13  1'   Taxes:                         -
     A                                                                       Re-
     A                                      quired    '
     A                                      DSPATR(RI)
     A                                 23  1'                                  -
     A                                                                         -
     A                                                '
     A                                      DSPATR(RI)
     A                                 15  1' '
     A                                      DSPATR(RI)
     A                                 14  1' '
     A                                      DSPATR(RI)
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 14 79' '
     A                                      DSPATR(RI)
     A                                 17  1' '
     A                                      DSPATR(RI)
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 14  3'                                  -
     A                                                                         -
     A                                            '
     A                                 18  3'     the total taxable and non tax-
     A                                      able sales by Tax Jurisdiction.  Th-
     A                                      is Tax'
     A                                 16  3' 2.  Enter the Tax Jurisdiction fo-
     A                                      r this Customer.  This field is req-
     A                                      uired '
     A                                 17  3'     for both taxable and tax exem-
     A                                      pt customers because the tax report-
     A                                       shows'
     A                                 18  1' '
     A                                      DSPATR(RI)
     A                                 19  1' '
     A                                      DSPATR(RI)
     A                                 19  3'     Jurisction must be a defined -
     A                                      in the Tax Master File.            -
     A                                            '
     A                                 19 79' '
     A                                      DSPATR(RI)
     A                                 20  1' '
     A                                      DSPATR(RI)
     A                                 20  3' 3.  Tax ID is an information only-
     A                                       field and can be used to store the-
     A                                       sales'
     A                                 20 79' '
     A                                      DSPATR(RI)
     A                                 21  3'     tax number of tax exempt cust-
     A                                      omers.                             -
     A                                            '
     A                                 21  1' '
     A                                      DSPATR(RI)
     A                                 21 79' '
     A                                      DSPATR(RI)
     A                                 22 79' '
     A                                      DSPATR(RI)
     A                                 22  1' '
     A                                      DSPATR(RI)
     A                                 22  3'                                  -
     A                                                                         -
     A                                            '
     A          R HCTERM
     A*%%TS  SD  19940222  122627  GINNY       REL-V2R2M0  5738-PW1
     A                                  7  3' This Code determines the terms yo-
     A                                      u extend to this customer for payme-
     A                                      nts   '
     A                                  8  1' '
     A                                      DSPATR(RI)
     A                                  8 79' '
     A                                      DSPATR(RI)
     A                                  5  1'   Terms Code:                    -
     A                                                                       Re-
     A                                      quired    '
     A                                      DSPATR(RI)
     A                                 13  1'                                  -
     A                                                                         -
     A                                                '
     A                                      DSPATR(RI)
     A                                  7  1' '
     A                                      DSPATR(RI)
     A                                  6  1' '
     A                                      DSPATR(RI)
     A                                  7 79' '
     A                                      DSPATR(RI)
     A                                  6 79' '
     A                                      DSPATR(RI)
     A                                  9  1' '
     A                                      DSPATR(RI)
     A                                  9 79' '
     A                                      DSPATR(RI)
     A                                 10 79' '
     A                                      DSPATR(RI)
     A                                  6  3'                                  -
     A                                                                         -
     A                                            '
     A                                 10  3' File.   The terms code can be cha-
     A                                      nged during order entry if you wish-
     A                                       to   '
     A                                  8  3' of invoices, such as Net 30 - or -
     A                                      1% 10 Days Net 30.                 -
     A                                            '
     A                                  9  3' Enter a valid Terms Code that has-
     A                                       been defined in the Company Contro-
     A                                      l     '
     A                                 10  1' '
     A                                      DSPATR(RI)
     A                                 11  1' '
     A                                      DSPATR(RI)
     A                                 11  3' extend different payment terms fo-
     A                                      r a particular order.              -
     A                                            '
     A                                 11 79' '
     A                                      DSPATR(RI)
     A                                 12 79' '
     A                                      DSPATR(RI)
     A                                 12  3'                                  -
     A                                                                         -
     A                                            '
     A                                 12  1' '
     A                                      DSPATR(RI)
     A          R HCCRDL
     A*%%TS  SD  19940317  124723  GINNY       REL-V2R2M0  5738-PW1
     A                                  7  3' If the total of accounts receivab-
     A                                      le due together with the total doll-
     A                                      ar    '
     A                                  7  1' '
     A                                      DSPATR(RI)
     A  *DS4                            7  1
     A                                  7 79' '
     A                                      DSPATR(RI)
     A                                  4  1'   Credit Limit:                  -
     A                                                                       Op-
     A                                      tional    '
     A                                      DSPATR(RI)
     A  *DS4                            4  1
     A                                 12  1'                                  -
     A                                                                         -
     A                                                '
     A                                      DSPATR(RI)
     A  *DS4                           12  1
     A                                  6  1' '
     A                                      DSPATR(RI)
     A  *DS4                            6  1
     A                                  5  1' '
     A                                      DSPATR(RI)
     A  *DS4                            5  1
     A                                  6 79' '
     A                                      DSPATR(RI)
     A                                  5 79' '
     A                                      DSPATR(RI)
     A                                  8  1' '
     A                                      DSPATR(RI)
     A  *DS4                            8  1
     A                                  8 79' '
     A                                      DSPATR(RI)
     A                                  9 79' '
     A                                      DSPATR(RI)
     A                                  5  3'                                  -
     A                                                                         -
     A                                            '
     A                                 10  3' flagged on the Aged Trial Balance-
     A                                       reports.                          -
     A                                            '
     A                                  8  3' amount of open orders exceeds the-
     A                                       credit limit amount for a customer-
     A                                      , a   '
     A                                  9  3' warning will be displayed during -
     A                                      order entry and the customer will b-
     A                                      e     '
     A                                  9  1' '
     A                                      DSPATR(RI)
     A  *DS4                            9  1
     A                                 10  1' '
     A                                      DSPATR(RI)
     A  *DS4                           10  1
     A                                 10 79' '
     A                                      DSPATR(RI)
     A                                 11 79' '
     A                                      DSPATR(RI)
     A                                 11  1' '
     A                                      DSPATR(RI)
     A  *DS4                           11  1
     A                                  6  3' Enter the amount of the highest c-
     A                                      redit you want to extend to the cus-
     A                                      tomer.'
     A                                 11  3'                                  -
     A                                                                         -
     A                                            '
     A          R HCCNAM
     A*%%TS  SD  19940222  122627  GINNY       REL-V2R2M0  5738-PW1
     A                                  5  4'     Contact Name:                -
     A                                                               Optional  -
     A                                         '
     A                                      DSPATR(RI)
     A                                 11  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                  7  4' '
     A                                      DSPATR(RI)
     A                                 10  4' '
     A                                      DSPATR(RI)
     A                                  6  4' '
     A                                      DSPATR(RI)
     A                                  6 75' '
     A                                      DSPATR(RI)
     A                                  7 75' '
     A                                      DSPATR(RI)
     A                                 10 75' '
     A                                      DSPATR(RI)
     A                                  7  6'   Enter the name of the person yo-
     A                                      u contact at this customer for    '
     A                                  8  4' '
     A                                      DSPATR(RI)
     A                                  8 75' '
     A                                      DSPATR(RI)
     A                                  8  6'   accounts receivable information-
     A                                      .  This name will display on A/R  '
     A                                 10  6'                                  -
     A                                                                        '
     A                                  9  4' '
     A                                      DSPATR(RI)
     A                                  9  6'   inquiries and print on Detail A-
     A                                      ged Trial Balance reports.        '
     A                                  9 75' '
     A                                      DSPATR(RI)
     A                                  6  6'                                  -
     A                                                                        '
     A          R HCARTYP
     A*%%TS  SD  19940317  124723  GINNY       REL-V2R2M0  5738-PW1
     A                                  3  4'     Accounts Receivable Type:    -
     A                                                               Required  -
     A                                         '
     A                                      DSPATR(RI)
     A                                 12  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                  6  4' '
     A                                      DSPATR(RI)
     A                                  9  4' '
     A                                      DSPATR(RI)
     A                                  4  4' '
     A                                      DSPATR(RI)
     A                                  4 75' '
     A                                      DSPATR(RI)
     A                                  6 75' '
     A                                      DSPATR(RI)
     A                                  9 75' '
     A                                      DSPATR(RI)
     A                                  6  6'   Valid types are:  O - Open Item-
     A                                        or  B - Balance Forward         '
     A                                  7  4' '
     A                                      DSPATR(RI)
     A                                  7 75' '
     A                                      DSPATR(RI)
     A                                  7  6'   An Open Item Statement prints a-
     A                                      ll open transactions for both the '
     A                                  9  6'   prints the current period trans-
     A                                      actions but summarizes the balance'
     A                                  8  4' '
     A                                      DSPATR(RI)
     A                                  8  6'   current period and previous per-
     A                                      iods.  A Balance Forward Statement'
     A                                  8 75' '
     A                                      DSPATR(RI)
     A                                  4  6'                                  -
     A                                                                        '
     A                                  5  4' '
     A                                      DSPATR(RI)
     A                                  5  6'   A/R type defines how the custom-
     A                                      er statement will print.          '
     A                                  5 75' '
     A                                      DSPATR(RI)
     A                                 10  4' '
     A                                      DSPATR(RI)
     A                                 10  6'   from previous months as a singl-
     A                                      e line - Balance Forward.         '
     A                                 10 75' '
     A                                      DSPATR(RI)
     A                                 11  4' '
     A                                      DSPATR(RI)
     A                                 11  6'                                  -
     A                                                                        '
     A                                 11 75' '
     A                                      DSPATR(RI)
     A          R HCLATC
     A*%%TS  SD  19940222  122627  GINNY       REL-V2R2M0  5738-PW1
     A                                  5  4'     Apply Late Charges:          -
     A                                                               Required  -
     A                                         '
     A                                      DSPATR(RI)
     A                                 10  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                  8  4' '
     A                                      DSPATR(RI)
     A                                  6  4' '
     A                                      DSPATR(RI)
     A                                  6 75' '
     A                                      DSPATR(RI)
     A                                  8 75' '
     A                                      DSPATR(RI)
     A                                  8  6'   a late charge be calcualted for-
     A                                       this customer?  Enter Y or N.    '
     A                                  6  6'                                  -
     A                                                                        '
     A                                  7  4' '
     A                                      DSPATR(RI)
     A                                  7  6'   If your company charges late ch-
     A                                      arges on unpaid balances, should  '
     A                                  7 75' '
     A                                      DSPATR(RI)
     A                                  9  4' '
     A                                      DSPATR(RI)
     A                                  9  6'                                  -
     A                                                                        '
     A                                  9 75' '
     A                                      DSPATR(RI)
     A          R HCSTMCY
     A*%%TS  SD  19940222  122627  GINNY       REL-V2R2M0  5738-PW1
     A                                  6  4'     Statement Cycle:  Valid Entri-
     A                                      es 1 - 9                 Required  -
     A                                         '
     A                                      DSPATR(RI)
     A                                 15  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                  9  4' '
     A                                      DSPATR(RI)
     A                                 12  4' '
     A                                      DSPATR(RI)
     A                                  7  4' '
     A                                      DSPATR(RI)
     A                                  7 75' '
     A                                      DSPATR(RI)
     A                                  9 75' '
     A                                      DSPATR(RI)
     A                                 12 75' '
     A                                      DSPATR(RI)
     A                                  9  6'   enter the statement cycle.  Onl-
     A                                      y customers coded with this cycle '
     A                                 10  4' '
     A                                      DSPATR(RI)
     A                                 10 75' '
     A                                      DSPATR(RI)
     A                                 10  6'   will be included in this statem-
     A                                      ent run.  This allows you to      '
     A                                 12  6'   customers that need weekly stat-
     A                                      ements would be coded differently '
     A                                 11  4' '
     A                                      DSPATR(RI)
     A                                 11  6'   print batches of statements at -
     A                                      different times.  For example:    '
     A                                 11 75' '
     A                                      DSPATR(RI)
     A                                  7  6'                                  -
     A                                                                        '
     A                                  8  4' '
     A                                      DSPATR(RI)
     A                                  8  6'   When printing Customer A/R stat-
     A                                      ements you will be prompted to    '
     A                                  8 75' '
     A                                      DSPATR(RI)
     A                                 13  4' '
     A                                      DSPATR(RI)
     A                                 13  6'   than customers that receive mon-
     A                                      thly statements.                  '
     A                                 13 75' '
     A                                      DSPATR(RI)
     A                                 14  4' '
     A                                      DSPATR(RI)
     A                                 14  6'                                  -
     A                                                                        '
     A                                 14 75' '
     A                                      DSPATR(RI)
     A          R HCCOD
     A*%%TS  SD  19940815  155304  GINNY       REL-V2R2M0  5738-PW1
     A                                  5  4'     Cash or Cash/Check Only      -
     A                                                               Required  -
     A                                         '
     A                                      DSPATR(RI)
     A                                 13  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                  8  4' '
     A                                      DSPATR(RI)
     A                                  6  4' '
     A                                      DSPATR(RI)
     A                                  6 75' '
     A                                      DSPATR(RI)
     A                                  8 75' '
     A                                      DSPATR(RI)
     A                                  8  6'   customer.                      -
     A                                                                        '
     A                                  6  6'                                  -
     A                                                                        '
     A                                  7  4' '
     A                                      DSPATR(RI)
     A                                  7  6'   This determines the method of p-
     A                                      ayment that you accept from this  '
     A                                  7 75' '
     A                                      DSPATR(RI)
     A                                  9  4' '
     A                                      DSPATR(RI)
     A                                  9  6'                  C - Cash Only is-
     A                                       accepted                         '
     A                                  9 75' '
     A                                      DSPATR(RI)
     A                                 10  6'                  K - Cash or Chec-
     A                                      k is accepted                     '
     A                                 12  6'                                  -
     A                                                                        '
     A                                 11  6'                  N - Cash, Check -
     A                                      or Charge is accepted             '
     A                                 10  4' '
     A                                      DSPATR(RI)
     A                                 11  4' '
     A                                      DSPATR(RI)
     A                                 12  4' '
     A                                      DSPATR(RI)
     A                                 10 75' '
     A                                      DSPATR(RI)
     A                                 11 75' '
     A                                      DSPATR(RI)
     A                                 12 75' '
     A                                      DSPATR(RI)
     A          R HCCOPY
     A*%%TS  SD  19940222  122627  GINNY       REL-V2R2M0  5738-PW1
     A                                  4  4'     Number of Statement and Invoi-
     A                                      ce Copies: 1, 2, 3       Required  -
     A                                         '
     A                                      DSPATR(RI)
     A                                 12  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                  7  4' '
     A                                      DSPATR(RI)
     A                                 10  4' '
     A                                      DSPATR(RI)
     A                                  5  4' '
     A                                      DSPATR(RI)
     A                                  5 75' '
     A                                      DSPATR(RI)
     A                                  7 75' '
     A                                      DSPATR(RI)
     A                                 10 75' '
     A                                      DSPATR(RI)
     A                                  7  6'   statement.  You can code a cust-
     A                                      omer for 1, 2 or 3 copies.        '
     A                                  8  4' '
     A                                      DSPATR(RI)
     A                                  8 75' '
     A                                      DSPATR(RI)
     A                                  8  6'   When invoices or statements are-
     A                                       printed, if there are any        '
     A                                 10  6'   first copy has printed.        -
     A                                                                        '
     A                                  9  4' '
     A                                      DSPATR(RI)
     A                                  9  6'   customers coded for 2 or 3 copi-
     A                                      es, they will print after the     '
     A                                  9 75' '
     A                                      DSPATR(RI)
     A                                  5  6'                                  -
     A                                                                        '
     A                                  6  4' '
     A                                      DSPATR(RI)
     A                                  6  6'   Some customers may require more-
     A                                       than 1 copy of their invoice and '
     A                                  6 75' '
     A                                      DSPATR(RI)
     A                                 11  4' '
     A                                      DSPATR(RI)
     A                                 11  6'                                  -
     A                                                                        '
     A                                 11 75' '
     A                                      DSPATR(RI)
     A          R HCPSLS
     A*%%TS  SD  19940317  124723  GINNY       REL-V2R2M0  5738-PW1
     A                                 11  4'     Post Detail Sales History:   -
     A                                                               Required  -
     A                                         '
     A                                      DSPATR(RI)
     A                                 17  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                 14  4' '
     A                                      DSPATR(RI)
     A                                 12  4' '
     A                                      DSPATR(RI)
     A                                 12 75' '
     A                                      DSPATR(RI)
     A                                 14 75' '
     A                                      DSPATR(RI)
     A                                 14  6'   each item that this customer pu-
     A                                      rchases.  If coded N - only sales '
     A                                 15  4' '
     A                                      DSPATR(RI)
     A                                 15 75' '
     A                                      DSPATR(RI)
     A                                 15  6'   summary totals will be maintain-
     A                                      ed for the customer.              '
     A                                 12  6'                                  -
     A                                                                        '
     A                                 13  4' '
     A                                      DSPATR(RI)
     A                                 13  6'   If a customer is coded Y - sale-
     A                                      s history will be maintained for  '
     A                                 13 75' '
     A                                      DSPATR(RI)
     A                                 16  4' '
     A                                      DSPATR(RI)
     A                                 16  6'                                  -
     A                                                                        '
     A                                 16 75' '
     A                                      DSPATR(RI)
     A          R HCOACK
     A*%%TS  SD  19940222  122627  GINNY       REL-V2R2M0  5738-PW1
     A                                  9  4'     Print Order Acknowledgements:-
     A                                                               Required  -
     A                                         '
     A                                      DSPATR(RI)
     A                                 16  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                 12  4' '
     A                                      DSPATR(RI)
     A                                 10  4' '
     A                                      DSPATR(RI)
     A                                 10 75' '
     A                                      DSPATR(RI)
     A                                 12 75' '
     A                                      DSPATR(RI)
     A                                 12  6'   If this customer is coded N, or-
     A                                      der acknowledgements will not be  '
     A                                 13  4' '
     A                                      DSPATR(RI)
     A                                 13 75' '
     A                                      DSPATR(RI)
     A                                 13  6'   printed unless an acknowledgeme-
     A                                      nt is requested for a specific    '
     A                                 10  6'                                  -
     A                                                                        '
     A                                 11  4' '
     A                                      DSPATR(RI)
     A                                 11  6'   Not all customers require that -
     A                                      an order acknowledgment be sent.  '
     A                                 11 75' '
     A                                      DSPATR(RI)
     A                                 15  4' '
     A                                      DSPATR(RI)
     A                                 15  6'                                  -
     A                                                                        '
     A                                 15 75' '
     A                                      DSPATR(RI)
     A                                 14  4' '
     A                                      DSPATR(RI)
     A                                 14  6'   order number using the reprint -
     A                                      function.                         '
     A                                 14 75' '
     A                                      DSPATR(RI)
     A          R SCRND
     A*%%TS  SD  19960903  211506  GINNY       REL-V3R1M0  5763-PW1
     A                                      CF02
     A                                      CF07
     A                                      CF08
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      ALWROL
     A                                      INVITE
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A          H                           HLPRCD(HELPD)
     A  *DS3                                HLPARA(06 002 14 078)
     A  *DS4                                HLPARA(06 002 14 078)
     A                                  1  2'ARV010D'
     A                                  1 26' Customer Master Maintenance '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A            VMODE         10A  O  2 35DSPATR(RI)
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  4  2'Customer:'
     A            CMCUST         6Y 0O  4 13
     A  50                                  DSPATR(PC)
     A                                      EDTCDE(Z)
     A  50                                  DSPATR(HI)
     A            CMNAME        30A  O  4 22
     A  50                                  DSPATR(HI)
     A                                  6  2'Bank Number:'
     A            HSBANK        10Y 0B  6 15
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  50                                  DSPATR(HI)
     A                                  7  2'Credit Card:'
     A            HSCRCD         4A  B  7 15
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                  7 21'Number:'
     A            HSCRC#        16Y 0B  7 29
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  50                                  DSPATR(HI)
     A                                  7 47'Exp Date:'
     A            HSCRDT         4Y 0B  7 57
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                      EDTCDE(Y)
     A  50                                  DSPATR(HI)
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A  08                                  ERRMSG('*** Enter A Valid Date.    -
     A                                         Press Reset')
     A                                  9  2'Source of Customer:'
     A            HSSRCE         2A  B  9 22
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                  9 45'Business Size (in Thousands):'
     A            HSSIZE         5Y 0B  9 75
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  50                                  DSPATR(HI)
     A                                 10  2'SIC Number:'
     A            HSSIC#         8A  B 10 22
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 10 45'Number of Employees:'
     A            HS#EMP         5Y 0B 10 75
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A                                      EDTCDE(Z)
     A  50                                  DSPATR(HI)
     A                                 11  2'D & B Rating:'
     A            HSBDRT         5A  B 11 22
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 12  2'Last Financial Statement Date:'
     A            HSFNDT         6Y 0B 12 34
     A N50                                  DSPATR(CS)
     A  50                                  DSPATR(PR)
     A                                      EDTCDE(Y)
     A  50                                  DSPATR(HI)
     A                                 12 45'Audited (Y/N):'
     A            HSAUDT         1A  B 12 61
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 14  2'Comments:'
     A            HSCOM1        30A  B 14 13
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A                                      CHECK(LC)
     A  50                                  DSPATR(HI)
     A            HSCOM2        30A  B 15 13
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A                                      CHECK(LC)
     A  50                                  DSPATR(HI)
     A            HSCOM3        30A  B 16 13
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  50                                  DSPATR(PR)
     A                                      CHECK(LC)
     A  50                                  DSPATR(HI)
     A                                 18  2'Include on Customer and Ship Date -
     A                                      Order Reports:'
     A            HSINCL         1X  B 18 52
     A N50                                  DSPATR(CS)
     A                                      DSPATR(MDT)
     A  80                                  DSPATR(RI)
     A  80                                  DSPATR(PC)
     A  50                                  DSPATR(PR)
     A  80 99                               ERRMSG('*** Valid Entries are Y or -
     A                                      N.          Press Reset')
     A  50                                  DSPATR(HI)
     A                                 21 16' Validate Data - Change or Press E-
     A                                      nter to Accept '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2' Enter to Process     F2=Previous -
     A                                      Screen     F7=End of Job      F8=Di-
     A                                      rections '
     A                                      DSPATR(UL)
     A          R HELPD
     A*%%TS  SD  19940131  163849  GINNY       REL-V2R2M0  5738-PW1
     A                                 16  3' All of the data on this screen is-
     A                                       for your information only and is n-
     A                                      ot    '
     A                                 17  1' '
     A                                      DSPATR(RI)
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 14  1'                                  -
     A                                                                         -
     A                                                '
     A                                      DSPATR(RI)
     A                                 22  1'                                  -
     A                                                                         -
     A                                                '
     A                                      DSPATR(RI)
     A                                 16  1' '
     A                                      DSPATR(RI)
     A                                 15  1' '
     A                                      DSPATR(RI)
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 18  1' '
     A                                      DSPATR(RI)
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 19 79' '
     A                                      DSPATR(RI)
     A                                 15  3'                                  -
     A                                                                         -
     A                                            '
     A                                 19  3' growing for inventory and enter t-
     A                                      hese orders to your company as a   -
     A                                            '
     A                                 17  3' used by TGMS except the last fiel-
     A                                      d - Should this Customer be Printed-
     A                                       on   '
     A                                 18  3' Customer and Ship Date Reports.  -
     A                                      If you enter orders for material yo-
     A                                      u are '
     A                                 19  1' '
     A                                      DSPATR(RI)
     A                                 20  1' '
     A                                      DSPATR(RI)
     A                                 20 79' '
     A                                      DSPATR(RI)
     A                                 21 79' '
     A                                      DSPATR(RI)
     A                                 21  1' '
     A                                      DSPATR(RI)
     A                                 20  3' customer - you probably do not wa-
     A                                      nt these orders on these reports . -
     A                                            '
     A                                 21  3'                                  -
     A                                                                         -
     A                                            '
     A          R SCRNE
     A*%%TS  SD  19951117  093741  GINNY       REL-V3R1M0  5763-PW1
     A                                      CF06
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      CF03
     A                                      HOME
     A                                      HELP
     A                                      ALWROL
     A                                      INVITE
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A          H                           HLPRCD(HELPE)
     A  *DS3                                HLPARA(05 001 10 078)
     A  *DS4                                HLPARA(05 015 05 044)
     A                                  1  2'ARV010E'
     A                                  1 26' Customer Master Maintenance '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A            VMODE         10A  O  2 35DSPATR(RI)
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  3  2'Help Active'
     A                                  5  5'Customer:'
     A            CMCUST         6Y 0O  5 16EDTCDE(Z)
     A  50                                  DSPATR(PC)
     A  50                                  DSPATR(HI)
     A                                 21 16' Validate Data - Change or Press E-
     A                                      nter to Accept '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2' Enter to Process      F6=Restart -
     A                                             F7=End of Job (Data Not Save-
     A                                      d)       '
     A                                      DSPATR(UL)
     A            CMNAME        30A  O  5 23
     A  50                                  DSPATR(HI)
     A                                  8  5'Salutation:'
     A                                  9  5'First Name:'
     A                                 10  5'Last Name:'
     A                                 11  5'Title:'
     A            CMPTTL         8A  B  8 20
     A N50                                  DSPATR(CS)
     A                                      CHECK(LC)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A            CMFNAM        12A  B  9 20
     A N50                                  DSPATR(CS)
     A                                      CHECK(LC)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A            CMLNAM        20A  B 10 20
     A N50                                  DSPATR(CS)
     A                                      CHECK(LC)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A            CMBTTL        30A  B 11 20
     A N50                                  DSPATR(CS)
     A                                      CHECK(LC)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                 21 27' Press Enter to Verify Data '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A          R HELPE
     A*%%TS  SD  19940222  122627  GINNY       REL-V2R2M0  5738-PW1
     A                                 16  4'                                  -
     A                                                                 Optional-
     A                                         '
     A                                      DSPATR(RI)
     A                                 21  4'                                  -
     A                                                                         -
     A                                         '
     A                                      DSPATR(RI)
     A                                 18  4' '
     A                                      DSPATR(RI)
     A                                 20  4' '
     A                                      DSPATR(RI)
     A                                 17  4' '
     A                                      DSPATR(RI)
     A                                 17 75' '
     A                                      DSPATR(RI)
     A                                 18 75' '
     A                                      DSPATR(RI)
     A                                 20 75' '
     A                                      DSPATR(RI)
     A                                 18  6'  These fields are not used by TGM-
     A                                      S.  You can enter this data       '
     A                                 19  4' '
     A                                      DSPATR(RI)
     A                                 19 75' '
     A                                      DSPATR(RI)
     A                                 19  6'  to use with Query or Word Proces-
     A                                      sing applications.                '
     A                                 17  6'                                  -
     A                                                                        '
     A                                 20  6'                                  -
     A                                                                        '
     A          R HELPF
     A*%%TS  SD  19940317  124723  GINNY       REL-V2R2M0  5738-PW1
     A                                 15  3' If your company makes scheduled d-
     A                                      eliveries to customers with company-
     A                                            '
     A                                 16  1' '
     A                                      DSPATR(RI)
     A  *DS4                           16  1
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 13  1'   Truck Routes and Stops         -
     A                                                                       Op-
     A                                      tional    '
     A                                      DSPATR(RI)
     A  *DS4                           13  1
     A                                 22  1'                                  -
     A                                                                         -
     A                                                '
     A                                      DSPATR(RI)
     A  *DS4                           22  1
     A                                 15  1' '
     A                                      DSPATR(RI)
     A  *DS4                           15  1
     A                                 14  1' '
     A                                      DSPATR(RI)
     A  *DS4                           14  1
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 14 79' '
     A                                      DSPATR(RI)
     A                                 17  1' '
     A                                      DSPATR(RI)
     A  *DS4                           17  1
     A                                 21  1' '
     A                                      DSPATR(RI)
     A  *DS4                           21  1
     A                                 18  1' '
     A                                      DSPATR(RI)
     A  *DS4                           18  1
     A                                 19  1' '
     A                                      DSPATR(RI)
     A  *DS4                           19  1
     A                                 19  3' There is a detail and a summary r-
     A                                      eport of open orders that can be pr-
     A                                      inted '
     A                                 20  1' '
     A                                      DSPATR(RI)
     A  *DS4                           20  1
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 19 79' '
     A                                      DSPATR(RI)
     A                                 20 79' '
     A                                      DSPATR(RI)
     A                                 21 79' '
     A                                      DSPATR(RI)
     A                                 14  3'                                  -
     A                                                                         -
     A                                            '
     A                                 16  3' trucks, you can enter a Route Ide-
     A                                      ntification Code and a Stop Number -
     A                                      to    '
     A                                 21  4'                                  -
     A                                                                         -
     A                                          '
     A                                 17  3' assist with planning these delive-
     A                                      ries.                              -
     A                                            '
     A                                 20  3' in Route order.                  -
     A                                                                         -
     A                                            '
     A                                 18  3'                                  -
     A                                                                         -
     A                                            '
     A          R SCRNDPC
     A*%%TS  SD  19990325  123323  EFD         REL-V3R7M0  5716-PW1
     A                                      CF06
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      CF03
     A                                      HOME
     A                                      HELP
     A                                      CF04
     A                                      ALWROL
     A                                      INVITE
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                  1  2'ARV010DPC'
     A                                  1 26' Customer Master Maintenance '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A            VMODE         10A  O  2 35DSPATR(RI)
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  3 17'Customer:'
     A            CMCUST         6Y 0O  3 28EDTCDE(Z)
     A  50                                  DSPATR(PC)
     A  50                                  DSPATR(HI)
     A            CMNAME        30A  O  3 35
     A  50                                  DSPATR(HI)
     A                                  4 21'Alternate Info.'
     A                                      DSPATR(UL)
     A                                  5  2'Phone #1:'
     A            CAPH1         10Y 0B  5 12DSPATR(CS)
     A                                      EDTWRD('   -   -    ')
     A N21N22                               DSPATR(PC)
     A                                  5 25'Call:'
     A            CAALT1        50A  B  5 31DSPATR(CS)
     A                                  6  2'Phone #2:'
     A            CAPH2         10Y 0B  6 12DSPATR(CS)
     A                                      EDTWRD('   -   -    ')
     A                                  6 25'Call:'
     A            CAALT2        50A  B  6 31DSPATR(CS)
     A                                  7  2'e-mail Address:'
     A            CAEMAL        40A  B  7 18DSPATR(CS)
     A                                  8  2'Date Business Started Month:'
     A            CABSSM         2Y 0B  8 31
     A  21
     AO 22                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  21                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A  21                                  ERRMSG('*** Invalid Month Entered. -
     A                                               Press RESET')
     A                                  8 34'Day:'
     A            CABSSD         2Y 0B  8 39
     A  22                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A                                      EDTCDE(4)
     A  22                                  DSPATR(PC)
     A  22                                  ERRMSG('*** Invalid Month,Day,Year -
     A                                      Combination Entered.   Press RESET')
     A                                  8 42'Year:'
     A            CABSSY         4Y 0B  8 48
     A  23
     AO 22                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  23                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A  23                                  ERRMSG('*** Invalid Year Entered.  -
     A                                                 Press RESET')
     A                                  9 16'Salutation'
     A                                  9 28'First Name'
     A                                  9 41'Last Name'
     A                                 10  2'Owner Info.'
     A                                      DSPATR(UL)
     A                                 10 15'#1:'
     A            CAPTTL         8A  B 10 19DSPATR(CS)
     A                                      CHECK(LC)
     A            CAFNAM        12A  B 10 28DSPATR(CS)
     A                                      CHECK(LC)
     A            CALNAM        20A  B 10 41DSPATR(CS)
     A                                      CHECK(LC)
     A                                 11 15'#2:'
     A            CAPTT2         8A  B 11 19DSPATR(CS)
     A                                      CHECK(LC)
     A            CAFNA2        12A  B 11 28DSPATR(CS)
     A                                      CHECK(LC)
     A            CALNA2        20A  B 11 41DSPATR(CS)
     A                                      CHECK(LC)
     A                                 12 15'#3:'
     A            CAPTT3         8A  B 12 19DSPATR(CS)
     A                                      CHECK(LC)
     A            CAFNA3        12A  B 12 28DSPATR(CS)
     A                                      CHECK(LC)
     A            CALNA3        20A  B 12 41DSPATR(CS)
     A                                      CHECK(LC)
     A                                 13  2'Buyer Info.'
     A                                      DSPATR(UL)
     A                                 13 15'Fresh Cut:'
     A            CAFBUY        30A  B 13 26DSPATR(CS)
     A                                 14 18'Supply:'
     A            CASBUY        30A  B 14 26DSPATR(CS)
     A                                 15 19'P.K.:'
     A            CAPBUY        30A  B 15 25DSPATR(CS)
     A                                 16 19'Other Key Personnel.'
     A                                      DSPATR(UL)
     A                                 16 51'Position'
     A                                      DSPATR(UL)
     A                                 17 15'#1:'
     A            CAOTP1        30A  B 17 19DSPATR(CS)
     A            CAOTT1        10A  B 17 51DSPATR(CS)
     A                                 18 15'#2:'
     A            CAOTP2        30A  B 18 19DSPATR(CS)
     A            CAOTT2        10A  B 18 51DSPATR(CS)
     A                                 19 15'#3:'
     A            CAOTP3        30A  B 19 19DSPATR(CS)
     A            CAOTT3        10A  B 19 51DSPATR(CS)
     A                                 20  5'WEB Page URL:'
     A            CAEWEB        50A  B 20 19DSPATR(CS)
     A                                 22  2'What type Certificate:'
     A            DPCERT         1A  B 22 25
     A  24                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  24                                  DSPATR(PC)
     A  24                                  ERRMSG('*** Invalid certificate typ-
     A                                      e. Must be A,C,T or X.  Press RESET-
     A                                      ')
     A                                 22 28'A=Ask First  C=Computer  T=Travel -
     A                                       X=Not Participate'
     A                                 23  2'                                  -
     A                                                F4=Update Info and Return-
     A                                       to Start'
     A                                      DSPATR(UL)
     A                                 24  2' Enter to Process      F6=Restart -
     A                                                F3/F7=End of Job (Data No-
     A                                      t Saved) '
     A                                      DSPATR(UL)
     A          R SCRNCB
     A*%%TS  SD  19990323  174014  EFD         REL-V3R7M0  5716-PW1
     A                                      CF06
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF03
     A                                      ALWROL
     A                                      INVITE
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                  1  2'ARR010CB'
     A                                  1 26' Customer Master Maintenance '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A            VMODE         10A  O  2 34DSPATR(RI)
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  4  2'Customer:'
     A            CMCUST         6Y 0O  4 13EDTCDE(Z)
     A            CMNAME        30A  O  4 22
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2' Enter to Process       F6=Restart-
     A                                                     F3/F7=End of Job    -
     A                                               '
     A                                      DSPATR(UL)
     A                                 10  2'Bloom Fresh?'
     A            USERF          5A  B 10 15
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A  10N11                               ERRMSG('*** Invalid User I.D.      -
     A                                                  Press RESET')
     A  10 11                               ERRMSG('*** User in wrong departmen-
     A                                      t.          Press RESET')
     A            CTIMF          4Y 0B 10 75DSPATR(CS)
     A                                      EDTWRD('  :  ')
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A  12                                  ERRMSG('*** Invalid time entered. M-
     A                                      ust be between 00:00 and 24:00   Pr-
     A                                      ess RESET')
     A                                  8 54'Mon   Wed   Fri'
     A                                  9 57'Tue   Thr   Sat'
     A            CFRF           1A  B 10 67DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CSAF           1A  B 10 70DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CWEF           1A  B 10 61DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CTHF           1A  B 10 64DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CMOF           1A  B 10 55DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CTUF           1A  B 10 58DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            USENMF        30A  O 10 21
     A                                 12  2'Scranton?'
     A            USERD          5A  B 12 15
     A  20                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  20                                  DSPATR(PC)
     A  20N21                               ERRMSG('*** Invalid User I.D.      -
     A                                                  Press RESET')
     A  20 21                               ERRMSG('*** User in wrong departmen-
     A                                      t.          Press RESET')
     A            USENMD        30A  O 12 21
     A            CMOD           1A  B 12 55DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CTUD           1A  B 12 58DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CWED           1A  B 12 61DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CTHD           1A  B 12 64DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CFRD           1A  B 12 67DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CSAD           1A  B 12 70DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CTIMD          4Y 0B 12 75DSPATR(CS)
     A                                      EDTWRD('  :  ')
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A  22                                  ERRMSG('*** Invalid time entered. M-
     A                                      ust be between 00:00 and 24:00   Pr-
     A                                      ess RESET')
     A                                  8 75'Call'
     A                                 14  2'L.V.?'
     A            USERL          5A  B 14 15
     A  30                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  30                                  DSPATR(PC)
     A  30N31                               ERRMSG('*** Invalid User I.D.      -
     A                                                  Press RESET')
     A  30 31                               ERRMSG('*** User in wrong departmen-
     A                                      t.          Press RESET')
     A            USENML        30A  O 14 21
     A            CMOL           1A  B 14 55DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CTUL           1A  B 14 58DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CWEL           1A  B 14 61DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CTHL           1A  B 14 64DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CFRL           1A  B 14 67DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CSAL           1A  B 14 70DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CTIML          4Y 0B 14 75DSPATR(CS)
     A                                      EDTWRD('  :  ')
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A  32                                  ERRMSG('*** Invalid time entered. M-
     A                                      ust be between 00:00 and 24:00   Pr-
     A                                      ess RESET')
     A                                 16  2'P.K.?'
     A            USERP          5A  B 16 15
     A  40                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  40                                  DSPATR(PC)
     A  40N41                               ERRMSG('*** Invalid User I.D.      -
     A                                                  Press RESET')
     A  40 41                               ERRMSG('*** User in wrong departmen-
     A                                      t.          Press RESET')
     A            USENMP        30A  O 16 21
     A            CMOP           1A  B 16 55DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CTUP           1A  B 16 58DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CWEP           1A  B 16 61DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CTHP           1A  B 16 64DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CFRP           1A  B 16 67DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CSAP           1A  B 16 70DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CTIMP          4Y 0B 16 75DSPATR(CS)
     A                                      EDTWRD('  :  ')
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A  42                                  ERRMSG('*** Invalid time entered. M-
     A                                      ust be between 00:00 and 24:00   Pr-
     A                                      ess RESET')
     A                                 18  2'Supply?'
     A            USERS          5A  B 18 15
     A  50                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  50                                  DSPATR(PC)
     A  50N51                               ERRMSG('*** Invalid User I.D.      -
     A                                                  Press RESET')
     A  50 51                               ERRMSG('*** User in wrong departmen-
     A                                      t.          Press RESET')
     A            USENMS        30A  O 18 21
     A            CMOS           1A  B 18 55DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CTUS           1A  B 18 58DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CWES           1A  B 18 61DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CTHS           1A  B 18 64DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CFRS           1A  B 18 67DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CSAS           1A  B 18 70DSPATR(CS)
     A                                      VALUES('X' ' ')
     A            CTIMS          4Y 0B 18 75DSPATR(CS)
     A                                      EDTWRD('  :  ')
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A  52                                  ERRMSG('*** Invalid time entered. M-
     A                                      ust be between 00:00 and 24:00   Pr-
     A                                      ess RESET')
     A                                  8 15'---User----'
     A                                  9 15'I.D.'
     A                                  9 21'Name'
     A                                  9 75'Time'
     A                                  6 52'Note: Put an X under'
     A                                  7 58'Day to call.'
     A                                 20 15' Verify Data if OK. Press Enter el-
     A                                      se make changes. '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
