     A*%%TS  SD  19990625  100156  TGMS        REL-V3R1M0  5763-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A          R SCRNA
     A*%%TS  SD  19990623  065555  TGMS        REL-V3R1M0  5763-PW1
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF03
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                  1 28' A/R Collection Follow Up '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A            BDATE          6Y 0B  7 49EDTCDE(Y)
     A                                      DSPATR(CS)
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A  22                                  ERRMSG('*** Enter A Valid Date.    -
     A                                           Press Reset')
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'            Enter to Process      -
     A                                            F3/F7=End of Job             -
     A                                               '
     A                                      DSPATR(UL)
     A            PROGID        10A  O  1  2
     A                                  2 33'For Company:'
     A            LCO            2S 0O  2 46DSPATR(HI)
     A                                  6 28'Display Follow Up'
     A                                  7 28'For Date Range:'
     A            EDATE          6Y 0B  7 62EDTCDE(Y)
     A                                      DSPATR(CS)
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A  22                                  ERRMSG('*** Enter A Valid Date.    -
     A                                           Press Reset')
     A                                  7 59'-'
     A          R RECSFL                    SFL
     A*%%TS  SD  19990625  100156  TGMS        REL-V3R1M0  5763-PW1
     A            ACCUST         6Y 0O  8  5DSPATR(HI)
     A                                      EDTCDE(Z)
     A            ACCMNT        56   O  8 13DSPATR(HI)
     A            FUDATE         6Y 0O  8 71EDTCDE(Y)
     A                                      DSPATR(HI)
     A            FLD001         1A  B  8  2DSPATR(CS)
     A          R RECCTL                    SFLCTL(RECSFL)
     A*%%TS  SD  19990623  065555  TGMS        REL-V3R1M0  5763-PW1
     A  *DS3                                SFLSIZ(0200)
     A  *DS4                                SFLSIZ(0020)
     A  *DS3                                SFLPAG(0016)
     A  *DS4                                SFLPAG(0001)
     A                                      CF01
     A                                      CF03
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CF09
     A                                      CF10
     A                                      CF12
     A N80                                  SFLDSP
     A N80                                  SFLDSPCTL
     A  80                                  SFLCLR
     A                                  1 13' Roll             F6=Restart      -
     A                                          F3/F7=End of Job '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  3  3'Company:'
     A            LCO            2S 0O  3 12DSPATR(HI)
     A            BDATE          6Y 0O  3 40EDTCDE(Y)
     A                                      DSPATR(HI)
     A                                  6  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                  7  2'X    Cust            Comments     -
     A                                                                        F-
     A                                      ollow Up '
     A                                      DSPATR(UL)
     A                                  3 24'For Date Range:'
     A                                  3 49'-'
     A                                      DSPATR(HI)
     A            EDATE          6Y 0O  3 51EDTCDE(Y)
     A                                      DSPATR(HI)
     A                                  5 12' Place an X next to customer to go-
     A                                       to a/r balance inquiry '
     A                                      COLOR(YLW)
