     A*%%TS  SD  20061009  125614  BILLB       REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      INDARA
     A                                      VLDCMDKEY(48 'Valid Function Key Pr-
     A                                      essed')
     A          R ATT05101                  SFL
     A*%%TS  SD  20061009  120846  BILLB       REL-V5R3M0  5722-WDS
     A  28                                  SFLNXTCHG
     A            IN81           1A  H
     A            IN82           1A  H
     A            ATTIME    R        H      REFFLD(RMATTEND/ATTIME *LIBL/FMATTE-
     A                                      ND)
     A            OPTION         1A  B  9 13DSPATR(PC)
     A            LCCLAS    R        O  9 19REFFLD(RMEMPCLS/LCCLAS *LIBL/FMEMPC-
     A                                      LS)
     A            LCSHRT    R        O  9 26REFFLD(RMEMPCLS/LCSHRT *LIBL/FMEMPC-
     A                                      LS)
     A            LCDESC    R        O  9 39REFFLD(RMEMPCLS/LCDESC *LIBL/FMEMPC-
     A                                      LS)
     A          R ATT05101C                 SFLCTL(ATT05101)
     A*%%TS  SD  20061009  125614  BILLB       REL-V5R3M0  5722-WDS
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0010)
     A                                      CF03(03 'Exit')
     A                                      CF07(07 'Quit')
     A                                      CF05(05 'Refresh')
     A                                      KEEP
     A                                      OVERLAY
     A                                      SFLCSRRRN(&SFLCSRRRN)
     A  25 26                               SFLDSP
     A  25                                  SFLDSPCTL
     A N25                                  SFLCLR
     A N27                                  SFLEND(*SCRBAR *SCRBAR)
     A                                      SFLDROP(CF11)
     A            STARTRRN01     4S 0H      SFLRCDNBR
     A            SFLCSRRRN      5S 0H
     A                                  3 12SYSNAME
     A                                      COLOR(BLU)
     A                                  4 12USER
     A                                      COLOR(BLU)
     A                                  3 29'   Labor Class Master   '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  5 12'Type options, press Enter.'
     A                                      COLOR(BLU)
     A N60                              4 12'2=Edit'
     A                                      COLOR(BLU)
     A                                  8 12'Opt'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A  60                              6 12'1=Select'
     A                                      COLOR(BLU)
     A                                  3 61DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  4 61TIME
     A                                      COLOR(BLU)
     A                                  8 17'Class'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  8 26'Class Descriptions                -
     A                                               '
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A N60                              6 12'2=Edit'
     A                                      COLOR(BLU)
     A          R ATT05101F
     A*%%TS  SD  20061006  152403  BILLB       REL-V5R3M0  5722-WDS
     A                                      OVERLAY
     A                                 21 12'Enter'
     A                                      DSPATR(HI)
     A                                 21 18'=Continue'
     A                                      COLOR(BLU)
     A                                 21 37'F05'
     A                                      DSPATR(HI)
     A                                 21 41'=Refresh'
     A                                      COLOR(BLU)
     A                                 21 60'F03'
     A                                      DSPATR(HI)
     A                                 21 64'=Exit'
     A                                      COLOR(BLU)
     A                                 20 12'                                  -
     A                                                    ATT05101 '
     A                                      DSPATR(UL)
     A                                      COLOR(BLU)
     A          R MSGDATA                   SFL
     A*%%TS  SD  20040319  114608  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages')
     A                                      SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            PGMQ                      SFLPGMQ
     A          R MSGCTL                    SFLCTL(MSGDATA)
     A*%%TS  SD  20040319  114608  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages')
     A                                      OVERLAY
     A N92                                  SFLDSP
     A N92                                  SFLDSPCTL
     A N92                                  SFLINZ
     A N92                                  SFLEND
     A                                      SFLSIZ(0002)
     A                                      SFLPAG(0001)
     A            PGMQ                      SFLPGMQ
     A          R ASSUME
     A*%%TS  SD  20040621  100219  BILLB       REL-V5R1M0  5722-WDS
     A                                      ASSUME
     A                                  1  3' '
