     A*%%TS  SD  19980116  193851  EFD         REL-V3R6M0  5716-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      USRDSPMGT
     A          R SCRNA
     A*%%TS  SD  19980116  193851  EFD         REL-V3R6M0  5716-PW1
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      CF03
     A                                      HOME
     A                                      HELP
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                  1 32' Order Proof List '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  4 26'Transaction Date:'
     A            VDATE          6Y 0B  4 46EDTCDE(Y)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A  10                                  ERRMSG('*** Enter A Valid Date.    -
     A                                       Press Reset')
     A                                  6 26'Ship From?'
     A            VSHFR          3A  B  6 46DSPATR(CS)
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A  62                                  ERRMSG('*** Enter A Valid Ship From-
     A                                       Location.     Press Reset')
     A                                  8 26'Range of Orders:'
     A            VBORD          6Y 0B  8 46DSPATR(CS)
     A                                      EDTCDE(Z)
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A  16                                  ERRMSG('*** Enter Both Order Number-
     A                                      s - From # Must Be Lower Than To #.-
     A                                        Press Reset')
     A                                      CHECK(RB)
     A                                  8 53'-'
     A            VEORD          6Y 0B  8 55DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A                                 10  2'Include Only Orders'
     A                                 10 22'Changed Since Last Report:'
     A            VCHG           1A  B 10 51
     A  20                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  20                                  DSPATR(PC)
     A  20                                  ERRMSG('*** Valid Entries Are Y or -
     A                                      N.    Press Reset')
     A                                 13 26'Forms Number:'
     A            VFORM          4A  B 13 50DSPATR(CS)
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A  14                                  ERRMSG('*** Forms Number Is Require-
     A                                      d.     Press Reset')
     A                                 14 26'Number of Copies:'
     A            VCOPY          2Y 0B 14 52EDTCDE(3)
     A  15                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  15                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A  15                                  ERRMSG('*** Number of Copies is Req-
     A                                      uired.    Press Reset')
     A                                 15 26'Printer ID:'
     A            VPRTR         10A  B 15 44DSPATR(CS)
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A  52                                  ERRMSG('*** Printer ID Is Required.-
     A                                           Press Reset')
     A                                 16 26'Print Status:'
     A            VOUT           1Y 0B 16 53EDTCDE(3)
     A  54                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  54                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A  54                                  ERRMSG('*** Valid Entries Are 1, 2 -
     A                                      or 3.    Press Reset')
     A                                 16 56'1 = Print'
     A                                 17 56'2 = Print/Save'
     A                                 18 56'3 = Hold'
     A                                 21  5'* Leave range of orders blank to p-
     A                                      rint all orders for transaction dat-
     A                                      e.'
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'   Enter to Process         F3/F7=-
     A                                      Cancel Job                         -
     A                                               '
     A                                      DSPATR(UL)
     A            PROGID        10A  O  1  2
