     A*%%TS  SD  19991102  075615  TGMS        REL-V4R2M0  5769-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      USRDSPMGT
     A          R SCRNA
     A*%%TS  SD  19991002  175406  TGMS        REL-V4R2M0  5769-PW1
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF03
     A                                      CF06
     A                                      INVITE
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                  1  2'BIC330A'
     A                                  1 33' Invoice Print '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  4 28'Do You Want To'
     A            LDARPT         1A  B  4 49
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A  10                                  ERRMSG('*** Valid Entries Are Y or -
     A                                      N.         Press Reset')
     A                                  5 28'Reprint Invoices:'
     A                                  7  6'Reprint Range:'
     A  09                                  DSPATR(ND)
     A                                  7 28'From Invoice Number:'
     A  09                                  DSPATR(ND)
     A            LBINV          6Y 0B  7 51
     A  20                                  DSPATR(RI)
     A N09                                  DSPATR(CS)
     A  09                                  DSPATR(ND)
     A  20                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  20                                  ERRMSG('*** Enter A Valid Invoice N-
     A                                      umber Equal or Lower Than To.   Pre-
     A                                      ss Reset')
     A                                  8 28'To Invoice Number:'
     A  09                                  DSPATR(ND)
     A            LEINV          6Y 0B  8 51
     A  16                                  DSPATR(RI)
     A N09                                  DSPATR(CS)
     A  09                                  DSPATR(ND)
     A  16                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  09                                  DSPATR(PR)
     A  16                                  ERRMSG('*** To Invoice Number is Re-
     A                                      quired.    Press Reset')
     A                                 12 28'Printer ID:'
     A  09                                  DSPATR(ND)
     A            LPRTR         10A  B 12 48
     A N09                                  DSPATR(CS)
     A  50N09                               DSPATR(RI)
     A  50                                  DSPATR(PC)
     A  50                                  ERRMSG('*** Printer ID Is Required.-
     A                                           Press Reset')
     A  09                                  DSPATR(ND)
     A                                 13 28'Forms Number:'
     A  09                                  DSPATR(ND)
     A            LFORM         10A  B 13 48
     A N09                                  DSPATR(CS)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A  51                                  ERRMSG('*** Forms Number Is Require-
     A                                      d.    Press Reset')
     A  09                                  DSPATR(ND)
     A                                 14 28'Number of Copies:'
     A  09                                  DSPATR(ND)
     A            LCOPY          2Y 0B 14 56
     A  52                                  DSPATR(RI)
     A N09                                  DSPATR(CS)
     A  52                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A  52                                  ERRMSG('*** Number of Copies Is Req-
     A                                      uired.    Press Reset')
     A  09                                  DSPATR(ND)
     A                                 15 28'Run From JobQ:'
     A  09                                  DSPATR(ND)
     A            LJOBQ          1A  B 15 57
     A N09                                  DSPATR(CS)
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A  53                                  ERRMSG('*** Valid Entries Are Y or -
     A                                      N.     Press Reset')
     A  09                                  DSPATR(ND)
     A                                 16 28'Print Status:'
     A  09                                  DSPATR(ND)
     A            VOUT           1Y 0B 16 57
     A  54                                  DSPATR(RI)
     A N09                                  DSPATR(CS)
     A  54                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A  54                                  ERRMSG('*** Valid Entries Are 1, 2 -
     A                                      or 3.    Press Reset')
     A  09                                  DSPATR(ND)
     A                                 16 61'1 = Print'
     A  09                                  DSPATR(ND)
     A                                 17 61'2 = Print/Save'
     A  09                                  DSPATR(ND)
     A                                 18 61'3 = Hold'
     A  09                                  DSPATR(ND)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'          Enter to Process        -
     A                                      F6=Restart       F3/F7=Cancel Job  -
     A                                               '
     A                                      DSPATR(UL)
     A          R SCRNB
     A*%%TS  SD  19991102  075615  TGMS        REL-V4R2M0  5769-PW1
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      CF03
     A                                      HOME
     A                                      HELP
     A                                      CF06
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                  1  2'BIC330B'
     A                                  1 33' Invoice Print '
     A                                      DSPATR(RI)
     A                                  1 66'Date:'
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 33'For Company:'
     A            LCO            2S 0O  2 46DSPATR(HI)
     A                                  2 66'Time:'
     A                                  2 72TIME
     A                                  4 25'Invoice Date:'
     A            LDATE          6Y 0B  4 46DSPATR(CS)
     A                                      EDTCDE(Y)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A  11                                  ERRMSG('*** Enter A Valid Date.    -
     A                                       Press Reset')
     A  12                                  ERRMSG('*** Date Is Prior To Beginn-
     A                                      ing Of Fiscal Year.    Press Reset')
     A  13                                  ERRMSG('*** Date Is After End Of Fi-
     A                                      scal Year, Change or Press Reset to-
     A                                       Accept.')
     A                                  6  4'Print Invoices For:'
     A                                  7 25'Ship From Location?'
     A            LBSHFR         3A  B  7 46DSPATR(CS)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A  20                                  ERRMSG('*** Enter A Valid Ship From-
     A                                      .     Press Reset')
     A            VDESC         30A  O  7 51
     A                                  9 25'Range of Orders:'
     A            LBORD          6Y 0B  9 46DSPATR(CS)
     A                                      EDTCDE(Z)
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                      CHECK(RB)
     A  30                                  ERRMSG('*** From Order Number Must -
     A                                      Be Equal or Lower Than To.    Press-
     A                                       Reset')
     A                                  9 53'-'
     A            LEORD          6Y 0B  9 55DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A                                 11 25'Routes?'
     A            LBRTE          2A  B 11 46DSPATR(CS)
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A  40                                  ERRMSG('*** Enter A Valid Route Equ-
     A                                      al or Lower Than To Route.    Press-
     A                                       Reset')
     A                                 11 49'-'
     A            LERTE          2A  B 11 51DSPATR(CS)
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A  45                                  ERRMSG('*** Enter A Valid Route.   -
     A                                        Press Reset')
     A                                 14 25'Printer ID:'
     A            LPRTR         10A  B 14 45DSPATR(CS)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A  50                                  ERRMSG('*** Printer ID Is Required.-
     A                                           Press Reset')
     A                                 15 25'Forms Number:'
     A            LFORM         10A  B 15 45DSPATR(CS)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A  51                                  ERRMSG('*** Forms Number Is Require-
     A                                      d.    Press Reset')
     A                                 16 25'Number of Copies:'
     A            LCOPY          2Y 0B 16 53
     A  52                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  52                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A  52                                  ERRMSG('*** Number of Copies Is Req-
     A                                      uired.    Press Reset')
     A                                 17 25'Run From JobQ:'
     A            LJOBQ          1A  B 17 54DSPATR(CS)
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A  53                                  ERRMSG('*** Valid Entries Are Y or -
     A                                      N.     Press Reset')
     A                                 18 25'Print Status:'
     A            VOUT           1Y 0B 18 54
     A  54                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  54                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A  54                                  ERRMSG('*** Valid Entries Are 1, 2 -
     A                                      or 3.    Press Reset')
     A                                 18 58'1 = Print'
     A                                 19 58'2 = Print/Save'
     A                                 20 58'3 = Hold'
     A                                 21 16' Validate Data - Change or Press E-
     A                                      nter to Accept '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'  Enter to Process           F6=Re-
     A                                      start            F3/F7=Cancel Job  -
     A                                               '
     A                                      DSPATR(UL)
