     A*%%TS  SD  19970325  185846  EFD         REL-V3R1M0  5763-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      USRDSPMGT
     A          R SCRNA
     A*%%TS  SD  19970325  185846  EFD         REL-V3R1M0  5763-PW1
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      CF03
     A                                      HOME
     A                                      HELP
     A                                      CF13
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                  1  2'BIR021A'
     A                                  1 66'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 66'Time:'
     A                                  2 73TIME
     A                                  5  2'Action:'
     A            VACT           1A  B  5 10DSPATR(CS)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A  10                                  ERRMSG('*** Enter A Valid Action Co-
     A                                      de.     Press Reset')
     A  21                                  ERRMSG('*** This Contract Is On Fil-
     A                                      e.      Press Reset')
     A  22                                  ERRMSG('*** This Contract Is Not On-
     A                                       File.    Press Reset')
     A                                  7  1' A = Add    '
     A                                      DSPATR(RI)
     A                                  8  1' C = Change '
     A                                      DSPATR(RI)
     A                                  9  1' D = Delete '
     A                                      DSPATR(RI)
     A                                  5 27'Broker I.D.:'
     A            VBROK         10A  B  5 40DSPATR(CS)
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A  15 16                               ERRMSG('*** Broker Does NOT Exist. -
     A                                                  Press Reset')
     A  15N16                               ERRMSG('*** Broker Already Exists i-
     A                                      n File.     Press Reset')
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'    Enter to Process    F3/F7=End -
     A                                      of Job    F13=Print Broker Master L-
     A                                      ist      '
     A                                      DSPATR(UL)
     A                                  1 27' Broker Master File Update '
     A                                      DSPATR(RI)
     A          R SCRNB
     A*%%TS  SD  19970325  185846  EFD         REL-V3R1M0  5763-PW1
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      CF03
     A                                      HOME
     A                                      HELP
     A                                      CF06
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                  1  2'BIR021B'
     A                                  1 66'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 66'Time:'
     A                                  2 73TIME
     A                                 10 27'Customer Number:'
     A            VCUST          6Y 0B 10 47
     A  11                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  11                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  12                                  ERRMSG('*** Enter A Customer Number-
     A                                       or Alpha Search.     Press Reset')
     A  13                                  ERRMSG('*** Enter A Valid Customer -
     A                                      Number.     Press Reset')
     A                                 11 27'Alpha Search'
     A            VALPHA        15A  B 11 47DSPATR(CS)
     A                                 12 27'Telephone # Search'
     A            VTELE         10A  B 12 47DSPATR(CS)
     A            CMNAME        30A  O 13 47
     A                                  6 27'Broker I.D.:'
     A            VBROK         10A  B  6 40DSPATR(UL)
     A                                      DSPATR(PR)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'    Enter to Process         F6=Re-
     A                                      start(NO Update)           F3/F7=En-
     A                                      d of Job '
     A                                      DSPATR(UL)
     A                                  1 27' Broker Master File Update '
     A                                      DSPATR(RI)
