     A*%%TS  SD  20030827  130940  EFD         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  20011107  140940  EFD         REL-V5R1M0  5722-WDS
     A                                  1  2'CUR340A'
     A                                  2  2USER
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  1 25' Cutting Requirements Transfer '
     A                                      DSPATR(RI)
     A                                 24 21'Enter to Process           F3/F7=C-
     A                                      ancel'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                 23 21'                                  -
     A                                           '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  6 21' There are no Open Orders at this -
     A                                      time. '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                 10 22'Order Number:'
     A            ORDNO          6Y 0B 10 44
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A  10                                  ERRMSG('*** There is no open order -
     A                                      with this number.     Press RESET')
     A                                  7 17'Next Order to be Transfered:'
     A            NXTORD         6Y 0O  7 46DSPATR(HI)
     A                                      EDTCDE(4)
     A                                  5  6' There are no orders to transfer. -
     A                                      Enter a number to re-transfer Order-
     A                                      .'
     A  22                                  DSPATR(RI)
     A N22                                  DSPATR(ND)
