     A*%%TS  SD  20091124  123106  BILLB       REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  20091124  123106  BILLB       REL-V5R3M0  5722-WDS
     A                                      CF04
     A                                  1  2'CUR330A'
     A                                  2  2USER
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  1 29' Re-print Cutting Order '
     A                                      DSPATR(RI)
     A                                 24 21'Enter to Process           F3/F7=C-
     A                                      ancel'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                 23 21'                                  -
     A                                           '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                 10 22'Order Number:'
     A            ORDNO          6Y 0B 10 44
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A  10                                  ERRMSG('*** There is no open order -
     A                                      with this number.     Press RESET')
     A                                  2 17'Vendor:'
     A                                      DSPATR(HI)
     A            VMVEND         6S 0O  2 26COLOR(BLU)
     A            VMNAME        30A  O  2 34COLOR(PNK)
     A                                 10 56'F4'
     A                                      DSPATR(HI)
     A                                 10 59'=Find Order'
     A                                      COLOR(BLU)
