     A*%%TS  SD  20050926  132504  BILLB       REL-V5R3M0  5722-WDS
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R SCRNA
     A*%%TS  SD  20050926  132504  BILLB       REL-V5R3M0  5722-WDS
     A                                      CF03
     A                                      CF06
     A                                      CF07
     A                                      SLNO(01)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                 14 23'Printer ID:'
     A            LPRTR         10A  B 14 44
     A  50                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  50                                  DSPATR(PC)
     A  50                                  ERRMSG('*** Printer ID Is Required.-
     A                                          Press Reset')
     A                                 15 23'Forms Number:'
     A            LFORM         10A  B 15 44DSPATR(CS)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A  51                                  ERRMSG('*** Entry Is Required.     -
     A                                              Press Reset')
     A                                 16 23'Number of Copies:'
     A            LCOPY          2Y 0B 16 52
     A  52                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  52                                  DSPATR(PC)
     A                                      EDTCDE(3)
     A  52                                  ERRMSG('*** Number Of Copies Is Req-
     A                                      uired.     Press Reset')
     A                                 17 23'Run From JobQ:'
     A            LJOBQ          1X  B 17 53DSPATR(CS)
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A  53                                  ERRMSG('*** Valid Entries Are Y or -
     A                                      N.        Press Reset')
     A                                 18 23'Print Status:'
     A            VOUT           1Y 0B 18 53EDTCDE(3)
     A  54                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  54                                  DSPATR(PC)
     A  54                                  ERRMSG('*** Valid Entries Are 1, 2 -
     A                                      or 3.       Press Reset')
     A                                 18 58'1 = Print'
     A                                 19 58'2 = Print/Save'
     A                                 20 58'3 = Hold'
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'                  Enter to Process-
     A                                               F3/F7=Cancel Job          -
     A                                               '
     A                                      DSPATR(UL)
     A                                  1  2'CUC650A'
     A            BEGDAT         6Y 0B  8 42
     A  30                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  30                                  DSPATR(PC)
     A                                      EDTWRD('  /  /  ')
     A  30N31                               ERRMSG('*** Invalid Date Entered.  -
     A                                             Press RESET')
     A  31                                  ERRMSG('*** Sow Date Must Be a Mond-
     A                                      ay.    Press RESET')
     A                                  5 15' Verify Data if OK, Press ENTER. E-
     A                                      lse Make Changes. '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                  8 23'Begining Date:'
     A                                 10 23'Ending Date:'
     A            ENDDAT         6Y 0B 10 42
     A  40                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  40                                  DSPATR(PC)
     A                                      EDTWRD('  /  /  ')
     A  40N41                               ERRMSG('*** Invalid Date Entered.  -
     A                                             Press RESET')
     A  41                                  ERRMSG('*** Sow Date Must Be a Mond-
     A                                      ay.    Press RESET')
     A                                 12 19' End Date can not be less than Beg-
     A                                      in date. '
     A  39                                  DSPATR(RI)
     A N39                                  DSPATR(ND)
CAB  A***                               1 22' 84 Tray Order Changes Report Prom-
     A                                  1 22' 105 Tray Order Changes Report Pro-
     A                                      mpt '
     A                                      DSPATR(RI)
     A                                  8 52'To only get one date only'
     A                                  9 52'enter begining date.'
     A                                  2 17'Vendor:'
     A                                      DSPATR(HI)
     A            VMVEND         6  0O  2 26COLOR(BLU)
     A            VMNAME        30   O  2 34COLOR(PNK)
