     A*%%TS  SD  19981117  203227  EFD         REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  19981117  203227  EFD         REL-V3R7M0  5716-PW1
     A                                  1  2'DIL01AA'
     A                                  2  2USER
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  1 27' Change Force Allocate Flag '
     A                                      DSPATR(RI)
     A            DEDESC        30A  O  2 27DSPATR(HI)
     A                                  9 16'Cycle Count Code:'
     A            CYCLCD         2A  B  9 37DSPATR(CS)
     A                                 23  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 24  2'                Enter to Process  -
     A                                            F3/F7=Cancel Procedure       -
     A                                               '
     A                                      DSPATR(UL)
     A                                 21 19'If it is correct - Press Enter to -
     A                                      continue.'
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                 22 14' If it is not correct - Make chang-
     A                                      es and Press Enter.'
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                 11 22'List Code:'
     A            LISTCD         4A  B 11 37DSPATR(CS)
     A                                 20 26' Verify Your Selection Above.'
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                  2 22'For:'
     A                                 13 16'Product Class 1?'
     A                                 15 16'Product Class 3?'
     A            PC1            2A  B 13 37
     A  30                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  30                                  DSPATR(PC)
     A  30                                  ERRMSG('*** Invalid Product Class 1-
     A                                       Entered.   Press RESET')
     A            PC3            2A  B 15 37
     A  40                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  40                                  DSPATR(PC)
     A  40                                  ERRMSG('*** Invalid Product Class 3-
     A                                       Entered.   Press RESET')
     A                                 11 42'NOTE: Enter Leading Zero i.e. 0400'
     A                                  4 17'New Force Flag:'
     A            NEWFRC         1A  B  4 37
     A  25                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  25                                  DSPATR(PC)
     A  25                                  ERRMSG('*** Force Allocation must b-
     A                                      e Y or N.   Press RESET')
     A                                  4 42'Y = Force Allocate All Orders.'
     A                                  5 42'N = Allocate by Allocation Date'
     A                                 17 19'Alpha Search:'
     A            ALPHA         15   B 17 37DSPATR(CS)
     A                                 17 53'NOTE: Branches do not forget'
     A                                 18 59'to include F etc.'
     A                                  7  3'The following Selections are limit-
     A                                      s to get all items leave selection(-
     A                                      s) blank.'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A          R SCRNE
     A*%%TS  SD  19981117  192824  EFD         REL-V3R7M0  5716-PW1
     A                                  1  2'DIL01AE'
     A                                  2  2USER
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  1 27' Change Force Allocate Flag '
     A                                      DSPATR(RI)
     A            DEDESC        30A  O  3 25
     A                                  8 24'You Can NOT Run any This proceduer'
     A                                      DSPATR(RI)
     A                                 12 24' Press Enter to Cancel Procedure. '
     A                                      DSPATR(RI)
     A                                  9 25'without a valid department code.'
     A                                      DSPATR(RI)
