     A*%%TS  SD  19971219  144355  EFD         REL-V3R6M0  5716-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A          R SCRNA
     A*%%TS  SD  19971219  112935  EFD         REL-V3R6M0  5716-PW1
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF03
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A          H                           HLPRCD(HALL)
     A  *DS3                                HLPARA(03 002 12 066)
     A  *DS4                                HLPARA(03 002 03 005)
     A            PROGID        10A  O  1  2
     A                                  1 24' Invoice Line Items By Price Code '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  5 29'Price Code?'
     A            VPRCDE         2A  B  5 46
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A  12                                  ERRMSG('*** Enter A Valid Price Cod-
     A                                      e.     Press Reset')
     A  11                                  ERRMSG('*** No Records For This Pri-
     A                                      ce Code.   Press Reset')
     A                                  7 29'For Ship Date:'
     A            VSHDAT         6Y 0B  7 46EDTCDE(Y)
     A                                      DSPATR(CS)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A  20                                  ERRMSG('*** Enter A Valid Date.    -
     A                                         Press Reset')
     A                                  9 29'Ship From:'
     A            VSHFR          3A  B  9 46DSPATR(CS)
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A  30                                  ERRMSG('*** Enter A Valid Departmen-
     A                                      t.     Press Reset')
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'       Enter to Process           -
     A                                          F3/F7=End of Job               -
     A                                               '
     A                                      DSPATR(UL)
     A          R RECSFL                    SFL
     A*%%TS  SD  19971219  093149  EFD         REL-V3R6M0  5716-PW1
     A            WIINV#         6Y 0O  6  2EDTCDE(Z)
     A            WIITEM        12   O  6  9
     A            WICUST         6Y 0O  6 26EDTCDE(Z)
     A            CMNAME        30   O  6 33
     A            QTY            5Y 0O  6 64EDTCDE(Z)
     A            UPRICE         7Y 2O  6 70EDTCDE(L)
     A            WISIZE         3   O  6 22
     A          R RECCTL                    SFLCTL(RECSFL)
     A*%%TS  SD  19971219  144355  EFD         REL-V3R6M0  5716-PW1
     A  *DS3                                SFLSIZ(0020)
     A  *DS4                                SFLSIZ(0020)
     A  *DS3                                SFLPAG(0019)
     A  *DS4                                SFLPAG(0018)
     A                                      CF03
     A                                      CF06
     A                                      CF07
     A N80                                  SFLDSP
     A N80                                  SFLDSPCTL
     A  80                                  SFLCLR
     A                                  1 13' Roll Forward/Backward   F6=Restar-
     A                                      t   F3/F7=End of Job '
     A                                      DSPATR(RI)
     A                                  1  3'DIL265'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A            VSHFR          3A  O  3 63
     A                                  5  2' Inv # Item        Size Customer  -
     A                                                                    Qty  -
     A                                        Price  '
     A                                      DSPATR(UL)
     A                                  3 52'Ship From:'
     A                                  3  3'Price Code:'
     A            VPRCDE         2A  O  3 15
     A            QCDESC        30A  O  3 18
     A                                  4 74'Unit'
