     A*%%TS  SD  19990701  170245  EFD         REL-V3R7M0  5716-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A          R SCRNA
     A*%%TS  SD  19990701  170245  EFD         REL-V3R7M0  5716-PW1
     A                                      CF03
     A                                      CF07
     A                                      CF02
     A  79                                  CF10
     A  79                                  CF12
     A                                      CF05
     A                                      INZRCD
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A            PROGID        10A  O  1  2
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A            FRMDAT         6Y 0O  4 29EDTCDE(Y)
     A            TODAT          6Y 0O  4 48EDTWRD('  /  /  ')
     A                                  6  2'Bloomsburg..........'
     A            BCURYR        11Y 2O  6 23EDTCDE(K)
     A            BLASYR        11Y 2O  6 42EDTCDE(K)
     A                                  8  2'Scranton............'
     A            DCURYR        11Y 2O  8 23EDTCDE(K)
     A            DLASYR        11Y 2O  8 42EDTCDE(K)
     A                                 10  2'Lehigh Valley.......'
     A            LCURYR        11Y 2O 10 23EDTCDE(K)
     A            LLASYR        11Y 2O 10 42EDTCDE(K)
     A                                 12  2'Plant Kingdom.......'
     A            PCURYR        11Y 2O 12 23EDTCDE(K)
     A            PLASYR        11Y 2O 12 42EDTCDE(K)
     A                                 14  2'Green House.........'
     A            GCURYR        11Y 2O 14 23EDTCDE(K)
     A            GLASYR        11Y 2O 14 42EDTCDE(K)
     A                                 18  2'Supply Department...'
     A            SCURYR        11Y 2O 18 23EDTCDE(K)
     A            SLASYR        11Y 2O 18 42EDTCDE(K)
     A                                 19 23'---------------'
     A                                 19 42'---------------'
     A                                 20  2'Total Sales.........'
     A            TOTCUR        11Y 2O 20 23EDTCDE(K)
     A            TOTLST        11Y 2O 20 42EDTCDE(K)
     A                                 22  2'   F10=Month to Date Totals       -
     A                                                        F12=Year to Date -
     A                                      Totals   '
     A  79                                  DSPATR(UL)
     A N79                                  DSPATR(ND)
     A  79                                  DSPATR(HI)
     A                                 23  2'   Enter to Return            F2=S-
     A                                      elect New Date       F5=Refresh Tot-
     A                                      als      '
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A            FLD001         1A  B  4  2DSPATR(ND)
     A                                  4 62'Variance'
     A            BDIFF          8Y 2O  6 59EDTCDE(K)
     A            DDIFF          8Y 2O  8 59EDTCDE(K)
     A            LDIFF          8Y 2O 10 59EDTCDE(K)
     A            PDIFF          8Y 2O 12 59EDTCDE(K)
     A            GDIFF          8Y 2O 14 59EDTCDE(K)
     A            SDIFF          8Y 2O 18 59EDTCDE(K)
     A                                 19 59'-----------'
     A            TOTDIF         8Y 2O 20 59EDTCDE(K)
     A            BPCT           6Y 2O  6 72EDTCDE(K)
     A                                  4 76'%'
     A            DPCT           6Y 2O  8 72EDTCDE(K)
     A            LPCT           6Y 2O 10 72EDTCDE(K)
     A            PPCT           6Y 2O 12 72EDTCDE(K)
     A            GPCT           6Y 2O 14 72EDTCDE(K)
     A            SPCT           6Y 2O 18 72EDTCDE(K)
     A            TOTPCT         6Y 2O 20 72EDTCDE(K)
     A                                 16  2'Office..............'
     A            OCURYR        11Y 2O 16 23EDTCDE(K)
     A            OLASYR        11Y 2O 16 42EDTCDE(K)
     A            ODIFF          8Y 2O 16 59EDTCDE(K)
     A            OPCT           6Y 2O 16 72EDTCDE(K)
     A            HEAD          30A  O  1 26DSPATR(RI)
     A            DATEH         27A  O  3 29DSPATR(HI)
     A          R SCRNB
     A*%%TS  SD  19990609  171200  EFD         REL-V3R7M0  5716-PW1
     A                                      CF03
     A                                      CF07
     A                                      CF10
     A                                      CF12
     A                                      INZRCD
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A            PROGID        10A  O  1  2
     A                                  1 27' Current Day Sales By Branch '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'                 Enter to Process -
     A                                           F3/F7=End of Job              -
     A                                               '
     A                                      DSPATR(UL)
     A                                  7 27'Date to Display:'
     A            VDATE          6Y 0B  7 45
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A                                      EDTCDE(Y)
     A  10                                  ERRMSG('*** Enter A Valid Date.    -
     A                                        Press Reset')
