     A*%%TS  SD  19990511  160402  EFD         REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF06
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  19990511  143359  EFD         REL-V3R7M0  5716-PW1
     A                                  1  2'DPC040A'
     A                                  2  2USER
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  1 21' Maintain Purchase Report Comments-
     A                                       File '
     A                                      DSPATR(RI)
     A                                 24  2'  Enter to Process             F6=-
     A                                      Restart                    F3/F7=En-
     A                                      d Job  '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                 23  2'                                  -
     A                                                                         -
     A                                             '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A            DCLN01        75A  B  3  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN02        75A  B  4  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN03        75A  B  5  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN04        75A  B  6  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN05        75A  B  7  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN06        75A  B  8  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN07        75A  B  9  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN08        75A  B 10  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN09        75A  B 11  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN10        75A  B 12  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN11        75A  B 13  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN12        75A  B 14  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN13        75A  B 15  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN14        75A  B 16  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN15        75A  B 17  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN16        75A  B 18  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN17        75A  B 19  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN18        75A  B 20  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN19        75A  B 21  4DSPATR(CS)
     A                                      CHECK(LC)
     A            DCLN20        75A  B 22  4DSPATR(CS)
     A                                      CHECK(LC)
     A          R SCRNB
     A*%%TS  SD  19990511  160402  EFD         REL-V3R7M0  5716-PW1
     A                                  1  2'DPC040B'
     A                                  2  2USER
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  1 21' Maintain Purchase Report Comments-
     A                                       File '
     A                                      DSPATR(RI)
     A                                 24  2'  Enter to Process             F6=-
     A                                      Restart                    F3/F7=En-
     A                                      d Job  '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                 23  2'                                  -
     A                                                                         -
     A                                             '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  7  2'Do You want Customer Info to print-
     A                                       and be verified?'
     A            DCCKIN         1A  B  7 54
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A  10                                  ERRMSG('*** Valid entries are Y or -
     A                                      N.  Press RESET')
     A                                 10  2'Message for check Info:'
     A            DCCK01        75A  B 12  2DSPATR(CS)
     A                                      CHECK(LC)
     A            DCCK02        75A  B 13  2DSPATR(CS)
     A                                      CHECK(LC)
     A            DCCK03        75A  B 14  2DSPATR(CS)
     A                                      CHECK(LC)
     A            DCCK04        75A  B 15  2DSPATR(CS)
     A                                      CHECK(LC)
     A                                 18  2'Print Sample report?'
     A            TESTP          1   B 18 23
     A  20                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  20                                  DSPATR(PC)
     A  20                                  ERRMSG('*** Print Test Must be Y or-
     A                                       N.       Press RESET')
     A                                 18 25'(Y/N)'
     A                                  7 56'(Y/N)'
