     A*%%TS  SD  19981223  135653  EFD         REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF06
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  19981223  135653  EFD         REL-V3R7M0  5716-PW1
     A                                  1  2'DPC20AA'
     A                                  2  2USER
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  1 20' Yearly D.P.C. Customer Worksheet -
     A                                      Prompt '
     A                                      DSPATR(RI)
     A            USDEPT         3   O  3 24DSPATR(HI)
     A            DEDESC        30   O  3 28DSPATR(HI)
     A                                  8 14'User I.D.:'
     A            VUSER         10   B  8 25
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A  10N11                               ERRMSG('*** Invalid User I.D. Enter-
     A                                      ed.         Press RESET')
     A  10 11                               ERRMSG('*** User is Not in Your Dep-
     A                                      artment.    Press RESET')
     A                                  8 37'NOTE: Leave User I.D. Blank to pri-
     A                                      nt all'
     A                                  9 43'Users in Your Department.'
     A                                 14 14'Printer I.D.:'
     A            PRINT         10   B 14 28
     A  30                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  30                                  DSPATR(PC)
     A  30                                  ERRMSG('*** You Must enter a Printe-
     A                                      r I.D.      Press RESET')
     A                                 17 14'Number of Copies:'
     A            COPIES         3Y 0B 17 32
     A  35                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  35                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A  35                                  ERRMSG('*** Invalid Number of Copie-
     A                                      s.          Press RESET')
     A                                 23  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                 24  2'Enter to Process              F6=R-
     A                                      estart                      F3/F7=C-
     A                                      ancel Job'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
