     A*%%TS  SD  19990216  181559  EFD         REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF06
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  19990216  181559  EFD         REL-V3R7M0  5716-PW1
     A                                  1  2'DPC23AA'
     A                                  1 20' Monthly D.P.C. Sales Projections -
     A                                      Prompt '
     A                                      DSPATR(RI)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 73TIME
     A                                  6 25'Month Wanted:'
     A            MONTH          2Y 0B  6 47EDTCDE(4)
     A  20                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  20                                  DSPATR(PC)
     A  20                                  ERRMSG('*** Invalid Month Entered. -
     A                                      Must be between 1 - 12.   Press RES-
     A                                      ET')
     A                                 11 25'Printer I.D.:'
     A            PRINT         10A  B 11 39
     A  30                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  30                                  DSPATR(PC)
     A  30                                  ERRMSG('*** You Must enter a Printe-
     A                                      r I.D.      Press RESET')
     A                                 13 25'Number of Copies:'
     A            COPIES         3Y 0B 13 46
     A  35                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  35                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A  35                                  ERRMSG('*** Invalid Number of Copie-
     A                                      s.          Press RESET')
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                 23  2'Enter to Process              F6=R-
     A                                      estart                      F3/F7=C-
     A                                      ancel Job'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
