     A*%%TS  SD  19990609  191054  EFD         REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  19990609  191054  EFD         REL-V3R7M0  5716-PW1
     A                                  1  2'DPC34AA'
     A                                  2  2USER
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  2 19' D.P.C. Certificate list for vendo-
     A                                      rs prompt '
     A                                      DSPATR(RI)
     A                                 23  3'Enter to Process                  -
     A                                                                F3/F7=Can-
     A                                      cel Job'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  8 25'Forms Number:'
     A            VFORM          4A  B  8 49DSPATR(CS)
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A  14                                  ERRMSG('*** Forms Number Is Require-
     A                                      d.     Press Reset')
     A                                  9 25'Number of Copies:'
     A            VCOPY          2Y 0B  9 51EDTCDE(3)
     A  15                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  15                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A  15                                  ERRMSG('*** Number of Copies is Req-
     A                                      uired.    Press Reset')
     A                                 10 25'Printer ID:'
     A            VPRTR         10A  B 10 43DSPATR(CS)
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A  52                                  ERRMSG('*** Printer ID Is Required.-
     A                                           Press Reset')
     A                                 11 25'Print Status:'
     A            VOUT           1Y 0B 11 52EDTCDE(3)
     A  54                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  54                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A  54                                  ERRMSG('*** Valid Entries Are 1, 2 -
     A                                      or 3.    Press Reset')
     A                                 11 55'1 = Print'
     A                                 12 55'2 = Print/Save'
     A                                 13 55'3 = Hold'
