     A*%%TS  SD  19990728  095320  JEFF        REL-V3R7M0  5716-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  19990728  095320  JEFF        REL-V3R7M0  5716-PW1
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  4 26'Label Size:'
     A            VSIZE          1D 0B  4 50
     A  16                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  16                                  DSPATR(PC)
     A  16                                  ERRMSG('*** Valid Entries are 1 or -
     A                                      2.       Press Reset')
     A                                  4 53'1 = 3in. x 15/16in.'
     A                                  5 53'2 = Large Dillon Label'
     A                                  7 26'Sequence For'
     A            VORD           1D 0B  7 50
     A  11                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  11                                  DSPATR(PC)
     A  11                                  ERRMSG('*** Valid Entries are 1, 2 -
     A                                      or 3.     Press Reset')
     A                                  7 53'1 = Customer Number'
     A                                  8 26'Printing Labels:'
     A                                  8 53'2 = Zip Code'
     A                                  9 53'3 = Customer Alpha'
     A                                 13 26'Forms Number:'
     A            VFORMS        10A  B 13 41DSPATR(CS)
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A  12 99                               ERRMSG('*** Forms Number Is Require-
     A                                      d.     Press Reset')
     A                                 14 26'Number'
     A                                 14 33'of'
     A                                 14 36'Copies:'
     A            VCOPY          2D 0B 14 49DSPATR(CS)
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A  13 99                               ERRMSG('*** Number Of Copies Is Req-
     A                                      uired.     Press Reset')
     A                                 15 26'JOBQ'
     A                                 15 31'(Y/N):'
     A            VJOB           1A  B 15 50DSPATR(CS)
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A  15 99                               ERRMSG('*** Valid Entries Are Y or -
     A                                      N.    Press Reset')
     A                                 16 26'Printer ID:'
     A            VPRTR         10A  B 16 41DSPATR(CS)
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A  52                                  ERRMSG('*** Printer ID is Required.-
     A                                           Press Reset')
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'         Enter to Process         -
     A                                                            F7=Cancel Job-
     A                                               '
     A                                      DSPATR(UL)
     A            VOUT           1D 0B 17 50DSPATR(CS)
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A  53                                  ERRMSG('*** Valid Entries Are 1, 2 -
     A                                      or 3.     Press Reset')
     A                                 17 26'Print Status:'
     A                                 17 53'1 = Print'
     A                                 18 53'2 = Print/Save'
     A                                 19 53'3 = Hold'
     A                                  1  2'DPCLBPA'
     A                                  1 24' D P C Customer Label Selections '
     A                                      DSPATR(RI)
     A            VATTN          1A  B 11 50DSPATR(CS)
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A  17 99                               ERRMSG('*** Valid Entries Are Y or -
     A                                      N.    Press Reset')
     A                                 11 26'Print Contact''s Name?'
     A                                 11 53'(Y or N)'
     A          R SCRNB
     A*%%TS  SD  19990520  153804  EFD         REL-V3R7M0  5716-PW1
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF05
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'         Enter to Process     F5=L-
     A                                      abel Selections       F7=Cancel Job-
     A                                               '
     A                                      DSPATR(UL)
     A                                  1  2'DPCLBPA'
     A                                  1 24' D P C Customer Label Selections '
     A                                      DSPATR(RI)
     A                                  5 10'For Large labels enter the message-
     A                                       you wish to print on label.'
     A                                  7 10'This message will be printed exact-
     A                                      ly as you enter it. You can'
     A                                  9 10'Center it on the label by centerin-
     A                                      g it in the space below.'
     A            MSG           40   B 12 21DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      CHECK(LC)
