     A*%%TS  SD  20080925  150828  BILLB       REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF06
     A                                      CF03
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  20080925  150828  BILLB       REL-V5R3M0  5722-WDS
     A                                  1  2'FCP222A'
     A                                      COLOR(BLU)
     A                                  2  2USER
     A                                      COLOR(BLU)
     A                                  1 25' Weekly Chemical Run by Sprayer '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 73TIME
     A                                      COLOR(BLU)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'                Enter to Process  -
     A                                          F3/F7=End of Job               -
     A                                               '
     A                                      DSPATR(UL)
     A                                  1 27' Weekly Availability Entry '
     A                                      DSPATR(RI)
     A                                  9 28'Enter Batch Date:'
     A            FRMDAT         6Y 0B  9 46
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A                                      EDTCDE(Y)
     A  10                                  ERRMSG('*** Date is not on the cont-
     A                                      rol File.   Press RESET')
     A                                 19 15' Verify Data if OK Press Enter, El-
     A                                      se Make Changes. '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                  2 37'FINISHED'
     A                                      DSPATR(HI)
     A  10                             12 20'That is not a valid Date.  Please -
     A                                      Re-enter'
     A  10                                  COLOR(RED)
     A  11                             12 19'That date does not exist on the co-
     A                                      ntrol file'
     A  11                                  COLOR(RED)
