     A*%%TS  SD  20000229  180856  EFD         REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  20000229  180856  EFD         REL-V3R7M0  5716-PW1
     A                                      CF02
     A                                  1  2'GETDICA'
     A                                  2  2USER
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  1 19' Build Dillon General Ledger Trans-
     A                                      fer File '
     A                                      DSPATR(RI)
     A                                  6 18'Enter Month to Transfer:'
     A            MONTH          2Y 0B  6 43
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A                                      DSPATR(PC)
     A                                      EDTCDE(4)
     A  10                                  ERRMSG('*** Invalid Month Entered. -
     A                                                  Press RESET')
     A                                 24 15'Enter to Process                  -
     A                                       F3/F7=Cancel Job'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                 23 15'                                  -
     A                                                       '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                 13 17'NOTE: This procedure will clear th-
     A                                      e transfer file and'
     A                                 14 23'add new records. This can be run a-
     A                                      s many times as'
     A                                 15 23'needed for each month.'
     A                                  8 18'Enter Year to Transfer:'
     A            YEAR           4Y 0B  8 43
     A  20                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A                                      DSPATR(PC)
     A                                      EDTCDE(4)
     A  20                                  ERRMSG('*** Invalid Year Entered.  -
     A                                                 Press RESET')
     A                                 11 10' Verify input if OK press F2 to Co-
     A                                      ntinue, else make changes. '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
