     A*%%TS  SD  19990723  071737  TGMS        REL-V4R2M0  5769-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      USRDSPMGT
     A          R SCRNA
     A*%%TS  SD  19990723  071737  TGMS        REL-V4R2M0  5769-PW1
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      CF02
     A                                      HOME
     A                                      HELP
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A          H                           HLPRCD(OHELP)
     A  *DS3                                HLPARA(01 002 24 080)
     A  *DS4                                HLPARA(01 002 24 080)
     A                                  1  2'GLC350 '
     A                                  1 16'Help'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  1 26' Post General Ledger Balances '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 33'For Company:'
     A            LCO            2S 0O  2 46DSPATR(HI)
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  5 28'Accounting Period:'
     A            VACTP          2Y 0B  5 52
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A  11                                  ERRMSG('*** Enter A Valid Accountin-
     A                                      g Period.   Press Reset')
     A  12                                  ERRMSG('*** Accounting Calendar Not-
     A                                       Created For This Company.     Pres-
     A                                      s Reset')
     A  13                                  ERRMSG('*** G/L Defaults Not Create-
     A                                      d For This Company.     Press Reset-
     A                                      ')
     A                                  9 28'Printer ID:'
     A            LPRTR         10A  B  9 47DSPATR(CS)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A  50                                  ERRMSG('*** Printer Is Required.   -
     A                                        Press Reset')
     A                                 10 28'Forms Number:'
     A            LFORM         10A  B 10 47DSPATR(CS)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A  51                                  ERRMSG('*** Forms Number Is Require-
     A                                      d.    Press Reset')
     A                                 11 28'Number of Copies:'
     A            LCOPY          2Y 0B 11 55
     A  52                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  52                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A  52                                  ERRMSG('*** Number of Copies Is Req-
     A                                      uired.    Press Reset')
     A                                 12 28'Run From JobQ:'
     A            LJOBQ          1A  B 12 56
     A  53                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  53                                  DSPATR(PC)
     A  53                                  ERRMSG('*** Valid Entries Are Y or -
     A                                      N.     Press Reset')
     A                                 13 28'Print Status:'
     A            VOUT           1Y 0B 13 56
     A  54                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  54                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A  54                                  ERRMSG('*** Valid Entries Are 1, 2 -
     A                                      or 3.    Press Reset')
     A                                 13 60'1 = Print'
     A                                 14 60'2 = Print/Save'
     A                                 15 60'3 = Hold'
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'  Enter to Process         F2=Disp-
     A                                      lay Acctg Period         F3/F7=Canc-
     A                                      el Job   '
     A                                      DSPATR(UL)
     A          R OHELP
     A*%%TS  SD  19990509  070203  APGL        REL-V3R1M0  5763-PW1
     A                                  6  3' Post General Ledger Balances     -
     A                                                                    Overv-
     A                                      iew     '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7  3'                                  -
     A                                                                         -
     A                                              '
     A                                      DSPATR(HI)
     A                                  8  3' This program will post all of the-
     A                                       unposted g/l detail records record-
     A                                      s to    '
     A                                      DSPATR(HI)
     A                                 10  3'                                  -
     A                                                                         -
     A                                              '
     A                                      DSPATR(HI)
     A                                  9  3' the g/l balance file.            -
     A                                                                         -
     A                                              '
     A                                      DSPATR(HI)
     A                                 11  3' All unposted records with an acco-
     A                                      unting period equal or prior to the-
     A                                       date   '
     A                                      DSPATR(HI)
     A                                 12  3' entered will be posted to the app-
     A                                      ropriate accounting period field in-
     A                                       the    '
     A                                      DSPATR(HI)
     A                                 13  3' balance file.                    -
     A                                                                         -
     A                                              '
     A                                      DSPATR(HI)
     A                                 24  3'                           Press E-
     A                                      nter to Return                     -
     A                                              '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19  3'                         Report 2.-
     A                                       is a detail list of all unposted e-
     A                                      ntries  '
     A                                      DSPATR(HI)
     A                                 18  3' Two reports will print: Report 1.-
     A                                       is a detail list of all posted ent-
     A                                      ries    '
     A                                      DSPATR(HI)
     A                                 17  3'                                  -
     A                                                                         -
     A                                              '
     A                                      DSPATR(HI)
     A                                 20  3'                                  -
     A                                                                         -
     A                                              '
     A                                      DSPATR(HI)
     A                                 21  3' Prior to running this program, yo-
     A                                      u must have created both the Accoun-
     A                                      ting    '
     A                                      DSPATR(HI)
     A                                 22  3' Period and G/L Posting Defaults f-
     A                                      iles for the company that you are p-
     A                                      osting. '
     A                                      DSPATR(HI)
     A                                 23  3'                                  -
     A                                                                         -
     A                                              '
     A                                      DSPATR(HI)
     A                                 15  3' The profit/loss account as define-
     A                                      d in the g/l defaults file will be -
     A                                      updated '
     A                                      DSPATR(HI)
     A                                 16  3' based on the results of the post.-
     A                                                                         -
     A                                              '
     A                                      DSPATR(HI)
     A                                 14  3'                                  -
     A                                                                         -
     A                                              '
     A                                      DSPATR(HI)
