     A*%%TS  SD  20000729  080732  TGMS        REL-V4R4M0  5769-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      USRDSPMGT
     A                                      CF03
     A                                      CF06
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  20000729  080732  TGMS        REL-V4R4M0  5769-PW1
     A                                      HELP
     A                                      CF02
     A                                      INVITE
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                      PRINT
     A                                  1  3'GLC580A'
     A                                  1 26' Comparative Income Statement '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  3USER
     A                                  2 33'For Company:'
     A            LCO            2S 0O  2 46DSPATR(HI)
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  4 25'Report Reference?'
     A            LREF           8A  B  4 49DSPATR(CS)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A  20N21                               ERRMSG('*** Enter A Valid Report Re-
     A                                      ference.   Press Reset')
     A  20 21                               ERRMSG('*** Selected Reference is n-
     A                                      ot a Profit and Loss Report.       -
     A                                      Press RESET')
     A            VDESC         15A  O  5 49DSPATR(HI)
     A                                  7 25'Accounting Period:'
     A            VACTP          2Y 0B  7 49DSPATR(CS)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                      CHECK(RB)
     A  10                                  ERRMSG('*** Enter A Valid Accountin-
     A                                      g Period.     Press Reset')
     A                                  9 25'Report Format:'
     A            OPTION         1Y 0B  9 49DSPATR(CS)
     A                                      EDTCDE(Z)
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                      CHECK(RB)
     A  30                                  ERRMSG('*** Valid Entries Are 1, 2 -
     A                                      or 3.     Press Res    et')
     A                                  9 52'1 = Percent of Total Sales'
     A                                 10 52'2 = Percent of Total Expenses'
     A                                 11 52'3 = Percent of Profit'
     A                                 13 25'Printer ID:'
     A            LPRTR         10A  B 13 47CHECK(FE)
     A                                      DSPATR(CS)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A  50                                  ERRMSG('*** Printer ID Is Required.-
     A                                           Press Reset')
     A                                 14 25'Forms Number:'
     A            LFORM         10A  B 14 47CHECK(FE)
     A                                      DSPATR(CS)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A  51                                  ERRMSG('*** Forms Number Is Require-
     A                                      d.     Press Reset')
     A                                 15 25'Number of Copies:'
     A            LCOPY          2Y 0B 15 55
     A  52                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  52                                  DSPATR(PC)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A  52                                  ERRMSG('*** Number of Copies Is Req-
     A                                      uired.    Press Reset')
     A                                 16 25'JOBQ (Y/N):'
     A            LJOBQ          1X  B 16 56CHECK(FE)
     A                                      DSPATR(CS)
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A  53                                  ERRMSG('*** Valid Entries Are Y or -
     A                                      N.     Press Reset')
     A                                 17 25'Print Status:'
     A            VOUT           1Y 0B 17 56
     A  54                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  54                                  DSPATR(PC)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A  54                                  ERRMSG('*** Valid Entries Are 1, 2 -
     A                                      or 3.    Press Reset')
     A                                 17 60'1 = Print'
     A                                 18 60'2 = Print/Save'
     A                                 19 60'3 = Hold'
     A                                 21 10'NOTE!'
     A                                      DSPATR(RI)
     A                                 21 17' This report requires 14-7/8 in. X-
     A                                       11 in. paper '
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'   Enter to Process         F2=Dis-
     A                                      play Acctg Period       F3/F7=Cance-
     A                                      l Job    '
     A                                      DSPATR(UL)
