     A*%%TS  SD  19990430  070430  GL          REL-V3R1M0  5763-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      USRDSPMGT
     A                                      INDARA
     A          R SCRNA
     A*%%TS  SD  19990430  070430  GL          REL-V3R1M0  5763-PW1
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      CF03
     A                                      HOME
     A                                      HELP
     A                                      INVITE
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                  1  3'GLR230A'
     A                                  1 26' General Ledger Budget Entry '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  3USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  5  3'Action:'
     A            VACT           1X  B  5 12DSPATR(CS)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A  10                                  ERRMSG('*** Enter A Valid Action Co-
     A                                      de.     Press Reset')
     A                                  5 27'G/L Account:'
     A            VGL            4Y 0B  5 45
     A  20                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  20                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  21                                  ERRMSG('*** Enter A Valid G/L Numbe-
     A                                      r.   Press Reset')
     A  22                                  ERRMSG('*** Can Not Add - Records E-
     A                                      xists.    Press Reset')
     A  23                                  ERRMSG('*** Record Does Not Exist. -
     A                                          Press Reset')
     A                                  7  2' A = Add    '
     A                                      DSPATR(RI)
     A                                  7 27'Department:'
     A            VDEPT          4Y 0B  7 45DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                  8  2' C = Change '
     A                                      DSPATR(RI)
     A                                  9  2' D = Delete '
     A                                      DSPATR(RI)
     A                                  9 27'or Alpha Search'
     A            VALPHA        15A  B  9 45DSPATR(CS)
     A            GCDESC        30A  O 10 45DSPATR(HI)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'              Enter to Process    -
     A                                                F3/F7=End of Job         -
     A                                               '
     A                                      DSPATR(UL)
     A          R SCRNB
     A*%%TS  SD  19990430  070430  GL          REL-V3R1M0  5763-PW1
     A                                      CF06
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      CF03
     A                                      HOME
     A                                      HELP
     A                                      INVITE
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                  1  2'GLR230B'
     A                                  1 26' General Ledger Budget Entry '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  3  2'Company:'
     A            LCO            2S 0O  3 11DSPATR(HI)
     A                                  3 16'Account:'
     A            GCGLNO         8Y 0O  3 25EDTWRD('    -    ')
     A                                      DSPATR(HI)
     A            GCDESC        30   O  3 35DSPATR(HI)
     A                                  5  2'                          Current -
     A                                      Year         Next Year             -
     A                                               '
     A                                      DSPATR(UL)
     A                                  6  4'Budgets Amounts:'
     A            PERMO          6A  O  7  7DSPATR(RI)
     A                                  7 21'01:'
     A            GBC01         11Y 2B  7 26EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A            GBN01         11Y 2B  7 45EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A                                  8 21'02:'
     A            GBC02         11Y 2B  8 26EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A            GBN02         11Y 2B  8 45EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A                                  9 21'03:'
     A            GBC03         11Y 2B  9 26EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A            GBN03         11Y 2B  9 45EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A                                 10 21'04:'
     A            GBC04         11Y 2B 10 26EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A            GBN04         11Y 2B 10 45EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A                                 11 21'05:'
     A            GBC05         11Y 2B 11 26EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A            GBN05         11Y 2B 11 45EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A                                 12 21'06:'
     A            GBC06         11Y 2B 12 26EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A            GBN06         11Y 2B 12 45EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A                                 13 21'07:'
     A            GBC07         11Y 2B 13 26EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A            GBN07         11Y 2B 13 45EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A                                 14 21'08:'
     A            GBC08         11Y 2B 14 26EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A            GBN08         11Y 2B 14 45EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A                                 15 21'09:'
     A            GBC09         11Y 2B 15 26EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A            GBN09         11Y 2B 15 45EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A                                 16 21'10:'
     A            GBC10         11Y 2B 16 26EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A            GBN10         11Y 2B 16 45EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A                                 17 21'11:'
     A            GBC11         11Y 2B 17 26EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A            GBN11         11Y 2B 17 45EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A                                 18 21'12:'
     A            GBC12         11Y 2B 18 26EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A            GBN12         11Y 2B 18 45EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A                                 19 21'13:'
     A  31                                  DSPATR(ND)
     A            GBC13         11Y 2B 19 26EDTCDE(J)
     A N31                                  DSPATR(CS)
     A  31                                  DSPATR(ND)
     A                                      CHECK(RB)
     A            GBN13         11Y 2B 19 45EDTCDE(J)
     A N31                                  DSPATR(CS)
     A  31                                  DSPATR(ND)
     A                                      CHECK(RB)
     A                                 21 16' Validate Data - Change or Press E-
     A                                      nter to Accept '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                 22  3'** NOTE **  Debit = Enter a Positi-
     A                                      ve Number   Credit = Enter a Negati-
     A                                      ve Number'
     A                                      DSPATR(UL)
     A                                 23  3'        Enter to Process       F6=-
     A                                      Restart          F3/F7=End of Job  -
     A                                              '
     A                                      DSPATR(UL)
     A            CBAL          11Y 2B 20 26EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A            PBAL          11Y 2B 20 45EDTCDE(J)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A                                 20 18'Total:'
