     A*%%TS  SD  20060208  101814  BILLB       REL-V5R3M0  5722-WDS
     A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A          R SCRNA
     A*%%TS  SD  20060208  101814  BILLB       REL-V5R3M0  5722-WDS
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF03
     A                                      CF04
     A                                      ALWROL
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'                Enter to Process  -
     A                                          F3/F7=End of Job               -
     A                                               '
     A                                      DSPATR(UL)
     A            PROGID        10A  O  1  2
     A                                  7  6'Enter Monday Date:'
     A            FRMDAT         6Y 0B  7 25
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A                                      EDTCDE(Y)
     A  10N11                               ERRMSG('*** Invalid Date Entered.  -
     A                                                  Press RESET')
     A  10 11                               ERRMSG('*** Entered Date is not A M-
     A                                      onday Date. Press RESET')
     A                                  7 36'or Year ex. 2000:'
     A            BEGYY          4Y 0B  7 54
     A  20                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  20                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A  20                                  ERRMSG('Invalid Year Entered.      -
     A                                                  Press RESET')
     A                                  7 59'and Week Number:'
     A            BEGWW          2Y 0B  7 76
     A  21                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  21                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A  21                                  ERRMSG('*** Invalid Week Number Ent-
     A                                      ered.       Press RESET')
     A                                 17  6'Printer I.D.:'
     A            PRTID         10A  B 17 20
     A  50                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  50                                  DSPATR(PC)
     A  50                                  ERRMSG('*** Printer I.D. Cannot be -
     A                                      Blank.      Press RESET')
     A                                 19 15' Verify Data if OK Press Enter, El-
     A                                      se Make Changes. '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                  6  6'Begining Week:'
     A                                      DSPATR(UL)
     A                                 10  6'Ending Week:'
     A                                      DSPATR(UL)
     A                                 11  6'Enter Monday Date:'
     A            TODAT          6Y 0B 11 25
     A  30                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  30                                  DSPATR(PC)
     A                                      EDTCDE(Y)
     A  30N31                               ERRMSG('*** Invalid Date Entered.  -
     A                                                  Press RESET')
     A  30 31                               ERRMSG('*** Entered Date is not A M-
     A                                      onday Date. Press RESET')
     A                                 11 36'or Year ex. 2000:'
     A            ENDYY          4Y 0B 11 54
     A  40                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  40                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A  40                                  ERRMSG('Invalid Year Entered.      -
     A                                                  Press RESET')
     A                                 11 59'and Week Number:'
     A            ENDWW          2Y 0B 11 76
     A  41                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  41                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A  41                                  ERRMSG('*** Invalid Week Number Ent-
     A                                      ered.       Press RESET')
     A                                 14  6'Sow or Shipping:'
     A            DORS           1A  B 14 25
     A  11                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  11                                  DSPATR(PC)
     A  11                                  ERRMSG('*** Enter S For Sow Week -o-
     A                                      r- R For Ship Week.  Press RESET')
     A                                 14 28'NOTE: For Sow Weeks Enter S. For S-
     A                                      hip Weeks Enter R.'
     A                                  1 28' Sow/Ship Summary Report '
     A                                      DSPATR(RI)
     A                                 15 35'for Both Reports, enter B'
