     A*%%TS  SD  20040514  065351  RP          REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RBXREF RBXREFR)
     A                                      PRINT
     A                                      CF01(01)
     A                                      CF03(03 'Exit Program')
     A                                      CF12(12 'Previous Screen')
     A          R S1DATA                    SFL
     A*%%TS  SD  20031020  102908  RP          REL-V5R1M0  5722-WDS
     A                                      KEEP
     A  39                                  SFLNXTCHG
     A            ##RRN#        15S 0H
     A            S1SEL          1A  B  9  2
     A  31                                  DSPATR(RI)
     A  96                                  DSPATR(ND)
     A N96                                  DSPATR(UL)
     A  96                                  DSPATR(PR)
     A            S1DATE         6Y 0O  9 16EDTCDE(Y)
     A            S1POYR         2S 0O  9  4
     A                                  9  7'-'
     A            S1PONO         6S 0O  9  9
     A            S1VEN#         6S 0O  9 25
     A            S1QTOR         9Y 0O  9 55EDTWRD('   ,   ,   -')
     A            S1QTRC         9Y 0O  9 68EDTWRD('   ,   ,   -')
     A            S1VNDN        22A  O  9 32
     A******                                ROLLUP(26)
     A******                                ROLLDOWN(27)
     A          R S1CNTL                    SFLCTL(S1DATA)
     A*%%TS  SD  20040514  065351  RP          REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0200)
     A                                      SFLPAG(0013)
     A                                      KEEP
     A                                      RTNCSRLOC(&##RCD &##FLD)
     A                                      BLINK
     A                                      CSRLOC(##ROW      ##COL)
     A                                      OVERLAY
     A                                      SFLCSRRRN(&##CRRN)
     A                                      SFLMODE(&##SFLM)
     A N80                                  SFLDSP
     A N80                                  SFLDSPCTL
     A  80                                  SFLCLR
     A N81                                  SFLEND
     A            ##ROW          3S 0H
     A            ##COL          3S 0H
     A            ##RCD         10A  H
     A            ##FLD         10A  H
     A            ##CRRN         5S 0H
     A            ##SFLM         1A  H      TEXT('Fold/Trunc. Status')
     A            ##RRNO         4S 0H      SFLRCDNBR(CURSOR)
     A            CONM##        40A  O  1 21DSPATR(HI)
     A                                      MSGID(KP0 0001 KPMSGF)
     A                                  1 72TIME
     A                                  2  3'S1CNTL'
     A            PGTL##        51A  O  2 20DSPATR(HI)
     A                                      MSGID(HG0 0005 KPMSGF)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                  4  2'Options:'
     A                                      COLOR(BLU)
     A            C1OPTN        70A  O  4 11COLOR(BLU)
     A                                  6  8'Description:'
     A                                      COLOR(YLW)
     A            S1DESC        30A  O  6 22COLOR(YLW)
     A                                  8 18'Date'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  1  3'HG0031S'
     A                                  5  8'Item Number:'
     A                                      COLOR(YLW)
     A            S1ITM#        12A  O  5 22COLOR(YLW)
     A                                  8  1'Op'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  8  4'P/O Number '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  7 19'P/O'
     A                                      DSPATR(HI)
     A                                  8 25'Number'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  7 25'Vendor'
     A                                      DSPATR(HI)
     A                                  8 32'Vendor Name           '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  8 59'Ordered'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  7 58'Quantity'
     A                                      DSPATR(HI)
     A                                  8 71'Received'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  7 71'Quantity'
     A                                      DSPATR(HI)
     A                                  5 35'Size:'
     A                                      COLOR(YLW)
     A            S1SIZE         3A  O  5 41COLOR(YLW)
     A                                  5 36'Size'
     A                                      COLOR(YLW)
     A          R CFKY01
     A*%%TS  SD  19991103  134029  RP          REL-V4R2M0  5769-PW1
     A                                      TEXT('Valid Cmd Keys Display')
     A                                      OVERLAY
     A                                 23 15'F3=Exit Program'
     A                                      COLOR(BLU)
     A                                 23 60'F12=Previous Screen'
     A                                      COLOR(BLU)
     A          R MSGDATA                   SFL
     A                                      TEXT('Program Messages')
     A                                      SFLMSGRCD(24)
     A            $#MSKY                    SFLMSGKEY
     A            $#PGMQ                    SFLPGMQ
     A          R MSGCTL                    SFLCTL(MSGDATA)
     A                                      TEXT('Program Messages')
     A                                      OVERLAY
     A N92                                  SFLDSP
     A N92                                  SFLDSPCTL
     A N92                                  SFLINZ
     A N92                                  SFLEND
     A                                      SFLSIZ(0002)
     A                                      SFLPAG(0001)
     A            $#PGMQ                    SFLPGMQ
