     A*%%TS  SD  20010810  090433  JEFF        REL-V3R7M0  5716-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      USRDSPMGT
     A          R SCRNA
     A*%%TS  SD  19961106  103458  EFD         REL-V3R6M0  5716-PW1
     A                                      CF03
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF13
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                      HLPCLR
     A          H                           HLPRCD(HITEM)
     A                                      HLPBDY
     A  *DS3                                HLPARA(05 044 05 055)
     A  *DS4                                HLPARA(05 044 05 055)
     A          H                           HLPRCD(HSIZE)
     A  *DS3                                HLPARA(06 044 06 046)
     A  *DS4                                HLPARA(06 044 06 046)
     A          H                           HLPRCD(HALPHA)
     A  *DS3                                HLPARA(08 044 08 058)
     A  *DS4                                HLPARA(07 044 07 058)
     A          H                           HLPRCD(HLOC)
     A  *DS3                                HLPARA(12 044 12 046)
     A  *DS4                                HLPARA(10 044 10 046)
     A                                  1  2'ICV010A'
     A                                  1 28' ITEM MASTER MAINTENANCE '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  5  3'Action:'
     A            VACT           1X  B  5 12DSPATR(CS)
     A  10                                  DSPATR(PC)
     A  10                                  ERRMSG('*** Valid Entries are A, C,-
     A                                       D, R, or I.  Press Reset')
     A  10                                  DSPATR(RI)
     A                                  5 28'Item Number?'
     A            VITEM         12A  B  5 44DSPATR(CS)
     A  19                                  DSPATR(RI)
     A  19
     AO 83                                  DSPATR(PC)
     A  11 19                               ERRMSG('*** Either Item Number or A-
     A                                      lpha Search is Required.   Press Re-
     A                                      set')
     A  12 19                               ERRMSG('*** This Item Already on Fi-
     A                                      le.    Press Reset')
     A  13 19                               ERRMSG('*** This Item Is Not on Fil-
     A                                      e.     Press Reset')
     A  14 19                               ERRMSG('*** Item is Deleted.       -
     A                                                          Press Reset')
     A  15 19                               ERRMSG('*** Cannot Reactivate, Item-
     A                                       is Not Deleted.         Press Rese-
     A                                      t')
     A  16 19                               ERRMSG('*** Cannot Delete, Item Has-
     A                                       an Quantity on Hand.    Press Rese-
     A                                      t')
     A                                  6 28'Size?'
     A            VSIZE          3A  B  6 44DSPATR(CS)
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A  55                                  ERRMSG('*** This Is Not a Valid Siz-
     A                                      e Code.    Press Reset')
     A                                  7  1' A=Add        '
     A                                      DSPATR(RI)
     A                                  8  1' C=Change     '
     A                                      DSPATR(RI)
     A                                  8 28'Search By'
     A                                  9  1' D=Delete     '
     A                                      DSPATR(RI)
     A                                  9 28'Product Class?'
     A            VPC            2A  B  9 44DSPATR(CS)
     A                                 10  1' R=Reactivate '
     A                                      DSPATR(RI)
     A            PCDESC        30A  O 10 44
     A                                 11  1' I=Inquiry    '
     A                                      DSPATR(RI)
     A                                 12 28'Location:'
     A            VWHSE          3A  B 12 44DSPATR(CS)
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A  56                                  ERRMSG('*** This Is Not a Valid Loc-
     A                                      ation Code.   Press Reset')
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'   Enter to Process        F3/F7=E-
     A                                      nd of Job       F13=Print Inventory-
     A                                       List    '
     A                                      DSPATR(UL)
     A          R HITEM
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                 10  3' Item Number                      -
     A                                                                     Requ-
     A                                      ired   '
     A                                      DSPATR(RI)
     A                                 12  3' Enter up to 12 characters and/or -
     A                                      numbers that will define this item.-
     A                                             '
     A                                 17  3' location combination.            -
     A                                                                         -
     A                                             '
     A                                 22  3'                                  -
     A                                                                         -
     A                                             '
     A                                 13  3' This must be a unique number for -
     A                                      every item in your inventory,      -
     A                                             '
     A                                 16  3' locations - the item number can b-
     A                                      e repeated for each different size/-
     A                                             '
     A                                 15  3' If an item will be tracked by eit-
     A                                      her multiple sizes and/or in multip-
     A                                      le     '
     A                                 19  3' When an existing item number is e-
     A                                      ntered for a new size and/or locati-
     A                                      on,    '
     A                                 20  3' all of the data in the item numbe-
     A                                      r file will be maintained such as  -
     A                                             '
     A                                 21  3' description, price etc.  Any data-
     A                                       can be changed for this particular-
     A                                       item. '
     A                                  8  2'                  '
     A                                  9  2'                  '
     A                                 11  3'                                  -
     A                                                                         -
     A                                              '
     A                                 24  2'                                  -
     A                                                                         -
     A                                               '
     A                                 14  3'                                  -
     A                                                                         -
     A                                             '
     A                                 18  3'                                  -
     A                                                                         -
     A                                             '
     A                                 23  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A          R HSIZE
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                 12  3' Size                             -
     A                                                                     Opti-
     A                                      onal   '
     A                                      DSPATR(RI)
     A                                 13  3'                                  -
     A                                                                         -
     A                                             '
     A                                 14  3' Some of your plant material may b-
     A                                      e grown in multiple sizes.  TGMS le-
     A                                      ts     '
     A                                 19  3'                                  -
     A                                                                         -
     A                                             '
     A                                 23  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A                                 15  3' you track this material by size, -
     A                                      while maintaining the data that is -
     A                                             '
     A                                 18  3' The size code is useful with spac-
     A                                      e allocation, shipping etc.        -
     A                                             '
     A                                 16  3' constant about that plant.       -
     A                                                                         -
     A                                             '
     A                                 20  3' If you enter a size code, it must-
     A                                       have been defined in the Size Code-
     A                                       Master'
     A                                 21  3' File  -  #2 on the Inventory Mast-
     A                                      er Files Menu.                     -
     A                                             '
     A                                 17  3'                                  -
     A                                                                         -
     A                                             '
     A                                 22  3'                                  -
     A                                                                         -
     A                                             '
     A                                 24  3'                                  -
     A                                                                         -
     A                                             '
     A                                 10  2'                  '
     A                                  9  2'                  '
     A                                  8  2'                  '
     A                                  7  2'                  '
     A                                 11  2'                                  -
     A                                                                         -
     A                                             '
     A          R HALPHA
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                 12  3' Alpha Search                     -
     A                                                                     Opti-
     A                                      onal   '
     A                                      DSPATR(RI)
     A                                 13  3'                                  -
     A                                                                         -
     A                                             '
     A                                 14  3' To assist you in locating an item-
     A                                       when you do not know the item numb-
     A                                      er,    '
     A                                 19  3'                                  -
     A                                                                         -
     A                                             '
     A                                 23  3'                                  -
     A                                                                         -
     A                                             '
     A                                 15  3' you can enter up to 15 characters-
     A                                       to describe this item.            -
     A                                             '
     A                                 18  3' alpha search field starting with -
     A                                      the alpha search you enter here.   -
     A                                             '
     A                                 20  3' If you locate the item you want, -
     A                                      just enter the line number for that-
     A                                       item. '
     A                                 17  3' Another screen will display listi-
     A                                      ng your items alphabetically by the-
     A                                             '
     A                                 21  3'                                  -
     A                                                                         -
     A                                             '
     A                                 24  3'                                  -
     A                                                                         -
     A                                             '
     A                                 10  2'                  '
     A                                  9  2'                  '
     A                                  8  2'                  '
     A                                  7  2'                  '
     A                                 11  3'                                  -
     A                                                                         -
     A                                             '
     A                                 22  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A                                 16  3'                                  -
     A                                                                         -
     A                                             '
     A          R HLOC
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                 12  3' Location                         -
     A                                                                     Opti-
     A                                      onal   '
     A                                      DSPATR(RI)
     A                                 13  3'                                  -
     A                                                                         -
     A                                             '
     A                                 14  3' Some growers have multiple locati-
     A                                      ons, ranges, farms etc.  The locati-
     A                                      on     '
     A                                 19  3' is maintained for the new locatio-
     A                                      n.  This can be changed.           -
     A                                             '
     A                                 15  3' code lets you track material by l-
     A                                      ocation.  The same material may be -
     A                                             '
     A                                 18  3' When a new location is entered fo-
     A                                      r an item, the data for that item n-
     A                                      umber  '
     A                                 16  3' grown at multiple locations.     -
     A                                                                         -
     A                                             '
     A                                 21  3' If you enter a location code, it -
     A                                      must have been defined in the Locat-
     A                                      ion    '
     A                                 22  3' Master File  -  #4 on the Invento-
     A                                      ry Master Files Menu.              -
     A                                             '
     A                                 17  3'                                  -
     A                                                                         -
     A                                             '
     A                                 23  3'                                  -
     A                                                                         -
     A                                             '
     A                                 24  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A                                 10  2'                  '
     A                                  9  2'                  '
     A                                  8  2'                  '
     A                                  7  2'                  '
     A                                 11  2'                                  -
     A                                                                         -
     A                                             '
     A                                 20  3'                                  -
     A                                                                         -
     A                                             '
     A          R SCRNB
     A*%%TS  SD  20010810  090433  JEFF        REL-V3R7M0  5716-PW1
     A                                      CF06
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF03
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A          H                           HLPRCD(HBIN)
     A  *DS3                                HLPARA(04 052 04 057)
     A  *DS4                                HLPARA(04 052 04 057)
     A          H                           HLPRCD(HCO)
     A  *DS3                                HLPARA(04 071 04 072)
     A  *DS4                                HLPARA(04 071 04 072)
     A          H                           HLPRCD(HGENUS)
     A  *DS3                                HLPARA(06 014 06 043)
     A  *DS4                                HLPARA(06 014 06 043)
     A          H                           HLPRCD(HBALPHA)
     A  *DS3                                HLPARA(06 064 06 078)
     A  *DS4                                HLPARA(06 064 06 078)
     A          H                           HLPRCD(HVAR)
     A  *DS3                                HLPARA(07 014 07 043)
     A  *DS4                                HLPARA(07 014 07 043)
     A          H                           HLPRCD(HSPEC)
     A  *DS3                                HLPARA(08 014 08 043)
     A  *DS4                                HLPARA(08 014 08 043)
     A          H                           HLPRCD(HNAME)
     A  *DS3                                HLPARA(09 014 09 043)
     A  *DS4                                HLPARA(09 014 09 043)
     A          H                           HLPRCD(HUM1)
     A  *DS3                                HLPARA(11 015 11 016)
     A  *DS4                                HLPARA(11 015 11 016)
     A          H                           HLPRCD(HUM2)
     A  *DS3                                HLPARA(11 024 11 075)
     A  *DS4                                HLPARA(11 024 11 075)
     A          H                           HLPRCD(HPRICE)
     A  *DS3                                HLPARA(14 007 18 045)
     A  *DS4                                HLPARA(14 007 18 045)
     A          H                           HLPRCD(HQTYB)
     A  *DS3                                HLPARA(14 058 18 077)
     A  *DS4                                HLPARA(14 058 18 077)
     A          H                           HLPRCD(HPUM)
     A  *DS3                                HLPARA(20 017 20 018)
     A  *DS4                                HLPARA(20 017 20 018)
     A          H                           HLPRCD(HAVCST)
     A  *DS3                                HLPARA(20 037 20 046)
     A  *DS4                                HLPARA(20 037 20 046)
     A          H                           HLPRCD(HLSCST)
     A  *DS3                                HLPARA(20 063 20 072)
     A  *DS4                                HLPARA(20 063 20 072)
     A                                  1  2'ICV010B'
     A                                  1 28' ITEM MASTER MAINTENANCE '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A            VMODE         10A  O  2 36DSPATR(RI)
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  4  2'Item:'
     A            IMITEM        12A  O  4  8
     A                                  4 22'Size:'
     A            IMSIZE         3A  O  4 28
     A                                  4 34'Loc:'
     A            IMWHSE         3A  O  4 39
     A                                  4 46'Area:'
     A            VWHLOC         6A  B  4 52DSPATR(CS)
     A                                      CHECK(LC)
     A                                  4 61'Company:'
     A            IMCOMP         2Y 0B  4 71EDTCDE(3)
     A  20                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  20                                  DSPATR(PC)
     A  20                                  ERRMSG('*** Invalid Company Number -
     A                                      Entered.   Press Reset')
     A                                  6  4'Genus:'
     A            IMDES1        30A  B  6 14DSPATR(CS)
     A  21                                  DSPATR(RI)
     A  21                                  ERRMSG('*** Genus is Required.     -
     A                                        Press Reset')
     A  01
     AO 21                                  DSPATR(PC)
     A                                  6 48'Alpha Search:'
     A            IMLOOK        15A  B  6 64DSPATR(CS)
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A  22                                  ERRMSG('*** Alpha Search is Require-
     A                                      d.     Press Reset')
     A                                  7  2'Species:'
     A            IMDES2        30A  B  7 14DSPATR(CS)
     A                                      DSPATR(MDT)
     A                                      CHECK(LC)
     A                                  8  2'Variety:'
     A            IMDES3        30A  B  8 14DSPATR(CS)
     A                                      CHECK(LC)
     A                                  9  3'Common:'
     A            IMDES4        30A  B  9 14CHECK(LC)
     A                                      DSPATR(CS)
     A                                 11  6'U/M  1?'
     A            IMPUOM         2A  B 11 15DSPATR(CS)
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A  23                                  ERRMSG('*** Unit of Measure #1 is R-
     A                                      equired.  Press Reset')
     A  25                                  ERRMSG('*** This Is Not a Valid Uni-
     A                                      t of Measure.    Press Reset')
     A                                 11 20'2?'
     A            IMSUOM         2A  B 11 24DSPATR(CS)
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A  26                                  ERRMSG('*** This Is Not a Valid Uni-
     A                                      t of Measure.    Press Reset')
     A                                 11 29'3?'
     A            IM3UOM         2A  B 11 33DSPATR(CS)
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A  27                                  ERRMSG('*** This Is Not a Valid Uni-
     A                                      t of Measure.    Press Reset')
     A                                 11 38'Multiplier 1.'
     A            IMMULT         7Y 4B 11 53DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A  51                                  ERRMSG('*** Multiplier 1. Required -
     A                                      If UM 2 Is Entered.    Press Reset')
     A                                 11 64'2.'
     A            IMMUL2         7Y 4B 11 68DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A  52                                  ERRMSG('*** Multiplier 2. Is Requir-
     A                                      ed If UM 3 Is Entered.    Press Res-
     A                                      et')
     A                                 13  6'Price U/M 1'
     A                                      DSPATR(UL)
     A                                 13 20'Price U/M 2'
     A                                      DSPATR(UL)
     A                                 13 34'Price U/M 3'
     A                                      DSPATR(UL)
     A                                 13 72'Disc. %'
     A                                      DSPATR(UL)
     A                                 14  3'1.'
     A            IMSEL1         9Y 4B 14  7DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A            IMBCS1         9Y 4B 14 21DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A            IM3CS1         9Y 4B 14 35DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 14 54'1.'
     A            IMQLB1        11Y 1B 14 58DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A            IMDIS1         4Y 2B 14 73DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 15  3'2.'
     A            IMSEL2         9Y 4B 15  7DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A            IMBCS2         9Y 4B 15 21DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A            IM3CS2         9Y 4B 15 35DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 15 48'Qty.'
     A                                 15 54'2.'
     A            IMQLB2        11Y 1B 15 58DSPATR(CS)
     A                                      CHECK(RB)
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A  60                                  ERRMSG('*** Quantity Must Be Ascend-
     A                                      ing.      Press Reset')
     A                                      EDTCDE(4)
     A            IMDIS2         4Y 2B 15 73DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 16  3'3.'
     A            IMSEL3         9Y 4B 16  7DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A            IMBCS3         9Y 4B 16 21DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A            IM3CS3         9Y 4B 16 35DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 16 47'Breaks'
     A                                 16 54'3.'
     A            IMQLB3        11Y 1B 16 58DSPATR(CS)
     A                                      CHECK(RB)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A  61                                  ERRMSG('*** Quantity Must Be Ascend-
     A                                      ing.      Press Reset')
     A                                      EDTCDE(4)
     A            IMDIS3         4Y 2B 16 73DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 17  3'4.'
     A            IMSEL4         9Y 4B 17  7DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A            IMBCS4         9Y 4B 17 21DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A            IM3CS4         9Y 4B 17 35DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 17 54'4.'
     A            IMQLB4        11Y 1B 17 58DSPATR(CS)
     A                                      CHECK(RB)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A  62                                  ERRMSG('*** Quantity Must Be Ascend-
     A                                      ing.      Press Reset')
     A                                      EDTCDE(4)
     A            IMDIS4         4Y 2B 17 73DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 18  3'5.'
     A            IMSEL5         9Y 4B 18  7DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A            IMBCS5         9Y 4B 18 21DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A            IM3CS5         9Y 4B 18 35DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 18 54'5.'
     A            IMQLB5        11Y 1B 18 58DSPATR(CS)
     A                                      CHECK(RB)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A  63                                  ERRMSG('*** Quantity Must Be Ascend-
     A                                      ing.      Press Reset')
     A                                      EDTCDE(4)
     A            IMDIS5         4Y 2B 18 73DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 19 49'Allow Cash/Carry Disc:'
     A            IMORDD         1A  B 19 73DSPATR(CS)
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A  29                                  ERRMSG('*** Valid Entries Are Y or -
     A                                      N.     Press Reset')
     A                                 21  3'Pricing U/M:'
     A            IMBPUM         2A  B 21 17DSPATR(CS)
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A  45                                  ERRMSG('*** This Is Not a Valid Uni-
     A                                      t of Measure.    Press Reset')
     A  44                                  ERRMSG('*** Pricing UM Must Be Same-
     A                                       As UM 1., UM 2., or UM 3.     Pres-
     A                                      s Reset')
     A                                 21 22'Average Cost:'
     A            IMUCST         9Y 4B 21 37DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 21 51'Last Cost:'
     A            IMLCST         9Y 4B 21 63DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'           Enter to Process      F-
     A                                      6=Restart      F3/F7=End of Job    -
     A                                               '
     A                                      DSPATR(UL)
     A                                  7 50' For Branches Alpha Search   '
     A  84                                  DSPATR(RI)
     A N84                                  DSPATR(ND)
     A                                  8 50' MUST Begin With F-Fresh Cut '
     A  84                                  DSPATR(RI)
     A N84                                  DSPATR(ND)
     A                                  9 50' S-Supply or P-Plant Kingdom '
     A  84                                  DSPATR(RI)
     A N84                                  DSPATR(ND)
     A                                 19  3'Standing Order Price:'
     A            IMSOPR         9Y 4B 19 25DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A          R HBIN
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                 15  3' Area                             -
     A                                                                     Opti-
     A                                      onal   '
     A                                      DSPATR(RI)
     A                                 16  3'                                  -
     A                                                                         -
     A                                             '
     A                                 17  3' If you have defined areas of your-
     A                                       greenhouses or fields, you can use-
     A                                       this  '
     A                                 23  3'                                  -
     A                                                                         -
     A                                             '
     A                                 18  3' area field to designate the area -
     A                                      where this material can be found.  -
     A                                             '
     A                                 20  3' Only one area can be entered per -
     A                                      item/size/location combination.    -
     A                                             '
     A                                 22  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A                                 24  3'                                  -
     A                                                                         -
     A                                             '
     A                                 13  3'                                  -
     A                                                                         -
     A                                             '
     A                                 12  3'                                  -
     A                                                                         -
     A                                             '
     A                                 14  3'                                  -
     A                                                                         -
     A                                             '
     A                                 19  3'                                  -
     A                                                                         -
     A                                             '
     A                                 21  3'                                  -
     A                                                                         -
     A                                             '
     A          R HCO
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                 15  3' Company Number                   -
     A                                                                     Requ-
     A                                      ired   '
     A                                      DSPATR(RI)
     A                                 16  3'                                  -
     A                                                                         -
     A                                             '
     A                                 17  3' Enter the company number that sel-
     A                                      ls/grows this item number.  This it-
     A                                      em can '
     A                                 23  3'                                  -
     A                                                                         -
     A                                             '
     A                                 18  3' only be sold on orders entered fo-
     A                                      r this company.                    -
     A                                             '
     A                                 20  3' When adding a new item, this defa-
     A                                      ults to company #01.               -
     A                                             '
     A                                 22  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A                                 24  3'                                  -
     A                                                                         -
     A                                             '
     A                                 13  3'                                  -
     A                                                                         -
     A                                             '
     A                                 12  3'                                  -
     A                                                                         -
     A                                             '
     A                                 14  3'                                  -
     A                                                                         -
     A                                             '
     A                                 19  3'                                  -
     A                                                                         -
     A                                             '
     A                                 21  3'                                  -
     A                                                                         -
     A                                             '
     A          R HGENUS
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                 15  3' Genus                            -
     A                                                                     Requ-
     A                                      ired   '
     A                                      DSPATR(RI)
     A                                 16  3'                                  -
     A                                                                         -
     A                                             '
     A                                 17  3' Enter up to 30 characters that de-
     A                                      scribes the genus of this plant.   -
     A                                             '
     A                                 20  3' appropriate description.         -
     A                                                                         -
     A                                             '
     A                                 23  3'                                  -
     A                                                                         -
     A                                             '
     A                                 24  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A                                 13  3'                                  -
     A                                                                         -
     A                                             '
     A                                 12  3'                                  -
     A                                                                         -
     A                                             '
     A                                 14  3'                                  -
     A                                                                         -
     A                                             '
     A                                 19  3' If Genus does not apply, i.e. thi-
     A                                      s item is a pot, cover etc. enter t-
     A                                      he     '
     A                                 21  3'                                  -
     A                                                                         -
     A                                             '
     A                                 22  3' Only upper case letters can be us-
     A                                      ed in this description.            -
     A                                             '
     A                                 18  3'                                  -
     A                                                                         -
     A                                             '
     A          R HBALPHA
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                 16  3' Alpha Search                     -
     A                                                                     Requ-
     A                                      ired   '
     A                                      DSPATR(RI)
     A                                 17  3'                                  -
     A                                                                         -
     A                                             '
     A                                 18  3' To assist you in locating an item-
     A                                       when you do not know the item numb-
     A                                      er,    '
     A                                 23  3'                                  -
     A                                                                         -
     A                                             '
     A                                 19  3' you can enter up to 15 characters-
     A                                       to describe this item.            -
     A                                             '
     A                                 21  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A                                 24  3'                                  -
     A                                                                         -
     A                                             '
     A                                 14  3'                                  -
     A                                                                         -
     A                                             '
     A                                 13  3'                                  -
     A                                                                         -
     A                                             '
     A                                 12  3'                                  -
     A                                                                         -
     A                                             '
     A                                 11  3'                                  -
     A                                                                         -
     A                                             '
     A                                 15  3'                                  -
     A                                                                         -
     A                                             '
     A                                 22  3'                                  -
     A                                                                         -
     A                                             '
     A                                 20  3'                                  -
     A                                                                         -
     A                                             '
     A          R HVAR
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                 16  3' Variety                          -
     A                                                                     Opti-
     A                                      onal   '
     A                                      DSPATR(RI)
     A                                 17  3'                                  -
     A                                                                         -
     A                                             '
     A                                 18  3' Enter up to 30 characters that de-
     A                                      scribes the variety of this plant. -
     A                                             '
     A                                 23  3'                                  -
     A                                                                         -
     A                                             '
     A                                 24  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A                                 14  3'                                  -
     A                                                                         -
     A                                             '
     A                                 13  3'                                  -
     A                                                                         -
     A                                             '
     A                                 15  3'                                  -
     A                                                                         -
     A                                             '
     A                                 20  3' If Variety does not apply, enter -
     A                                      a second line of description if nee-
     A                                      ded.   '
     A                                 21  3'                                  -
     A                                                                         -
     A                                             '
     A                                 22  3' Upper and/or lower case letteres -
     A                                      can be used in this description.   -
     A                                             '
     A                                 19  3'                                  -
     A                                                                         -
     A                                             '
     A          R HSPEC
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                 16  3' Common Name                      -
     A                                                                     Opti-
     A                                      onal   '
     A                                      DSPATR(RI)
     A                                 17  3'                                  -
     A                                                                         -
     A                                             '
     A                                 18  3' Enter up to 30 characters that de-
     A                                      scribes the common name of this pla-
     A                                      nt.    '
     A                                 23  3'                                  -
     A                                                                         -
     A                                             '
     A                                 24  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A                                 14  3'                                  -
     A                                                                         -
     A                                             '
     A                                 13  3'                                  -
     A                                                                         -
     A                                             '
     A                                 15  3'                                  -
     A                                                                         -
     A                                             '
     A                                 20  3' If Common Name does not apply, en-
     A                                      ter a fourth line of description if-
     A                                       needed.'
     A                                 21  3'                                  -
     A                                                                         -
     A                                             '
     A                                 22  3' Upper and/or lower case letteres -
     A                                      can be used in this description.   -
     A                                             '
     A                                 19  3'                                  -
     A                                                                         -
     A                                             '
     A          R HNAME
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                 16  3' Species                          -
     A                                                                     Opti-
     A                                      onal   '
     A                                      DSPATR(RI)
     A                                 17  3'                                  -
     A                                                                         -
     A                                             '
     A                                 18  3' Enter up to 30 characters that de-
     A                                      scribes the species of this plant. -
     A                                             '
     A                                 23  3'                                  -
     A                                                                         -
     A                                             '
     A                                 24  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A                                 14  3'                                  -
     A                                                                         -
     A                                             '
     A                                 13  3'                                  -
     A                                                                         -
     A                                             '
     A                                 15  3'                                  -
     A                                                                         -
     A                                             '
     A                                 20  3' If Species does not apply, enter -
     A                                      a third line of description if need-
     A                                      ed.    '
     A                                 21  3'                                  -
     A                                                                         -
     A                                             '
     A                                 22  3' Upper and/or lower case letteres -
     A                                      can be used in this description.   -
     A                                             '
     A                                 19  3'                                  -
     A                                                                         -
     A                                             '
     A          R HUM1
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                 14  3' Unit of Measure #1               -
     A                                                                     Requ-
     A                                      ired   '
     A                                      DSPATR(RI)
     A                                 15  3'                                  -
     A                                                                         -
     A                                             '
     A                                 16  3' Enter the unit of measure that is-
     A                                       most often used for this item, for-
     A                                             '
     A                                 20  3' user documentation for a complete-
     A                                       description.                      -
     A                                             '
     A                                 17  3' example EA for each.             -
     A                                                                         -
     A                                             '
     A                                 19  3' usually be non plant material, su-
     A                                      ch as pots, covers etc.  refer to t-
     A                                      he     '
     A                                 21  3' This unit of measure must have be-
     A                                      en defined in the Unit of Measure M-
     A                                      aster  '
     A                                 18  3' If you maintain your inventory in-
     A                                       multiple units of measure, which w-
     A                                      ould   '
     A                                 23  3'                                  -
     A                                                                         -
     A                                             '
     A                                 12  3'                                  -
     A                                                                         -
     A                                             '
     A                                 13  3'                                  -
     A                                                                         -
     A                                             '
     A                                 22  3' File - #6 on the Company Master F-
     A                                      iles Menu.                         -
     A                                             '
     A                                 24  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A          R HUM2
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                 14  3' Units of Measure #2 & #3 / Multip-
     A                                      liers                          Opti-
     A                                      onal   '
     A                                      DSPATR(RI)
     A                                 15  3'                                  -
     A                                                                         -
     A                                             '
     A                                 16  3' Units of measure #2 and #3 allow -
     A                                      you to track intentory items stocke-
     A                                      d and/ '
     A                                 20  3' The multiplier field is required -
     A                                      if you enter data in the 2nd or 3rd-
     A                                       unit. '
     A                                 17  3' or sold in different units of mea-
     A                                      sure.  For example, you may stock p-
     A                                      ots    '
     A                                 21  3' The multiplier defines the relati-
     A                                      onship between units, i.e., 24 each-
     A                                      s to   '
     A                                 18  3' by the carton, but would sell the-
     A                                      m by either the carton on by the ea-
     A                                      ch.    '
     A                                 23  3'                                  -
     A                                                                         -
     A                                             '
     A                                 12  3'                                  -
     A                                                                         -
     A                                             '
     A                                 13  3'                                  -
     A                                                                         -
     A                                             '
     A                                 22  3' a carton.  Refer to the user docu-
     A                                      mentation for a complete descriptio-
     A                                      n.     '
     A                                 24  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A          R HPRICE
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                  4  2'   Pricing                        -
     A                                                                       Op-
     A                                      tional   '
     A                                      DSPATR(RI)
     A                                  5  2'                                  -
     A                                                                         -
     A                                               '
     A                                  6  2'   You can enter up to 5 prices fo-
     A                                      r each unit of measure that you hav-
     A                                      e entered'
     A                                 12  2'                            Press -
     A                                      Enter to Return                    -
     A                                               '
     A                                      DSPATR(RI)
     A                                  7  2'   Usually there is a reason for e-
     A                                      ach price, i.e., price 1 may be the-
     A                                       price   '
     A                                  3  2'                                  -
     A                                                                         -
     A                                               '
     A                                  8  2'   charged to retailers, price 2 t-
     A                                      o wholesalers, price 3 to brokers e-
     A                                      tc.      '
     A                                 10  2'   Refer to your documentation for-
     A                                       a complete explanation of pricing.-
     A                                               '
     A                                  9  2'                                  -
     A                                                                         -
     A                                               '
     A                                 11  2'                                  -
     A                                                                         -
     A                                               '
     A          R HQTYB
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                  4  4' Quantity Breaks                  -
     A                                                                     Opti-
     A                                      onal   '
     A                                      DSPATR(RI)
     A                                  5  4'                                  -
     A                                                                         -
     A                                             '
     A                                  6  3'  You can allow customers to recei-
     A                                      ve a discount on their standard pri-
     A                                      ce with  '
     A                                  7  4' quantity discounts.  Quantity 1. -
     A                                      is the lowest number they must buy -
     A                                      in     '
     A                                 11  4' In this example: Enter 10 in quan-
     A                                      tity 1 and 5.00 in discount 1.     -
     A                                             '
     A                                  2  4'                                  -
     A                                                                         -
     A                                             '
     A                                  3  4'                                  -
     A                                                                         -
     A                                             '
     A                                  8  4' order to get the discount.  For e-
     A                                      xample: Quantities from 10 - 25 get-
     A                                       a 5%  '
     A                                  9  4' discount and quantities above 25 -
     A                                      get a 10% discount.                -
     A                                             '
     A                                 12  4'                  Enter 999999999.-
     A                                      9 in quantity 2 and 10.00 in discou-
     A                                      nt 2.  '
     A                                 10  4'                                  -
     A                                                                         -
     A                                             '
     A                                 13  4'                                  -
     A                                                                         -
     A                                             '
     A                                 14  4'                          Press En-
     A                                      ter to Return                      -
     A                                             '
     A                                      DSPATR(RI)
     A          R HPUM
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                  4  4' Pricing Unit Of Measure          -
     A                                                                     Requ-
     A                                      ired   '
     A                                      DSPATR(RI)
     A                                  5  4'                                  -
     A                                                                         -
     A                                             '
     A                                  6  3'  This is the default unit of meas-
     A                                      ure that is used by order entry/bil-
     A                                      ling     '
     A                                  7  4' when this item is ordered.  It mu-
     A                                      st be the same as a unit of measure-
     A                                       that  '
     A                                  2  4'                                  -
     A                                                                         -
     A                                             '
     A                                  3  4'                                  -
     A                                                                         -
     A                                             '
     A                                  8  4' has been defined in unit of measu-
     A                                      re 1, 2, or 3.                     -
     A                                             '
     A                                  9  4'                                  -
     A                                                                         -
     A                                             '
     A                                 10  4'                          Press En-
     A                                      ter to Return                      -
     A                                             '
     A                                      DSPATR(RI)
     A          R HAVCST
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                  4  4' Average Cost                     -
     A                                                                     Opti-
     A                                      onal   '
     A                                      DSPATR(RI)
     A                                  5  4'                                  -
     A                                                                         -
     A                                             '
     A                                  6  3'  Is usually used for items that y-
     A                                      ou purchase for resale.   When an i-
     A                                      tem is   '
     A                                  7  4' entered for the first time, you m-
     A                                      ay enter an average cost.  Now, eve-
     A                                      ry time'
     A                                  2  4'                                  -
     A                                                                         -
     A                                             '
     A                                  3  4'                                  -
     A                                                                         -
     A                                             '
     A                                  8  4' you enter a receipt for this item-
     A                                       with a cost, this average cost fie-
     A                                      ld will'
     A                                  9  4' be recalculated.  This is the cos-
     A                                      t field used in TGMS to calculate p-
     A                                      rofit- '
     A                                 11  4'                                  -
     A                                                                         -
     A                                             '
     A                                 10  4' ability in sales and inventory an-
     A                                      alysis reports.                    -
     A                                             '
     A                                 12  4'                          Press En-
     A                                      ter to Return                      -
     A                                             '
     A                                      DSPATR(RI)
     A          R HLSCST
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                  4  4' Last Cost                        -
     A                                                                     Opti-
     A                                      onal   '
     A                                      DSPATR(RI)
     A                                  5  4'                                  -
     A                                                                         -
     A                                             '
     A                                  6  3'  Is usually used for items that y-
     A                                      ou purchase for resale.   When an i-
     A                                      tem is   '
     A                                  7  4' entered for the first time, you m-
     A                                      ay enter a last cost.  Now, every t-
     A                                      ime    '
     A                                  2  4'                                  -
     A                                                                         -
     A                                             '
     A                                  3  4'                                  -
     A                                                                         -
     A                                             '
     A                                  8  4' you enter a receipt for this item-
     A                                       with a cost, this last cost field -
     A                                      will   '
     A                                  9  4' be replaced with the cost of the -
     A                                      last receipt.                      -
     A                                             '
     A                                 11  4'                          Press En-
     A                                      ter to Return                      -
     A                                             '
     A                                      DSPATR(RI)
     A                                 10  4'                                  -
     A                                                                         -
     A                                             '
     A          R SCRNC
     A*%%TS  SD  20010503  151217  JEFF        REL-V3R7M0  5716-PW1
     A                                      CF02
     A                                      CF06
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF22
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A          H                           HLPRCD(HTAX)
     A  *DS3                                HLPARA(15 012 15 017)
     A  *DS4                                HLPARA(15 012 15 017)
     A          H                           HLPRCD(HBACK)
     A  *DS3                                HLPARA(13 067 13 067)
     A  *DS4                                HLPARA(13 067 13 067)
     A          H                           HLPRCD(HVENDI)
     A  *DS3                                HLPARA(15 051 15 080)
     A  *DS4                                HLPARA(15 051 15 080)
     A          H                           HLPRCD(HROYAL)
     A  *DS3                                HLPARA(15 029 15 036)
     A  *DS4                                HLPARA(15 029 15 036)
     A          H                           HLPRCD(HTAX)
     A  *DS3                                HLPARA(09 024 09 062)
     A  *DS4                                HLPARA(09 024 09 062)
     A          H                           HLPRCD(HSLSHIS)
     A  *DS3                                HLPARA(12 034 12 034)
     A  *DS4                                HLPARA(12 034 12 034)
     A          H                           HLPRCD(HGLSLS)
     A  *DS3                                HLPARA(17 070 17 078)
     A  *DS4                                HLPARA(17 070 17 078)
     A                                  1  2'ICV010C'
     A                                  1 28' ITEM MASTER MAINTENANCE '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  2  2USER
     A            VMODE         10A  O  2 36DSPATR(RI)
     A                                  2 67'Time:'
     A                                  4  2'Item:'
     A            IMITEM        12A  O  4  9
     A                                  4 23'Size:'
     A            IMSIZE         3A  O  4 30
     A                                  4 36'Loc:'
     A            IMWHSE         3A  O  4 42
     A                                  4 48'Area:'
     A            IMBIN#         6A  O  4 54
     A                                  4 63'Company:'
     A            IMCOMP         2S 0O  4 73
     A                                  5  2'Genus:'
     A            IMDES1        30A  O  5  9
     A                                  5 42'Species:'
     A            IMDES2        30A  O  5 51
     A                                  7  2'Product Classes?'
     A                                      DSPATR(UL)
     A                                  7 21'1.'
     A            IMPCL1         2A  B  7 24DSPATR(CS)
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A  30                                  ERRMSG('*** Enter a Valid Product C-
     A                                      lass.    Press Reset')
     A                                  7 29'2.'
     A            IMPCL2         2A  B  7 32DSPATR(CS)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A  31                                  ERRMSG('*** Enter a Valid Product C-
     A                                      lass.     Press Reset')
     A                                  7 37'3.'
     A            IMPCL3         2A  B  7 40DSPATR(CS)
     A                                  9  2'Tax Codes:'
     A                                      DSPATR(UL)
     A                                  9 14'Taxable:'
     A            IMTXBL         1X  B  9 24DSPATR(CS)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A  33N32                               ERRMSG('*** Valid Entries are Y or -
     A                                      N.        Press Reset')
     A  33 32                               ERRMSG('*** Tax Status conflicts wi-
     A                                      th List Code.     Press RESET')
     A                                  9 29'State:'
     A            IMTCD1         1X  B  9 37DSPATR(CS)
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A  34N32                               ERRMSG('*** Valid Entries are Y or -
     A                                      N.        Press Reset')
     A  34 32                               ERRMSG('*** Tax Status Conflicts Wi-
     A                                      th List Code.    Press RESET')
     A                                  9 42'County:'
     A            IMTCD2         1X  B  9 51DSPATR(CS)
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A  35                                  ERRMSG('*** Valid Entries are Y or -
     A                                      N.        Press Reset')
     A                                      DSPATR(PR)
     A                                  9 55'City:'
     A            IMTCD3         1X  B  9 62DSPATR(CS)
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A  36                                  ERRMSG('*** Valid Entries are Y or -
     A                                      N.        Press Reset')
     A                                      DSPATR(PR)
     A                                 11 10'Lot Control:'
     A            IMLOTC         1X  B 11 34DSPATR(CS)
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A  37                                  ERRMSG('*** Valid Entries are Y or -
     A                                      N.        Press Reset')
     A                                 11 43'Force Allocation:'
     A            IMLHST         1X  B 11 67DSPATR(CS)
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A  38                                  ERRMSG('*** Valid Entries are Y or -
     A                                      N.        Press Reset')
     A                                 12 10'Detail Sales History:'
     A            IMDSHF         1X  B 12 34DSPATR(CS)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A  39                                  ERRMSG('*** Valid Entries are Y or -
     A                                      N.        Press Reset')
     A                                 12 43'Print on Price List:'
     A            IMPRPL         1X  B 12 67DSPATR(CS)
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A  40                                  ERRMSG('*** Valid Entries are Y or -
     A                                      N.        Press Reset')
     A                                 13 10'Consolidate Qty''s:'
     A            IMCNSF         1X  B 13 34DSPATR(CS)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A  41                                  ERRMSG('*** Valid Entries are Y or -
     A                                      N.        Press Reset')
     A                                 13 43'Allow Backorder:'
     A            IMBOOK         1X  B 13 67DSPATR(CS)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A  42                                  ERRMSG('*** Valid Entries are Y or -
     A                                      N.        Press Reset')
     A                                 15  2'Vendor #:'
     A            IMVEND         6Y 0B 15 12EDTCDE(Z)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A  43                                  ERRMSG('*** This Is Not a Valid Ven-
     A                                      dor Number.    Press Reset')
     A  46                                  ERRMSG('*** Vendor# is Required (Us-
     A                                      e "F22" to Bypass).  Press Reset')
     A                                 15 40'Vend Item:'
     A            IMVITM        30A  B 15 51DSPATR(CS)
     A                                 17  2'Reorder Point:'
     A            IMQEOQ        11Y 1B 17 18DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 17 39'G/L Accts:'
     A                                      DSPATR(UL)
     A                                 17 51'Merchandise Sales '
     A            IMMERC         8Y 0B 17 70EDTWRD('    -    ')
     A                                      DSPATR(CS)
     A  57                                  ERRMSG('*** Enter a Valid G/L Numbe-
     A                                      r.     Press Reset')
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A                                 18  2'Quantity:'
     A            IMQREO        11Y 1B 18 18DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 18 51'Cost of Goods '
     A            IMCOGS         8Y 0B 18 70EDTWRD('    -    ')
     A                                      DSPATR(CS)
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A  58                                  ERRMSG('*** Enter a Valid G/L Numbe-
     A                                      r.     Press Reset')
     A                                 19  2'Lead Time Days:'
     A            IMLEAD         3Y 0B 19 27DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A                                 19 51'Inventory '
     A            IMINVN         8Y 0B 19 70EDTWRD('    -    ')
     A                                      DSPATR(CS)
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A  59                                  ERRMSG('*** Enter a Valid G/L Numbe-
     A                                      r.     Press Reset')
     A                                 21  2'Cycle Count Code'
     A            IMCYCD         2A  B 21 22DSPATR(CS)
     A                                      DSPATR(MDT)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'Enter/Process  F2=Prior  F6=Restar-
     A                                      t  F3/F7=EOJ  F4=Vend Lookup  F5=G/-
     A                                      L Lookup '
     A                                      DSPATR(UL)
     A                                 15 20'Royalty:'
     A            IMROYL         7Y 4B 15 29
     A  65                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  65                                  DSPATR(PC)
     A  65                                  ERRMSG('*** Royalty Amount Not Allo-
     A                                      wed if Vendor Number is Blank.    P-
     A                                      ress Reset')
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  7 43'P.C. For Qty Disc and Price Change-
     A                                      s.'
     A          R HTAX
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                 14  2' Taxes                            -
     A                                                                     Requ-
     A                                      ired   '
     A                                      DSPATR(RI)
     A                                 15  2'                                  -
     A                                                                         -
     A                                             '
     A                                 16  2'     If this Item is Tax Exempt - -
     A                                      Enter Y.  If Taxable - Enter N.    -
     A                                             '
     A                                 21  2'                                  -
     A                                                                         -
     A                                             '
     A                                 17  2'                                  -
     A                                                                         -
     A                                             '
     A                                 19  2' If non-taxable - enter N in each -
     A                                      taxing body.   Refer to help in Tax-
     A                                             '
     A                                 20  2' Jurisdiction Master File for furt-
     A                                      her information on tax.            -
     A                                             '
     A                                 18  2' If item is taxable enter Y or N f-
     A                                      or each taxing body, state, count &-
     A                                       city. '
     A                                 22  2'                            Press -
     A                                      Enter to Retrun                    -
     A                                             '
     A                                      DSPATR(RI)
     A          R HSLSHIS
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                  3  3' Post Detail Sales History        -
     A                                                                     Requ-
     A                                      ired   '
     A                                      DSPATR(RI)
     A                                  4  3'                                  -
     A                                                                         -
     A                                             '
     A                                  5  3' If an Item is coded Y - sales his-
     A                                      tory will be maintained for all sal-
     A                                      es of  '
     A                                 10  3'                                  -
     A                                                                         -
     A                                             '
     A                                  6  3' this item by all customers.  If c-
     A                                      oded N - only sales summary totals -
     A                                      will be'
     A                                  8  3'                                  -
     A                                                                         -
     A                                             '
     A                                 24  3'                                  -
     A                                                                         -
     A                                             '
     A                                 11  3'                                  -
     A                                                                         -
     A                                             '
     A                                  9  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A                                  7  3' maintained for this item.   Valid-
     A                                       entries are Y or N.               -
     A                                             '
     A                                  2  3'                                  -
     A                                                                         -
     A                                             '
     A          R HBACK
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                  3  3' Allow Backorders                 -
     A                                                                     Requ-
     A                                      ired   '
     A                                      DSPATR(RI)
     A                                  4  3'                                  -
     A                                                                         -
     A                                             '
     A                                  5  3' During shipment confirmation, can-
     A                                       you allow unshipped quantities to -
     A                                      be     '
     A                                 10  3'                                  -
     A                                                                         -
     A                                             '
     A                                  6  3' backordered.  If "N" is entered i-
     A                                      n this field, the quantity balance -
     A                                      on     '
     A                                  8  3'                                  -
     A                                                                         -
     A                                             '
     A                                 24  3'                                  -
     A                                                                         -
     A                                             '
     A                                 11  3'                                  -
     A                                                                         -
     A                                             '
     A                                  9  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A                                  7  3' partial shipments must be cancell-
     A                                      ed.                                -
     A                                             '
     A                                  2  3'                                  -
     A                                                                         -
     A                                             '
     A          R HVEND
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                  3  3' Vendor Number                    -
     A                                                                     Opti-
     A                                      onal   '
     A                                      DSPATR(RI)
     A                                  4  3'                                  -
     A                                                                         -
     A                                             '
     A                                  5  3' The Vendor Number could be either-
     A                                       the company from whom you purchase-
     A                                       this  '
     A                                 10  3'                                  -
     A                                                                         -
     A                                             '
     A                                  6  3' item, or the company to whom you -
     A                                      pay royalties when you sell this it-
     A                                      em.    '
     A                                  8  3'                                  -
     A                                                                         -
     A                                             '
     A                                 24  3'                                  -
     A                                                                         -
     A                                             '
     A                                 11  3'                                  -
     A                                                                         -
     A                                             '
     A                                  9  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A                                  7  3' This must be a valid vendor in yo-
     A                                      ur Vendor Master File.             -
     A                                             '
     A                                  2  3'                                  -
     A                                                                         -
     A                                             '
     A          R HROYAL
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                  3  3' Royalty Amount                   -
     A                                                                     Opti-
     A                                      onal   '
     A                                      DSPATR(RI)
     A                                  4  3'                                  -
     A                                                                         -
     A                                             '
     A                                  5  3' If you pay a royalty when this it-
     A                                      em is sold, enter the amount of roy-
     A                                      alty   '
     A                                 10  3'                                  -
     A                                                                         -
     A                                             '
     A                                  6  3' paid per pricing unit of measure.-
     A                                         If a royalty amount is entered, -
     A                                      a      '
     A                                  8  3'                                  -
     A                                                                         -
     A                                             '
     A                                 24  3'                                  -
     A                                                                         -
     A                                             '
     A                                 11  3'                                  -
     A                                                                         -
     A                                             '
     A                                  9  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A                                  7  3' valid vendor number must also be -
     A                                      entered.                           -
     A                                             '
     A                                  2  3'                                  -
     A                                                                         -
     A                                             '
     A          R HVENDI
     A*%%TS  SD  19960422  155929  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                  3  3' Vendor Number Number             -
     A                                                                     Opti-
     A                                      onal   '
     A                                      DSPATR(RI)
     A                                  4  3'                                  -
     A                                                                         -
     A                                             '
     A                                  5  3' If you purchase this item from a -
     A                                      single vendor, you can enter the ve-
     A                                      ndors  '
     A                                 10  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A                                  6  3' number for this item.   If you pr-
     A                                      int purchase orders in TGMS, this i-
     A                                      tem    '
     A                                  8  3' vendor.                          -
     A                                                                         -
     A                                             '
     A                                 24  3'                                  -
     A                                                                         -
     A                                             '
     A                                 11  3'                                  -
     A                                                                         -
     A                                             '
     A                                  9  3'                                  -
     A                                                                         -
     A                                             '
     A                                  7  3' number will print on the purchase-
     A                                       order when you order this item fro-
     A                                      m this '
     A                                  2  3'                                  -
     A                                                                         -
     A                                             '
     A          R HGLSLS
     A*%%TS  SD  19960618  122025  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                  3  3' Merchandise Sales                -
     A                                                                     Opti-
     A                                      onal   '
     A                                      DSPATR(RI)
     A                                  4  3'                                  -
     A                                                                         -
     A                                             '
     A                                  5  3' Enter the G/L revenue account whi-
     A                                      ch should be posted for sales of th-
     A                                      is     '
     A                                 10  3'                                  -
     A                                                                         -
     A                                             '
     A                                  6  3' item.   If the G/L account number-
     A                                       is the same as the default account-
     A                                       number'
     A                                  8  3'                                  -
     A                                                                         -
     A                                             '
     A                                 24  3'                                  -
     A                                                                         -
     A                                             '
     A                                 11  3'                                  -
     A                                                                         -
     A                                             '
     A                                  9  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A                                  7  3' in your G/L posting defaults for -
     A                                      Sales - no account needs to be ente-
     A                                      red.   '
     A                                  2  3'                                  -
     A                                                                         -
     A                                             '
     A          R SCRND
     A*%%TS  SD  20010314  170623  EFD         REL-V3R7M0  5716-PW1
     A                                      CF02
     A                                      CF06
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF03
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A          H                           HLPRCD(HSQFT)
     A  *DS3                                HLPARA(07 036 07 041)
     A  *DS4                                HLPARA(07 036 07 041)
     A          H                           HLPRCD(HWKSAV)
     A  *DS3                                HLPARA(18 073 18 074)
     A  *DS4                                HLPARA(18 073 18 074)
     A                                  1  2'ICV010D'
     A                                  1 28' ITEM MASTER MAINTENANCE '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A            VMODE         10A  O  2 36DSPATR(RI)
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  4  2'Item:'
     A            IMITEM        12A  O  4  9
     A                                  4 23'Size:'
     A            IMSIZE         3A  O  4 30
     A                                  4 36'Loc:'
     A            IMWHSE         3A  O  4 42
     A                                  4 48'Bin:'
     A            IMBIN#         6A  O  4 54
     A                                  4 63'Company:'
     A            IMCOMP         2S 0O  4 73
     A                                  5  2'Genus:'
     A            IMDES1        30A  O  5  9
     A                                  5 42'Species:'
     A            IMDES2        30A  O  5 51
     A                                  7  2'Square Feet Per Unit of Measure:'
     A            IMCUBE         5Y 2B  7 36EDTWRD('   .  ')
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A                                  7 49'Unit Weight:'
     A            IMUWGT        11Y 4B  7 63EDTWRD('       .    ')
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A                                  9  7'Production Weeks:'
     A                                  9 29'Begin MM/DD'
     A                                      DSPATR(UL)
     A                                  9 43'End MM/DD'
     A                                      DSPATR(UL)
     A                                  9 55'Weeks'
     A                                      DSPATR(UL)
     A                                 10 27'1.'
     A            IMBD1          4Y 0B 10 33EDTWRD('  /  ')
     A                                      DSPATR(CS)
     A  72                                  DSPATR(RI)
     A  72                                  DSPATR(PC)
     A  72                                  ERRMSG('*** Both Dates Are Required-
     A                                      .     Press Reset')
     A            IMED1          4Y 0B 10 45EDTWRD('  /  ')
     A                                      DSPATR(CS)
     A            IMWG1          2Y 0B 10 57EDTCDE(Z)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A  76                                  DSPATR(RI)
     A  76                                  DSPATR(PC)
     A  76                                  ERRMSG('*** # Of Weeks Is Required.-
     A                                          Press Reset')
     A                                 11 27'2.'
     A            IMBD2          4Y 0B 11 33EDTWRD('  /  ')
     A                                      DSPATR(CS)
     A  73                                  DSPATR(RI)
     A  73                                  DSPATR(PC)
     A  73                                  ERRMSG('*** Both Dates Are Required-
     A                                      .    Press Reset')
     A            IMED2          4Y 0B 11 45EDTWRD('  /  ')
     A                                      DSPATR(CS)
     A            IMWG2          2Y 0B 11 57EDTCDE(Z)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A  77                                  DSPATR(RI)
     A  77                                  DSPATR(PC)
     A  77                                  ERRMSG('*** # Of Weeks Is Required.-
     A                                          Press Reset')
     A                                 12 27'3.'
     A            IMBD3          4Y 0B 12 33EDTWRD('  /  ')
     A                                      DSPATR(CS)
     A  74                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
     A  74                                  ERRMSG('*** Both Dates Are Required-
     A                                      .    Press Reset')
     A            IMED3          4Y 0B 12 45EDTWRD('  /  ')
     A                                      DSPATR(CS)
     A            IMWG3          2Y 0B 12 57EDTCDE(Z)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A  78                                  DSPATR(RI)
     A  78                                  DSPATR(PC)
     A  78                                  ERRMSG('*** # Of Weeks Is Required.-
     A                                           Press Reset')
     A                                 13 27'4.'
     A            IMBD4          4Y 0B 13 33EDTWRD('  /  ')
     A                                      DSPATR(CS)
     A  75                                  DSPATR(RI)
     A  75                                  DSPATR(PC)
     A  75                                  ERRMSG('*** Both Dates Are Required-
     A                                      .     Press Reset')
     A            IMED4          4Y 0B 13 45EDTWRD('  /  ')
     A                                      DSPATR(CS)
     A            IMWG4          2Y 0B 13 57EDTCDE(Z)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A  79                                  DSPATR(RI)
     A  79                                  DSPATR(PC)
     A  79                                  ERRMSG('*** # Of Weeks Is Required.-
     A                                            Press Reset')
     A                                 15  2'Production'
     A                                 15 16'Flower Code:'
     A            IMSOWC         1A  B 15 37DSPATR(PR)
     A                                      DSPATR(UL)
     A                                 15 44'Seeds Per Cell:'
     A            IM#SED         2Y 0B 15 73DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A                                 16  2'Parameters:'
     A                                 16 16'Product Type:'
     A            IMTRYC         1A  B 16 37DSPATR(PR)
     A                                      DSPATR(UL)
     A                                 16 44'Type of Sowing:'
     A            IMTPSW         1A  B 16 74DSPATR(CS)
     A                                 17 16'Location Code:'
     A            IMLOC          2A  B 17 36DSPATR(CS)
     A                                 17 44'Misc. Codes:'
     A            IMMSCX         2A  B 17 73DSPATR(CS)
     A                                 18 16'Factor Table ID:'
     A            IMFTAB         2A  B 18 36DSPATR(CS)
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A  48                                  ERRMSG('*** This is not a Valid Tab-
     A                                      le ID.     Press Reset')
     A                                 18 44'Weeks Avail After Ready:'
     A            IMWKAV         2Y 0B 18 73DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                 19 16'List Code?'
     A            IMLIST         4A  B 19 34DSPATR(UL)
     A                                      DSPATR(PR)
     A  80                                  DSPATR(RI)
     A  80                                  ERRMSG('*** List Code is Invalid Ch-
     A                                      eck PRODUCT File or List Code File.-
     A                                        Press Reset')
     A                                 19 44'Transplant/Sow From Size?'
     A            IMFRSZ         3A  B 19 72DSPATR(CS)
     A  81                                  DSPATR(RI)
     A  81                                  DSPATR(PC)
     A  81                                  ERRMSG('*** Enter A Valid Size Code-
     A                                      .     Press Reset')
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'Enter to Process      F2=Prior Scr-
     A                                      een      F6=Restart      F3/F7=End -
     A                                      of Job   '
     A                                      DSPATR(UL)
     A          R HSQFT
     A*%%TS  SD  19960423  094213  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                 18  3' Square Feet Per Unit of Measure  -
     A                                                                     Opti-
     A                                      onal   '
     A                                      DSPATR(RI)
     A                                 19  3'                                  -
     A                                                                         -
     A                                             '
     A                                 20  3' Defines the total square feet of -
     A                                      this item for the primary unit of m-
     A                                      easure.'
     A                                 21  3' If the square footage for a flat -
     A                                      of marigolds is 1.76, enter 1.76.  -
     A                                             '
     A                                 23  3'                                  -
     A                                                                         -
     A                                             '
     A                                 24  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A                                 22  3' This information is used by the s-
     A                                      pace allocation report.            -
     A                                             '
     A          R HWKSAV
     A*%%TS  SD  19960507  104609  GINNY       REL-V3R1M0  5763-PW1
     A                                      CLRL(*NO)
     A                                 17  3' Weeks Available After Ready      -
     A                                                                     Opti-
     A                                      onal   '
     A                                      DSPATR(RI)
     A                                 18  3'                                  -
     A                                                                         -
     A                                             '
     A                                 19  3' Defines the number of weeks an it-
     A                                      em should be able to be sold after -
     A                                      receipt'
     A                                 20  3' into inventory.  The quantity ava-
     A                                      ilable is affected by this field.  -
     A                                      If 10  '
     A                                 23  3'                                  -
     A                                                                         -
     A                                             '
     A                                 24  3'                           Press E-
     A                                      nter to Return                     -
     A                                             '
     A                                      DSPATR(RI)
     A                                 21  3' flats of pansys are received on 1-
     A                                      /1/YY and weeks available is 02, th-
     A                                      en if  '
     A                                 22  3' none are sold and it is now 1/15/-
     A                                      YY, availability is 0.             -
     A                                             '
     A          R SCRSERR
     A*%%TS  SD  19971023  204835  EFD         REL-V3R6M0  5716-PW1
     A                                      CF06
     A                                      CF07
     A                                      CF03
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                  1  2'ICV010SERR'
     A                                  1 28' ITEM MASTER MAINTENANCE '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  4  2'Item:'
     A            IMITEM        12   O  4  8
     A                                  4 22'Size:'
     A            IMSIZE         3A  O  4 28
     A                                  4 34'Loc:'
     A            IMWHSE         3A  O  4 39
     A                                  4 46'Area:'
     A            VWHLOC         6A  B  4 52DSPATR(CS)
     A                                      CHECK(LC)
     A                                  4 61'Company:'
     A            IMCOMP         2Y 0B  4 71EDTCDE(3)
     A  20                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  20                                  DSPATR(PC)
     A  20                                  ERRMSG('*** Invalid Company Number -
     A                                      Entered.   Press Reset')
     A                                  6  4'Genus:'
     A            IMDES1        30A  B  6 14DSPATR(UL)
     A                                      DSPATR(PR)
     A                                  6 48'Alpha Search:'
     A            IMLOOK        15A  B  6 64DSPATR(UL)
     A                                      DSPATR(PR)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'           Enter to Process      F-
     A                                      6=Restart      F3/F7=End of Job    -
     A                                               '
     A                                      DSPATR(UL)
     A                                  8  4' No Record exists in the Dillon PR-
     A                                      ODUCT File. Go to another session o-
     A                                      r '
     A  85                                  DSPATR(RI)
     A N85                                  DSPATR(ND)
     A                                  9  4' workstation and add this item to -
     A                                      the Dillon PRODUCT File. Then retur-
     A                                      n '
     A  85                                  DSPATR(RI)
     A N85                                  DSPATR(ND)
     A                                 10  4' here and Press ENTER to retry.   -
     A                                                                         -
     A                                        '
     A  85                                  DSPATR(RI)
     A N85                                  DSPATR(ND)
     A                                 11  4' There is no Cross reference recor-
     A                                      d for this Item. '
     A  86                                  DSPATR(RI)
     A N86                                  DSPATR(ND)
     A                                 12  4' Enter Dillon Product Code:'
     A  86                                  DSPATR(RI)
     A N86                                  DSPATR(ND)
     A            PRDCDE        10A  B 12 32
     A  86                                  DSPATR(RI)
     A  86                                  DSPATR(CS)
     A N86                                  DSPATR(ND)
     A  86                                  DSPATR(PC)
     A  86 99                               ERRMSG('*** Invalid Dillon Product -
     A                                      Code.      Press RESET')
     A                                 14  4' There is a Flower Code Mis-match -
     A                                      with the Dillon Product Code. '
     A  87                                  DSPATR(RI)
     A N87                                  DSPATR(ND)
     A                                 15  4' Press F3/F7 to End Job or F6 to s-
     A                                      tart with another Item Number.'
     A  87                                  DSPATR(RI)
     A N87                                  DSPATR(ND)
     A            DESC          25A  O 12 43
     A N86
     AO 99                                  DSPATR(ND)
