     A*%%TS  SD  20091110  152830  BILLB       REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      MSGALARM
     A          R ICR01401
     A*%%TS  SD  20091110  152830  BILLB       REL-V5R3M0  5722-WDS
     A                                      CF03(03 'Exit')
     A                                      CF05(05 'Refresh')
     A                                      CF09(09 'Import Description')
     A                                      CF04(04 'Lookup Vendor')
     A                                      OVERLAY
     A                                  1  2'ICR01401'
     A                                      COLOR(BLU)
     A                                  2  2USER
     A                                      COLOR(BLU)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 73TIME
     A                                      COLOR(BLU)
     A                                  1 21'    Add Vendor Item Cross Referenc-
     A                                      e     '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                 23 21'F3'
     A                                      DSPATR(HI)
     A                                 23 24'=Exit'
     A                                      COLOR(BLU)
     A                                 23  3'ENTER'
     A                                      DSPATR(HI)
     A                                 23  9'=Process'
     A                                      COLOR(BLU)
     A                                  6 26'Our'
     A                                  6 30'Item:'
     A            ITM_IMITEMR        O  6 36REFFLD(RMINVT/IMITEM *LIBL/FMINVT)
     A                                      DSPATR(HI)
     A            ITM_IMDES1R        O  7 26REFFLD(RMINVT/IMDES1 *LIBL/FMINVT)
     A                                      COLOR(PNK)
     A            ITM_IMDES2R        O  8 26REFFLD(RMINVT/IMDES2 *LIBL/FMINVT)
     A                                      COLOR(PNK)
     A                                 11 28'Vendor:'
     A            VIVEND    R        B 11 36REFFLD(RMINVTVEND/VIVEND *LIBL/FMIN-
     A                                      VTVEND)
     A                                      COLOR(YLW)
     A                                 12 23'Vendor Item:'
     A            VIVITM    R        B 12 36REFFLD(RMINVTVEND/VIVITM *LIBL/FMIN-
     A                                      VTVEND)
     A                                      COLOR(YLW)
     A            VIDES1    R        B 15  4REFFLD(RMINVTVEND/VIDES1 *LIBL/FMIN-
     A                                      VTVEND)
     A                                      COLOR(YLW)
     A            VIDES2    R        B 16  4REFFLD(RMINVTVEND/VIDES2 *LIBL/FMIN-
     A                                      VTVEND)
     A                                      COLOR(YLW)
     A                                 14  4'Vendor Item Description'
     A                                      DSPATR(UL)
     A                                 23 57'F9'
     A                                      DSPATR(HI)
     A                                 23 60'=Import Description'
     A                                      COLOR(BLU)
     A            VMNAME    R        B 11 44REFFLD(RMVEND/VMNAME *LIBL/FMVEND)
     A                                      COLOR(BLU)
     A                                 23 33'F4'
     A                                      DSPATR(HI)
     A                                 23 36'=Lookup Vendor #'
     A                                      COLOR(BLU)
     A          R MSGDATA                   SFL
     A*%%TS  SD  20040405  131906  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages')
     A  *DS4                                SFLMSGRCD(24)
     A            $#MSKY                    SFLMSGKEY
     A            $#PGMQ                    SFLPGMQ(10)
     A          R MSGCTL                    SFLCTL(MSGDATA)
     A*%%TS  SD  20040406  091800  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages Control')
     A  50                                  ALARM
     A                                      OVERLAY
     A N92                                  SFLDSP
     A N92                                  SFLDSPCTL
     A N92                                  SFLINZ
     A N92                                  SFLEND
     A  *DS4                                SFLSIZ(0002)
     A  *DS4                                SFLPAG(0001)
     A            $#PGMQ                    SFLPGMQ(10)
     A          R ASSUME
     A*%%TS  SD  20040423  114217  BILLB       REL-V5R1M0  5722-WDS
     A                                      ASSUME
     A                                  1  3' ASSUME                           -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                  '
