     A*%%TS  SD  20090408  102345  BILLB       REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      INDARA
     A                                      VLDCMDKEY(48 'Valid Function Key Pr-
     A                                      essed')
     A          R ICR04501                  SFL
     A*%%TS  SD  20090408  102345  BILLB       REL-V5R3M0  5722-WDS
     A  28                                  SFLNXTCHG
     A            SZCODE    R        B  6  2REFFLD(RMSIZE/SZCODE *LIBL/FMSIZE)
     A                                      DSPATR(PR)
     A            SZDESC    R        B  6  7REFFLD(RMSIZE/SZDESC *LIBL/FMSIZE)
     A N30                                  DSPATR(PR)
     A  30                                  DSPATR(CS)
     A  30                                  COLOR(YLW)
     A            SZCUBF    R        B  6 19REFFLD(RMSIZE/SZCUBF *LIBL/FMSIZE)
     A N30                                  DSPATR(PR)
     A  30                                  DSPATR(CS)
     A  30                                  COLOR(YLW)
     A            SZPERC    R        B  6 29REFFLD(RMSIZE/SZPERC *LIBL/FMSIZE)
     A N30                                  DSPATR(PR)
     A  30                                  DSPATR(CS)
     A  30                                  COLOR(YLW)
     A            SZCELL    R        B  6 35REFFLD(RMSIZE/SZCELL *LIBL/FMSIZE)
     A N30                                  DSPATR(PR)
     A  30                                  DSPATR(CS)
     A  30                                  COLOR(YLW)
     A            SZSALE    R        B  6 41REFFLD(RMSIZE/SZSALE *LIBL/FMSIZE)
     A N30                                  DSPATR(PR)
     A  30                                  DSPATR(CS)
     A  30                                  COLOR(YLW)
     A            SZTAGS    R        B  6 47REFFLD(RMSIZE/SZTAGS *LIBL/FMSIZE)
     A N30                                  DSPATR(PR)
     A  30                                  DSPATR(CS)
     A  30                                  COLOR(YLW)
     A            SZPSHF    R        B  6 62REFFLD(RMSIZE/SZPSHF *LIBL/FMSIZE)
     A                                      DSPATR(CS)
     A                                      COLOR(YLW)
     A            SZSHLV    R        B  6 68REFFLD(RMSIZE/SZSHLV *LIBL/FMSIZE)
     A                                      DSPATR(CS)
     A                                      COLOR(YLW)
     A            SZPCRT    R        B  6 74REFFLD(RMSIZE/SZPCRT *LIBL/FMSIZE)
     A                                      DSPATR(CS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A            SCCATG    R        B  6 55REFFLD(RMSIZC/SCCATG *LIBL/FMSIZC)
     A                                      COLOR(YLW)
     A                                  6 53'|'
     A                                      COLOR(BLU)
     A          R ICR04501C                 SFLCTL(ICR04501)
     A*%%TS  SD  20090408  101233  BILLB       REL-V5R3M0  5722-WDS
     A  *DS3                                SFLSIZ(9999)
     A  *DS4                                SFLSIZ(9999)
     A  *DS3                                SFLPAG(0015)
     A  *DS4                                SFLPAG(0017)
     A                                      CF03(03 'Exit')
     A                                      CF07(07 'Old Exit')
     A                                      CF11(11 'Toggle for Edit all fields-
     A                                      ')
     A                                      KEEP
     A                                      OVERLAY
     A                                      SFLCSRRRN(&SFLCSRRRN)
     A  25 26                               SFLDSP
     A  25                                  SFLDSPCTL
     A N25                                  SFLCLR
     A N27                                  SFLEND(*SCRBAR *SCRBAR)
     A            SFLCSRRRN      5S 0H
     A                                  1  2SYSNAME
     A                                      COLOR(BLU)
     A                                  1 27'   Size Code Maintenance   '
     A                                      DSPATR(RI)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2  2USER
     A                                      COLOR(BLU)
     A                                  2 73TIME
     A                                      COLOR(BLU)
     A                                  2 14'This screen allows you to maintain-
     A                                       multiple size codes'
     A                                      COLOR(PNK)
     A                                  5  1'Size'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  5  7'Description'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  4 19'Square'
     A                                      DSPATR(HI)
     A                                  5 19' Feet  '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  4 61'# per'
     A                                      DSPATR(HI)
     A                                  4 67'Shelf'
     A                                      DSPATR(HI)
     A                                  5 61'Shelf'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  5 67'/Cart'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  5 73'/Cart'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  4 73'items'
     A                                      DSPATR(HI)
     A                                  4 29'# per'
     A                                      DSPATR(HI)
     A                                  5 29'Cart.'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  4 35'# of'
     A                                      DSPATR(HI)
     A                                  5 35'Cells'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  4 41'Cells'
     A                                      DSPATR(HI)
     A                                  5 41'Sold '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  4 47'# of'
     A                                      DSPATR(HI)
     A                                  5 47'Tags '
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  3 53'|   T R U C K I N G       '
     A                                      COLOR(BLU)
     A                                      DSPATR(UL)
     A                                  3  6'Position to Size:'
     A            GOTOSIZE       3A  B  3 25COLOR(YLW)
     A                                  4 55'Prod.'
     A                                      DSPATR(HI)
     A                                  5 55'Cat.'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  4 53'|'
     A                                      COLOR(BLU)
     A                                  5 53'|'
     A                                      COLOR(BLU)
     A          R ICR04501F
     A*%%TS  SD  20040922  123436  BILLB       REL-V5R2M0  5722-WDS
     A                                 22  1'                                  -
     A                                                                         -
     A                                         ICR04501'
     A                                      DSPATR(UL)
     A                                      COLOR(BLU)
     A                                 23  2'Enter'
     A                                      DSPATR(HI)
     A                                 23  8'=Update'
     A                                      COLOR(BLU)
     A                                 23 54'F03/F07'
     A                                      DSPATR(HI)
     A                                 23 62'=Exit w/out Update'
     A                                      COLOR(BLU)
     A                                 23 19'F11'
     A                                      DSPATR(HI)
     A  30                             23 23'=Update & Edit Truck Fields'
     A                                      COLOR(BLU)
     A N30                             23 23'=Update & Edit all Fields'
     A                                      COLOR(BLU)
     A          R MSGDATA                   SFL
     A*%%TS  SD  20040319  114608  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages')
     A  *DS3                                SFLMSGRCD(24)
     A  *DS4                                SFLMSGRCD(24)
     A            $#MSKY                    SFLMSGKEY
     A            $#PGMQ                    SFLPGMQ
     A          R MSGCTL                    SFLCTL(MSGDATA)
     A*%%TS  SD  20040319  114608  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages')
     A                                      OVERLAY
     A N92                                  SFLDSP
     A N92                                  SFLDSPCTL
     A N92                                  SFLINZ
     A N92                                  SFLEND
     A  *DS3                                SFLSIZ(0002)
     A  *DS4                                SFLSIZ(0002)
     A  *DS3                                SFLPAG(0001)
     A  *DS4                                SFLPAG(0001)
     A            $#PGMQ                    SFLPGMQ
     A          R ASSUME
     A*%%TS  SD  20040621  100219  BILLB       REL-V5R1M0  5722-WDS
     A                                      ASSUME
     A                                  1  3' '
