     A*%%TS  SD  19970827  121953  EFD         REL-V3R6M0  5716-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      USRDSPMGT
     A          R SCRNA
     A*%%TS  SD  19970827  121953  EFD         REL-V3R6M0  5716-PW1
     A                                      CF03
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF13
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                      HLPCLR
     A          H                           HLPRCD(HITEM)
     A                                      HLPBDY
     A  *DS3                                HLPARA(05 044 05 055)
     A  *DS4                                HLPARA(05 044 05 055)
     A          H                           HLPRCD(HSIZE)
     A  *DS3                                HLPARA(06 044 06 046)
     A  *DS4                                HLPARA(06 044 06 046)
     A          H                           HLPRCD(HALPHA)
     A  *DS3                                HLPARA(08 044 08 058)
     A  *DS4                                HLPARA(07 044 07 058)
     A          H                           HLPRCD(HLOC)
     A  *DS3                                HLPARA(12 044 12 046)
     A  *DS4                                HLPARA(10 044 10 046)
     A            PROGID        10A  O  1  2
     A                                  1 26' Inventory Sell Price Update '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  6 22'Group Number:'
     A                                  6 38'From?'
     A            VBLIST         4A  B  6 45DSPATR(CS)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A  11                                  ERRMSG('*** Enter A Valid Group Num-
     A                                      ber Lower Than To Group Number.    -
     A                                      Press Reset')
     A  12                                  ERRMSG('*** No Items Were Found For-
     A                                       From Group Number.    Press Reset')
     A                                  6 52'To?'
     A            VELIST         4A  B  6 57DSPATR(CS)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A  20                                  ERRMSG('*** Enter A Valid Group Num-
     A                                      ber.     Press Reset')
     A                                 12 11'* If only the From Group Number is-
     A                                       entered - only inventory'
     A                                 13 11'  items for that group number will-
     A                                       be changed.'
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'                  Enter to Process-
     A                                              F3/F7=End of Job           -
     A                                               '
     A                                      DSPATR(UL)
     A          R SCRNB
     A*%%TS  SD  19970827  121953  EFD         REL-V3R6M0  5716-PW1
     A                                      CF06
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF03
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A          H                           HLPRCD(HBIN)
     A  *DS3                                HLPARA(04 052 04 057)
     A  *DS4                                HLPARA(04 052 04 057)
     A          H                           HLPRCD(HCO)
     A  *DS3                                HLPARA(04 071 04 072)
     A  *DS4                                HLPARA(04 071 04 072)
     A          H                           HLPRCD(HGENUS)
     A  *DS3                                HLPARA(06 014 06 043)
     A  *DS4                                HLPARA(06 014 06 043)
     A          H                           HLPRCD(HBALPHA)
     A  *DS3                                HLPARA(06 064 06 078)
     A  *DS4                                HLPARA(06 064 06 078)
     A          H                           HLPRCD(HVAR)
     A  *DS3                                HLPARA(07 014 07 043)
     A  *DS4                                HLPARA(07 014 07 043)
     A          H                           HLPRCD(HSPEC)
     A  *DS3                                HLPARA(08 014 08 043)
     A  *DS4                                HLPARA(08 014 08 043)
     A          H                           HLPRCD(HNAME)
     A  *DS3                                HLPARA(09 014 09 043)
     A  *DS4                                HLPARA(09 014 09 043)
     A          H                           HLPRCD(HUM1)
     A  *DS3                                HLPARA(11 015 11 016)
     A  *DS4                                HLPARA(11 015 11 016)
     A          H                           HLPRCD(HUM2)
     A  *DS3                                HLPARA(11 024 11 075)
     A  *DS4                                HLPARA(11 024 11 075)
     A          H                           HLPRCD(HPRICE)
     A  *DS3                                HLPARA(14 007 18 045)
     A  *DS4                                HLPARA(14 007 18 045)
     A          H                           HLPRCD(HQTYB)
     A  *DS3                                HLPARA(14 058 18 077)
     A  *DS4                                HLPARA(14 058 18 077)
     A          H                           HLPRCD(HPUM)
     A  *DS3                                HLPARA(20 017 20 018)
     A  *DS4                                HLPARA(20 017 20 018)
     A          H                           HLPRCD(HAVCST)
     A  *DS3                                HLPARA(20 037 20 046)
     A  *DS4                                HLPARA(20 037 20 046)
     A          H                           HLPRCD(HLSCST)
     A  *DS3                                HLPARA(20 063 20 072)
     A  *DS4                                HLPARA(20 063 20 072)
     A            PROGID        10A  O  1  2
     A                                  1 28' Inventory Sell Price Update '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  4  2'From Group Number:'
     A            VBLIST         4A  O  4 22
     A            LBDESC        30A  O  4 28
     A                                  5  2'  To Group Number:'
     A            VELIST         4A  O  5 22
     A            LEDESC        30A  O  5 28
     A                                  7 20' Sell Price'
     A                                      DSPATR(UL)
     A                                  7 44'  Quantity  '
     A                                      DSPATR(UL)
     A                                  7 58'Disc. %'
     A                                      DSPATR(UL)
     A                                  8 17'1.'
     A            SEL1           9Y 4B  8 21DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                  8 40'1.'
     A            QLB1          11Y 1B  8 44DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A            DIS1           4Y 2B  8 59DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                  9 17'2.'
     A            SEL2           9Y 4B  9 21DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                  9 40'2.'
     A            QLB2          11Y 1B  9 44DSPATR(CS)
     A                                      CHECK(RB)
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A  60                                  ERRMSG('*** Quantity Must Be Ascend-
     A                                      ing.      Press Reset')
     A            DIS2           4Y 2B  9 59DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 10 17'3.'
     A            SEL3           9Y 4B 10 21DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 10 40'3.'
     A            QLB3          11Y 1B 10 44DSPATR(CS)
     A                                      CHECK(RB)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A  61                                  ERRMSG('*** Quantity Must Be Ascend-
     A                                      ing.      Press Reset')
     A                                      EDTCDE(4)
     A            DIS3           4Y 2B 10 59DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 11 17'4.'
     A            SEL4           9Y 4B 11 21DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 11 40'4.'
     A            QLB4          11Y 1B 11 44DSPATR(CS)
     A                                      CHECK(RB)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A  62                                  ERRMSG('*** Quantity Must Be Ascend-
     A                                      ing.      Press Reset')
     A                                      EDTCDE(4)
     A            DIS4           4Y 2B 11 59DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 12 17'5.'
     A            SEL5           9Y 4B 12 21DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 12 40'5.'
     A            QLB5          11Y 1B 12 44DSPATR(CS)
     A                                      CHECK(RB)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A  63                                  ERRMSG('*** Quantity Must Be Ascend-
     A                                      ing.      Press Reset')
     A                                      EDTCDE(4)
     A            DIS5           4Y 2B 12 59DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 14  3'**  The data from the first invent-
     A                                      ory item that was equal to the firs-
     A                                      t  '
     A                                 15  3'    group number is displayed.    -
     A                                                                         -
     A                                          '
     A                                 17  7'Change ALL the data to the new pri-
     A                                      ces and quantity breaks.  The  '
     A                                 18  7'inventory will be updated exactly -
     A                                      as it appears on this screen.  '
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'           Enter to Process      F-
     A                                      6=Restart      F3/F7=End of Job    -
     A                                               '
     A                                      DSPATR(UL)
     A                                 20  2'Validate Data: Press ENTER to Upda-
     A                                      te Prices - or - F6 to Restart with-
     A                                       No Update'
     A  88                                  DSPATR(RI)
     A N88                                  DSPATR(ND)
