     A*%%TS  SD  20000301  140409  EFD         REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  20000301  140409  EFD         REL-V3R7M0  5716-PW1
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 33'For Company:'
     A            LCO            2S 0O  2 46DSPATR(HI)
     A                                  2 73TIME
     A                                  4 24'Cycle Count Code Range:'
     A            LBCODE         2A  B  4 50DSPATR(CS)
     A                                  4 53'-'
     A            LECODE         2A  B  4 55DSPATR(CS)
     A                                  5 64'Leave both To'
     A                                  6 24'Location Range?'
     A            LBLOC          3A  B  6 49DSPATR(CS)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A  21                                  ERRMSG('*** Enter A Valid Location.-
     A                                            Press Reset')
     A  22                                  ERRMSG('*** From Location Must Be E-
     A                                      qual or Lower Than To Location.    -
     A                                      Press Reset')
     A                                      DSPATR(PR)
     A                                  6 53'-'
     A            LELOC          3A  B  6 55DSPATR(CS)
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A  25                                  ERRMSG('*** Enter A Valid Location.-
     A                                           Press Reset')
     A                                      DSPATR(PR)
     A                                  6 64'and From fields'
     A                                  7 64'blank to select'
     A                                  8 24'List Code Range?'
     A            LBLIST         4A  B  8 48DSPATR(CS)
     A                                  8 53'-'
     A            LELIST         4A  B  8 55DSPATR(CS)
     A                                  8 64'ALL'
     A                                 10 24'Product Class Range?'
     A            LBPC           2A  B 10 50
     A  40                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  40                                  DSPATR(PC)
     A  41                                  ERRMSG('*** Enter A Valid Product C-
     A                                      lass.   Press Reset')
     A  42                                  ERRMSG('*** From P.C. Must Be Equal-
     A                                       or Lower Than To P.C.       Press -
     A                                      Reset')
     A                                 10 53'-'
     A            LEPC           2A  B 10 55
     A  45                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  45                                  DSPATR(PC)
     A  45                                  ERRMSG('*** Enter A Valid Product C-
     A                                      lass.   Press Reset')
     A                                 21 16' Validate Data - Change or Press E-
     A                                      nter to Accept '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'                Enter to Process  -
     A                                            F3/F7=Cancel Job             -
     A                                               '
     A                                      DSPATR(UL)
     A                                  1  2'ICR630'
     A                                  1 30' Clear Physical Count '
     A                                      DSPATR(RI)
     A                                 11  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 13  3'WARNING!'
     A                                      DSPATR(RI)
     A                                      COLOR(RED)
     A                                      DSPATR(BL)
     A                                 13 15'This program will clear all of the-
     A                                       counts that have been       '
     A                                 14 15'entered for physical inventory in -
     A                                      the item master file         '
     A                                 17 15'Only items that meet the criteria -
     A                                      selected above will be    '
     A                                 18 15'affected.                         -
     A                                                                     '
     A                                 15 15'and for which the Post Physical to-
     A                                       Book has not been run.      '
     A                                 20  5'If you clear count, ALL counts for-
     A                                       this selection must be entered aga-
     A                                      in'
     A                                      DSPATR(RI)
     A          R SCRNE
     A*%%TS  SD  19971116  104525  EFD         REL-V3R6M0  5716-PW1
     A                                  1  2'PHYPMTE'
     A                                  2  2USER
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  1 25' Physical Inventory Selections '
     A                                      DSPATR(RI)
     A            DEDESC        30A  O  3 25
     A                                  8 16'You Can NOT Run any Physical Inven-
     A                                      tory procedures'
     A                                      DSPATR(RI)
     A                                 12 24' Press Enter to Cancel Procedure. '
     A                                      DSPATR(RI)
     A                                  9 25'without a valid department code.'
     A                                      DSPATR(RI)
