     A*%%TS  SD  20180319  141635  BILLB       REL-V7R2M0  5770-WDS
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A          R RECSFL                    SFL
     A*%%TS  SD  20180319  141635  BILLB       REL-V7R2M0  5770-WDS
     A            FLD001         1A  B  4  9
     A            VLINE          4Y 0O  4 11DSPATR(HI)
     A                                      EDTCDE(4)
     A            FZONE          1A  O  4 19DSPATR(HI)
     A            FUDESC        20A  O  4 26DSPATR(HI)
     A            FUCHRG         5Y 2O  4 49DSPATR(HI)
     A                                      EDTCDE(4)
     A            FUTYPE    R        O  4 58REFFLD(RUZONE/FUTYPE *LIBL/FUZONE)
     A            FUFMMI    R        O  4 62REFFLD(RUZONE/FUFMMI *LIBL/FUZONE)
     A                                      EDTCDE(4)
     A            FUTOMI    R        O  4 70REFFLD(RUZONE/FUTOMI *LIBL/FUZONE)
     A                                      EDTCDE(4)
     A                                  4 68'-'
     A          R RECCTL                    SFLCTL(RECSFL)
     A*%%TS  SD  20180319  141045  BILLB       REL-V7R2M0  5770-WDS
     A  *DS3                                SFLSIZ(1000)
     A  *DS4                                SFLSIZ(0020)
     A  *DS3                                SFLPAG(0020)
     A  *DS4                                SFLPAG(0020)
     A                                      CF06
     A                                      ROLLUP
     A                                      ROLLDOWN
     A N80                                  SFLDSP
     A N80                                  SFLDSPCTL
     A  80                                  SFLCLR
     A                                      SFLCSRRRN(&LINE)
     A            LINE           5S 0H
     A                                  1  2'Select Line:'
     A            LINE#          4Y 0B  1 15EDTCDE(Z)
     A                                      DSPATR(CS)
     A  90                                  DSPATR(RI)
     A  90                                  DSPATR(PC)
     A  90                                  ERRMSG('Invalid Line Number Entered-
     A                                      .           Press RESET')
     A                                  1 21'- or Position Cursor On Line and P-
     A                                      ress Enter    F6=Restart'
     A                                  3  4'       Line   Zone     Description-
     A                                                 Charge  M/S   From     T-
     A                                      o  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            FLD001         1A  B  3  2
     A                                  2 62'    Miles    '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                  2 56'Type'
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
