     A*%%TS  SD  20040621  104522  BILLB       REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      INDARA
     A                                      VLDCMDKEY(48 'Valid Function Key Pr-
     A                                      essed')
     A          R LKITSZ01                  SFL
     A*%%TS  SD  20040621  101857  BILLB       REL-V5R1M0  5722-WDS
     A  28                                  SFLNXTCHG
     A            SEL01          1A  B  6  2
     A            IMSIZE    R        O  6  6REFFLD(RMINVT/IMSIZE *LIBL/FMINVT)
     A            IMITEM    R        O  6 10REFFLD(RMINVT/IMITEM *LIBL/FMINVT)
     A            IMDES1    R        O  6 23REFFLD(RMINVT/IMDES1 *LIBL/FMINVT)
     A            IMDES2S   R   20   O  6 54REFFLD(RMINVT/IMDES2 *LIBL/FMINVT)
     A          R LKITSZ01C                 SFLCTL(LKITSZ01)
     A*%%TS  SD  20040621  104522  BILLB       REL-V5R1M0  5722-WDS
     A                                      CF06(06 'Cancel')
     A                                      CF10(10 'Selected with Mouse')
     A                                      KEEP
     A                                      OVERLAY
     A                                      SFLCSRRRN(&SFLCSRRRN)
     A  25 26                               SFLDSP
     A  25                                  SFLDSPCTL
     A N25                                  SFLCLR
     A N27                                  SFLEND(*SCRBAR *SCRBAR)
     A  *DS3                                SFLSIZ(0150)
     A  *DS4                                SFLSIZ(0150)
     A  *DS3                                SFLPAG(0015)
     A  *DS4                                SFLPAG(0017)
     A                                      MOUBTN(*ULP *ULR CF10)
     A                                      MOUBTN(*URP ROLLUP)
     A            SFLCSRRRN      5S 0H
     A                                  1  2SYSNAME
     A                                      COLOR(BLU)
     A                                  1 29'   Size Code Inquiry    '
     A                                      DSPATR(RI)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2  2USER
     A                                      COLOR(BLU)
     A                                  2 18'Find all Size Codes Associated wit-
     A                                      h given Item'
     A                                      COLOR(PNK)
     A                                  2 73TIME
     A                                      COLOR(BLU)
     A                                  4 13'Item:'
     A            IMITEM    R        O  4 19REFFLD(RMINVT/IMITEM *LIBL/FMINVT)
     A                                      DSPATR(HI)
     A          R LKITSZ01F
     A*%%TS  SD  20040621  104522  BILLB       REL-V5R1M0  5722-WDS
     A                                 22  1'                                  -
     A                                                                         -
     A                                                 '
     A                                      DSPATR(UL)
     A                                      COLOR(BLU)
     A                                 23  2'Enter'
     A                                      DSPATR(HI)
     A                                 23  8'=Continue'
     A                                      COLOR(BLU)
     A                                 23 69'F06'
     A                                      DSPATR(HI)
     A                                 23 73'=Restart'
     A                                      COLOR(BLU)
     A          R MSGDATA                   SFL
     A*%%TS  SD  20040319  114608  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages')
     A  *DS3                                SFLMSGRCD(24)
     A  *DS4                                SFLMSGRCD(24)
     A            $#MSKY                    SFLMSGKEY
     A            $#PGMQ                    SFLPGMQ
     A          R MSGCTL                    SFLCTL(MSGDATA)
     A*%%TS  SD  20040319  114608  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages')
     A                                      OVERLAY
     A N92                                  SFLDSP
     A N92                                  SFLDSPCTL
     A N92                                  SFLINZ
     A N92                                  SFLEND
     A  *DS3                                SFLSIZ(0002)
     A  *DS4                                SFLSIZ(0002)
     A  *DS3                                SFLPAG(0001)
     A  *DS4                                SFLPAG(0001)
     A            $#PGMQ                    SFLPGMQ
     A          R ASSUME
     A*%%TS  SD  20040621  100219  BILLB       REL-V5R1M0  5722-WDS
     A                                      ASSUME
     A                                  1  3' '
