     A*%%TS  SD  19980611  163157  EFD         REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF06
     A                                      CF07
     A          R ORDSFL                    SFL
     A*%%TS  SD  19980611  163157  EFD         REL-V3R7M0  5716-PW1
     A            SELECT         1A  B  9  2
     A  56                                  DSPATR(ND)
     A  56                                  DSPATR(PR)
     A            SHORD#         6Y 0O  9  4EDTCDE(4)
     A            SHDESC        30A  O  9 11
     A  50                                  DSPATR(RI)
     A            SHDTLC         6Y 0O  9 42EDTWRD('  /  /  ')
     A            SHDTLS         6Y 0O  9 51EDTWRD('  /  /  ')
     A            SHSH1          1A  O  9 61
     A            SHSH2          1A  O  9 64
     A            SHSH3          1A  O  9 67
     A            SHSH4          1A  O  9 70
     A            SHSH5          1A  O  9 73
     A            SHSH6          1A  O  9 76
     A            SHSH7          1A  O  9 79
     A          R ORDCTL                    SFLCTL(ORDSFL)
     A*%%TS  SD  19980611  163157  EFD         REL-V3R7M0  5716-PW1
     A                                      SFLSIZ(0500)
     A                                      SFLPAG(0015)
     A                                      SFLCSRRRN(&LINE)
     A N80                                  SFLDSP
     A N80                                  SFLDSPCTL
     A  80                                  SFLCLR
     A                                  1  2'LKSTDCSFL'
     A                                  2  2USER
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  1 23' Standing Order Look-up By Custome-
     A                                      r '
     A                                      DSPATR(RI)
     A                                  3 16'Customer:'
     A            CMCUST         6Y 0O  3 26EDTCDE(4)
     A            CMNAME        30A  O  3 33
     A                                  8  2'  Order# Description              -
     A                                            Released  Shipped  M  T  W  T-
     A                                        F  S  S'
     A                                      DSPATR(UL)
     A                                  7 42'----Date Last----'
     A                                  7 61'____Sched AM/PM____'
     A                                  4  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  5  2'Position Cursor on Line Wanted    -
     A                                            or         F6=Return with no -
     A                                      Selection'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A            LINE           5S 0H
     A                                  7 11' Description = Suspended '
     A                                      DSPATR(RI)
