     A*%%TS  SD  20010613  180958  EFD         REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF06
     A                                      CF07
     A          R SCRENA
     A*%%TS  SD  20010613  180958  EFD         REL-V3R7M0  5716-PW1
     A                                  1  2'MAC010A'
     A                                  2  2USER
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  1 25' Create Broker Invoice Manifest '
     A                                      DSPATR(RI)
     A                                  4 28'Begining Date:'
     A            BEGDAT         6Y 0B  4 50
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A                                      EDTCDE(Y)
     A  10N11                               ERRMSG('*** Invalid Begining Date E-
     A                                      ntered.     Press RESET')
     A  11                                  ERRMSG('*** Begining Date cannot be-
     A                                       greater than Ending Date.   Press -
     A                                      RESET')
     A                                  6 28'Ending Date:'
     A            ENDDAT         6Y 0B  6 50
     A  20                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  20                                  DSPATR(PC)
     A                                      EDTCDE(Y)
     A  21                                  ERRMSG('*** Invalid Ending Date Ent-
     A                                      ered.     Press RESET')
     A  22                                  ERRMSG('*** Ending Date cannot be-
     A                                       greater than or Equal to Today  -
     A                                      Press RESET')
     A                                 13 28'Printer ID:'
     A            LPRTR         10A  B 13 48DSPATR(CS)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A  50                                  ERRMSG('*** Printer ID Is Required.-
     A                                           Press Reset')
     A                                 14 28'Forms Number:'
     A            LFORM         10A  B 14 48DSPATR(CS)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A  51                                  ERRMSG('*** Forms Number Is Require-
     A                                      d.    Press Reset')
     A                                 15 28'Number of Copies:'
     A            LCOPY          2Y 0B 15 56
     A  52                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  52                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A  52                                  ERRMSG('*** Number of Copies Is Req-
     A                                      uired.    Press Reset')
     A                                 16 28'Run From JobQ:'
     A            LJOBQ          1A  B 16 57DSPATR(CS)
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A  53                                  ERRMSG('*** Valid Entries Are Y or -
     A                                      N.     Press Reset')
     A                                 17 28'Print Status:'
     A            VOUT           1Y 0B 17 57
     A  54                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  54                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A  54                                  ERRMSG('*** Valid Entries Are 1, 2 -
     A                                      or 3.    Press Reset')
     A                                 17 61'1 = Print'
     A                                 18 61'2 = Print/Save'
     A                                 19 61'3 = Hold'
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'          Enter to Process        -
     A                                      F6=Restart       F3/F7=Cancel Job  -
     A                                               '
     A                                      DSPATR(UL)
     A                                  8 28'Broker Number:'
     A            CUSTNO         6Y 0B  8 52
     A  30                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  30                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A  30N31                               ERRMSG('*** Invalid Broker Number E-
     A                                      ntered.     Press RESET')
     A  31                                  ERRMSG('*** Selected Customer is No-
     A                                      t a Broker. Press RESET')
     A                                 10 28'Alpha Search:'
     A            ALPHA         15A  B 10 43DSPATR(CS)
     A                                  9 30' - or - '
     A                                  8 60'Leave Blank to get'
     A                                      DSPATR(UL)
     A                                  9 60'all brokers.'
     A                                      DSPATR(UL)
