     A*%%TS  SD  20090218  163349  BILLB       REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      MSGALARM
     A          R MMR01001                  SFL
     A*%%TS  SD  20090218  163349  BILLB       REL-V5R3M0  5722-WDS
     A                                      TEXT('Alpha Search Subfile')
     A  28                                  SFLNXTCHG
     A            CMCUST         6S 0H
     A            MMNAME    R        B  6  2REFFLD(RMMAST/MMNAME *LIBL/FMMAST)
     A  51
     AO 52                                  DSPATR(ND)
     A            MMSEQ#    R        B  6 18REFFLD(RMMAST/MMSEQ# *LIBL/FMMAST)
     A                                      EDTCDE(Z)
     A                                      DSPATR(HI)
     A  52                                  DSPATR(ND)
     A            MMFRCUST  R        B  6 37REFFLD(RMMAST/MMFRCUST *LIBL/FMMAST)
     A  52                                  DSPATR(ND)
     A            MMTOCUST  R        B  6 44REFFLD(RMMAST/MMTOCUST *LIBL/FMMAST)
     A  52                                  DSPATR(ND)
     A            MMWANTED  R        B  6 51REFFLD(RMMAST/MMWANTED *LIBL/FMMAST)
     A                                      DSPATR(HI)
     A  52N53                               DSPATR(ND)
     A            MMFRSVIA  R        B  6 62REFFLD(RMMAST/MMFRSVIA *LIBL/FMMAST)
     A  52                                  DSPATR(ND)
     A            MMTOSVIA  R        B  6 65REFFLD(RMMAST/MMTOSVIA *LIBL/FMMAST)
     A  52                                  DSPATR(ND)
     A            MMORDERS       4Y 0O  6 68EDTCDE(Z)
     A                                      DSPATR(HI)
     A  52                                  DSPATR(RI)
     A            MMSEQD    R        B  6 21REFFLD(RMMAST/MMSEQD *LIBL/FMMAST)
     A                                      DSPATR(HI)
     A  52                                  DSPATR(ND)
     A            MMTRAYS        5Y 0O  6 73EDTCDE(Z)
     A  52                                  DSPATR(RI)
     A          R MMR01001C                 SFLCTL(MMR01001)
     A*%%TS  SD  20090218  163349  BILLB       REL-V5R3M0  5722-WDS
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0015)
     A                                      CF03(03 'Exit')
     A                                      CF05(05 'Refresh')
     A                                      CF08(08 'Previous Date')
     A                                      CF09(09 'Next Date')
     A                                      OVERLAY
     A                                      SFLCSRRRN(&SFLCSRRRN)
     A  25 26                               SFLDSP
     A  25                                  SFLDSPCTL
     A N25                                  SFLCLR
     A  27                                  SFLEND
     A            SFLCSRRRN      5S 0H
     A                                  1  2'MMR01001'
     A                                      COLOR(BLU)
     A                                  2  2USER
     A                                      COLOR(BLU)
     A                                  2 26'Ship Week:'
     A                                      COLOR(PNK)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 73TIME
     A                                      COLOR(BLU)
     A            SDATE          6Y 0B  2 38EDTCDE(Y)
     A                                      COLOR(YLW)
     A                                      CHECK(ER)
     A                                  1 21'   Review Multiple Master  - Previ-
     A                                      ew    '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  5 18' Step Description '
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  5  2' Master Name   '
     A                                      DSPATR(UL)
     A                                  5 37'  Customer   '
     A                                      DSPATR(UL)
     A                                  5 51'  Wanted  '
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  4 54'Date'
     A                                      DSPATR(HI)
     A                                  5 62' Via '
     A                                      DSPATR(UL)
     A                                  4 62'Ship'
     A                                  4 67'Count'
     A                                      DSPATR(HI)
     A                                  5 68'Ord '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  4 73'Count'
     A                                  5 73'Plugs'
     A                                      DSPATR(UL)
     A            TOTALORD       4S 0O  3 68DSPATR(HI)
     A            TOTALPLG       5S 0O  3 73
     A  53                              3 21'  The Masters do not match the TOT-
     A                                      ALS   '
     A                                      DSPATR(RI)
     A                                      COLOR(RED)
     A                                  2 47'(Monday)'
     A                                      COLOR(PNK)
     A          R MMR01001F
     A*%%TS  SD  20090218  160016  BILLB       REL-V5R3M0  5722-WDS
     A                                      OVERLAY
     A                                 23 21'F3'
     A                                      DSPATR(HI)
     A                                 23 24'=Exit'
     A                                      COLOR(BLU)
     A                                 23 66'F9'
     A                                      DSPATR(HI)
     A                                 23 69'=Next Week'
     A                                      COLOR(BLU)
     A                                 23 50'F8'
     A                                      DSPATR(HI)
     A                                 23 53'=Prev Week'
     A                                      COLOR(BLU)
     A                                 23 33'F5'
     A                                      DSPATR(HI)
     A                                 23 36'=Refresh'
     A                                      COLOR(BLU)
     A                                 23  3'ENTER'
     A                                      DSPATR(HI)
     A                                 23  9'=Process'
     A                                      COLOR(BLU)
     A          R MSGDATA                   SFL
     A*%%TS  SD  20040405  131906  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages')
     A                                      SFLMSGRCD(24)
     A            $#MSKY                    SFLMSGKEY
     A            $#PGMQ                    SFLPGMQ(10)
     A          R MSGCTL                    SFLCTL(MSGDATA)
     A*%%TS  SD  20040406  091800  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages Control')
     A  50                                  ALARM
     A                                      OVERLAY
     A N92                                  SFLDSP
     A N92                                  SFLDSPCTL
     A N92                                  SFLINZ
     A N92                                  SFLEND
     A                                      SFLSIZ(0002)
     A                                      SFLPAG(0001)
     A            $#PGMQ                    SFLPGMQ(10)
     A          R ASSUME
     A*%%TS  SD  20040423  114217  BILLB       REL-V5R1M0  5722-WDS
     A                                      ASSUME
     A                                  1  3' ASSUME                           -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                  '
