     A*%%TS  SD  20140314  093726  BILLB       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      INDARA
     A                                      VLDCMDKEY(48 'Valid Function Key Pr-
     A                                      essed')
     A          R MMR03001                  SFL
     A*%%TS  SD  20090302  132832  BILLB       REL-V5R3M0  5722-WDS
     A                                      CHGINPDFT
     A  28                                  SFLNXTCHG
     A            OHORD#    R        O  7  2REFFLD(RHORDR/OHORD# *LIBL/FHORDR)
     A  61                                  DSPATR(ND)
     A            OHCUST    R        O  7  9REFFLD(RHORDR/OHCUST *LIBL/FHORDR)
     A                                      DSPATR(HI)
     A  61                                  DSPATR(ND)
     A            OHNAME    R        O  7 16REFFLD(RHORDR/OHNAME *LIBL/FHORDR)
     A  61                                  DSPATR(HI)
     A            OHSHP2    R        O  8 16REFFLD(RHORDR/OHSHP2 *LIBL/FHORDR)
     A  61                                  DSPATR(ND)
     A            OHSHP3    R        O  9 16REFFLD(RHORDR/OHSHP3 *LIBL/FHORDR)
     A  61                                  DSPATR(ND)
     A            OHSHP4    R        O 10 16REFFLD(RHORDR/OHSHP4 *LIBL/FHORDR)
     A  61                                  DSPATR(ND)
     A            OHSHCT    R        O 11 16REFFLD(RHORDR/OHSHCT *LIBL/FHORDR)
     A  61                                  DSPATR(ND)
     A            OHSHST    R        O 11 35REFFLD(RHORDR/OHSHST *LIBL/FHORDR)
     A  61                                  DSPATR(ND)
     A            OHSHZP    R        O 11 38REFFLD(RHORDR/OHSHZP *LIBL/FHORDR)
     A  61                                  DSPATR(ND)
     A            OHDTOR    R        O  7 47REFFLD(RHORDR/OHDTOR *LIBL/FHORDR)
     A                                      DSPATR(HI)
     A  61                                  DSPATR(ND)
     A            OHDTRQ    R        O  7 57REFFLD(RHORDR/OHDTRQ *LIBL/FHORDR)
     A  61                                  DSPATR(ND)
     A            OHDTCN    R        O  7 67REFFLD(RHORDR/OHDTCN *LIBL/FHORDR)
     A                                      DSPATR(HI)
     A  61                                  DSPATR(ND)
     A            OHSHPC    R        O  7 76REFFLD(RHORDR/OHSHPC *LIBL/FHORDR)
     A  61                                  DSPATR(ND)
     A            OHTERM    R        O 11 48REFFLD(RHORDR/OHTERM *LIBL/FHORDR)
     A                                      COLOR(PNK)
     A  61                                  DSPATR(ND)
     A            OHSPIN    R        O 10 48REFFLD(RHORDR/OHSPIN *LIBL/FHORDR)
     A                                      COLOR(PNK)
     A  61                                  DSPATR(ND)
     A            OHSHIN    R        O  9 48REFFLD(RHORDR/OHSHIN *LIBL/FHORDR)
     A                                      COLOR(PNK)
     A  61                                  DSPATR(ND)
     A                                  8 49'Comments:'
     A                                      COLOR(PNK)
     A  61                                  DSPATR(ND)
     A          R MMR03001C                 SFLCTL(MMR03001)
     A*%%TS  SD  20140314  093726  BILLB       REL-V7R1M0  5770-WDS
     A                                      CF03(03 'Exit')
     A                                      CF05(05 'Refresh')
     A                                      CF08(08 'Previous Week')
     A                                      CF09(09 'Next Week')
     A                                      CA11(11 'Edit Order')
     A  26                                  PAGEUP
     A N27                                  PAGEDOWN(40)
     A                                      CF10(10 'Order Inquiry')
     A                                      CF04(04 'Toggle PlugsOnly')
     A                                      KEEP
     A                                      OVERLAY
     A                                      SFLCSRRRN(&SFLCSRRRN)
     A  25 26                               SFLDSP
     A  25                                  SFLDSPCTL
     A N25                                  SFLCLR
     A N27                                  SFLEND(*SCRBAR *SCRBAR)
     A                                      SFLDROP(CA02)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0003)
     A  26        STARTRRN01     4S 0H      SFLRCDNBR
     A            SFLCSRRRN      5S 0H
     A                                  1  2SYSNAME
     A                                      COLOR(BLU)
     A                                  1 27'     Orders Not Included    '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2  2USER
     A                                      COLOR(BLU)
     A                                  2 72TIME
     A                                      COLOR(BLU)
     A                                  5  3'Order'
     A                                      DSPATR(UL)
     A                                  5 10'Cust#'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  5 17'Customer Name               '
     A                                      DSPATR(UL)
     A                                  5 48'Ordered'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  5 58'Request'
     A                                      DSPATR(UL)
     A                                  5 68'Wanted'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  4 49'Date'
     A                                      DSPATR(HI)
     A                                  4 59'Date'
     A                                  4 69'Date'
     A                                      DSPATR(HI)
     A                                  4 76'Ship'
     A                                  5 77'Via'
     A                                      DSPATR(UL)
     A                                  2 31'Ship Date:'
     A            SDATE          6Y 0B  2 43EDTCDE(Y)
     A                                      COLOR(YLW)
     A  41                              3 36'PLUGS ONLY'
     A                                      COLOR(PNK)
     A          R MMR03001F
     A*%%TS  SD  20140314  093726  BILLB       REL-V7R1M0  5770-WDS
     A                                 23  2'                                  -
     A                                                                         -
     A                                         MMR030'
     A                                      DSPATR(UL)
     A                                      COLOR(BLU)
     A                                 24 16'F3'
     A                                      DSPATR(HI)
     A                                 24 19'=Exit'
     A                                      COLOR(BLU)
     A                                 24 40'F5'
     A                                      DSPATR(HI)
     A                                 24 43'=Refresh'
     A                                      COLOR(BLU)
     A                                 24  5'=More/Less'
     A                                      COLOR(BLU)
     A                                 24 52'F8/9'
     A                                      DSPATR(HI)
     A                                 24 57'=-/+Wk'
     A                                      COLOR(BLU)
     A                                 24 64'F10/11'
     A                                      DSPATR(HI)
     A                                 24 71'=Inq/Edit'
     A                                      COLOR(BLU)
     A                                 24  2'F2'
     A                                      DSPATR(HI)
     A                                 24 25'F4'
     A                                      DSPATR(HI)
     A N41                             24 28'=Plugs Only'
     A                                      COLOR(BLU)
     A  41                             24 28'=Show All'
     A                                      COLOR(BLU)
     A          R MSGDATA                   SFL
     A*%%TS  SD  20040319  114608  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages')
     A                                      SFLMSGRCD(24)
     A            $#MSKY                    SFLMSGKEY
     A            $#PGMQ                    SFLPGMQ
     A          R MSGCTL                    SFLCTL(MSGDATA)
     A*%%TS  SD  20040319  114608  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages')
     A                                      OVERLAY
     A N92                                  SFLDSP
     A N92                                  SFLDSPCTL
     A N92                                  SFLINZ
     A N92                                  SFLEND
     A                                      SFLSIZ(0002)
     A                                      SFLPAG(0001)
     A            $#PGMQ                    SFLPGMQ
     A          R ASSUME
     A*%%TS  SD  20040621  100219  BILLB       REL-V5R1M0  5722-WDS
     A                                      ASSUME
     A                                  1  3' '
