     A*%%TS  SD  20110608  170124  BILLB       REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      MSGALARM
     A          R NCR50101                  SFL
     A*%%TS  SD  20110608  170124  BILLB       REL-V5R4M0  5722-WDS
     A                                      TEXT('Alpha Search Subfile')
     A  28                                  SFLNXTCHG
     A            COCART    R        H      REFFLD(RCRTORD/COCART *LIBL/FCRTORD)
     A            COORD#    R        B  7  6REFFLD(RCRTORD/COORD# *LIBL/FCRTORD)
     A                                      CHECK(ER)
     A  27                                  DSPATR(PC)
     A N27                                  DSPATR(PR)
     A          R NCR50101C                 SFLCTL(NCR50101)
     A*%%TS  SD  20110607  154504  BILLB       REL-V5R4M0  5722-WDS
     A                                      CF03(03 'Exit')
     A                                      CF05(05 'Refresh')
     A                                      CF23(23 'Delete Cart')
     A                                      CF24(24 'Delete All')
     A                                      CF11(11 'Key Carts on an Order')
     A                                      OVERLAY
     A                                      SFLCSRRRN(&SFLCSRRRN)
     A  25 26                               SFLDSP
     A  25                                  SFLDSPCTL
     A N25                                  SFLCLR
     A  27                                  SFLEND
     A                                      SFLSIZ(0040)
     A                                      SFLPAG(0040)
     A  *DS3                                SFLLIN(0016)
     A            SFLCSRRRN      5S 0H
     A                                  1  2'NCR50101'
     A                                      COLOR(BLU)
     A                                  2  2USER
     A                                      COLOR(BLU)
     A                                  4  2' Cart #:'
     A                                      COLOR(PNK)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 26'   Assign Orders to a Cart   '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  6  2'     Order                 Order  -
     A                                                     Order               -
     A                                        Order  '
     A                                      DSPATR(UL)
     A                                      COLOR(BLU)
     A            COCART    R        B  4 11REFFLD(RCRTORD/COCART *LIBL/FCRTORD)
     A                                      CHECK(ER)
     A  27                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A          R NCR50101F
     A*%%TS  SD  20110607  154504  BILLB       REL-V5R4M0  5722-WDS
     A                                      OVERLAY
     A                                 23  3'F3'
     A                                      DSPATR(HI)
     A                                 23  6'=Exit'
     A                                      COLOR(BLU)
     A                                 23 16'F5'
     A                                      DSPATR(HI)
     A                                 23 19'=Refresh'
     A                                      COLOR(BLU)
     A                                 23 32'F11'
     A                                      DSPATR(HI)
     A                                 23 36'=Key Carts'
     A                                      COLOR(BLU)
     A                                 23 51'F23'
     A                                      DSPATR(HI)
     A                                 23 55'/'
     A                                      DSPATR(HI)
     A                                 23 57'F24'
     A                                      DSPATR(HI)
     A                                 23 61'=Delete Order/Cart'
     A                                      COLOR(BLU)
     A          R MSGDATA                   SFL
     A*%%TS  SD  20040405  131906  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages')
     A                                      SFLMSGRCD(24)
     A            $#MSKY                    SFLMSGKEY
     A            $#PGMQ                    SFLPGMQ(10)
     A          R MSGCTL                    SFLCTL(MSGDATA)
     A*%%TS  SD  20040406  091800  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages Control')
     A  50                                  ALARM
     A                                      OVERLAY
     A N92                                  SFLDSP
     A N92                                  SFLDSPCTL
     A N92                                  SFLINZ
     A N92                                  SFLEND
     A                                      SFLSIZ(0002)
     A                                      SFLPAG(0001)
     A            $#PGMQ                    SFLPGMQ(10)
     A          R ASSUME
     A*%%TS  SD  20040423  114217  BILLB       REL-V5R1M0  5722-WDS
     A                                      ASSUME
     A                                  1  3' ASSUME                           -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                  '
