     A*%%TS  SD  20140930  145412  BILLB       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      MSGALARM
     A          R NCR72101
     A*%%TS  SD  20140916  120341  BILLB       REL-V7R1M0  5770-WDS
     A                                      TEXT('Enter the Date')
     A                                      CF03(03 'Exit')
     A                                      CF10(10 'Change Printer')
     A                                      CF07(07 'Minus Day')
     A                                      CF08(08 'Plus Day')
     A                                      PAGEUP(07)
     A                                      PAGEDOWN(08)
     A                                      OVERLAY
     A                                  1 26'NCR72101'
     A                                      COLOR(BLU)
     A                                  2 26USER
     A                                      COLOR(BLU)
     A                                  1  2'  New Finished Order   '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  3 26DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  4 26TIME
     A                                      COLOR(BLU)
     A            SELDATE        6Y 0B  3 13EDTCDE(Y)
     A                                      COLOR(PNK)
     A                                  4  7'Mast:'
     A                                      DSPATR(ND)
     A            SELMAST        2Y 0B  4 13EDTCDE(4)
     A                                      COLOR(PNK)
     A                                      DSPATR(ND)
     A                                  3  7'Date:'
     A            PRINTER       10A  O  8 15COLOR(YLW)
     A                                  6  1'                        '
     A                                      DSPATR(UL)
     A                                      COLOR(BLU)
     A                                  8  1'F10'
     A                                      DSPATR(HI)
     A                                  8  5'=Printer:'
     A                                      COLOR(BLU)
     A                                  7  2'F3'
     A                                      DSPATR(HI)
     A                                  7  5'=Exit'
     A                                      COLOR(BLU)
     A                                  7 12'F7/F8'
     A                                      DSPATR(HI)
     A                                  7 18'-/+Day'
     A                                      COLOR(BLU)
     A          R NCR72102
     A*%%TS  SD  20140916  120341  BILLB       REL-V7R1M0  5770-WDS
     A                                      TEXT('Scan Customer Number')
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Previous')
     A                                      CF10(10 'Printer')
     A                                      OVERLAY
     A                                  1 26'NCR72102'
     A                                      COLOR(BLU)
     A                                  2 26USER
     A                                      COLOR(BLU)
     A                                  1  2'  New Finished Order   '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                 10  2'F3'
     A                                      DSPATR(HI)
     A                                 10  5'=Exit'
     A                                      COLOR(BLU)
     A                                  3 26DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  4 26TIME
     A                                      COLOR(BLU)
     A                                  2  3'Dt:'
     A            SELDATE        6Y 0O  2  7EDTCDE(Y)
     A                                      COLOR(YLW)
     A                                  2 16'Mast:'
     A            SELMAST        2Y 0O  2 22EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  4  3'Scan Cust#:'
     A            SELCUST        6Y 0B  4 15COLOR(PNK)
     A                                      EDTCDE(Z)
     A                                      DSPATR(PC)
     A                                      CHECK(ER)
     A N44                             10 12'F12'
     A N44                                  DSPATR(HI)
     A N44                             10 16'=Previous'
     A N44                                  COLOR(BLU)
     A                                  1 57'F10'
     A                                      DSPATR(HI)
     A                                  1 61'=Printer:'
     A                                      COLOR(BLU)
     A            PRINTER       10A  O  1 71COLOR(YLW)
     A          R NCR72103S                 SFL
     A*%%TS  SD  20140930  145412  BILLB       REL-V7R1M0  5770-WDS
     A            SFLCARTQTY     5Y 0B  8 20EDTCDE(Z)
     A                                      COLOR(PNK)
     A            SFLITEM5       5A  O  8 43
     A N41                                  COLOR(GRN)
     A  41                                  COLOR(WHT)
     A            SFLITEM       12A  H
     A            SFLSIZE        3A  O  8 39
     A N41                                  COLOR(GRN)
     A  41                                  COLOR(WHT)
     A            SFLDESC       51   O  7  2
     A  41N51                               DSPATR(RI)
     A  50 51                               DSPATR(BL)
     A N51                                  COLOR(GRN)
     A  51                                  COLOR(RED)
     A            SFLUPC        12Y 0O  8 50EDTWRD(' -     -     - ')
     A                                      DSPATR(UL)
     A N41                                  COLOR(GRN)
     A  41                                  COLOR(WHT)
     A                                  8 26'<== Cart Qty'
     A                                      COLOR(PNK)
     A            SFLQTYDESC    17   O  8  2DSPATR(UL)
     A  41N51                               DSPATR(RI)
     A  50 51                               DSPATR(BL)
     A N51                                  COLOR(GRN)
     A  51                                  COLOR(RED)
     A          R NCR72103                  SFLCTL(NCR72103S)
     A*%%TS  SD  20140916  143711  BILLB       REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0800)
     A                                      SFLPAG(0008)
     A                                      TEXT('Scan UPC Codes')
     A                                      CF01(01 'Process Order')
     A                                      CF03(03 'Exit')
     A                                      CF04(04 'Lock/Unlock Quantity')
     A                                      CF05(05 'Missing')
     A                                      CF06(06 'Over')
     A                                      CF07(07 'Previous Cart')
     A                                      CF08(08 'Next Cart')
     A                                      CF10(10 'Change Printer')
     A                                      CF12(12 'Cancel Order')
     A                                      CF23(23 'Clear Cart')
     A                                      CF02(02 'New Order')
     A                                      CF09(09 'New Master')
     A                                      OVERLAY
     A N80 26                               SFLDSP
     A N80                                  SFLDSPCTL
     A  80                                  SFLCLR
     A                                  1 62'NCR72103'
     A                                      COLOR(BLU)
     A                                  2 62USER
     A                                      COLOR(BLU)
     A                                  1 26'  New Finished Order  '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 73TIME
     A                                      COLOR(BLU)
     A                                  2  2'UPC:'
     A            UPC           12Y 0B  2  7CHECK(ER)
     A                                      COLOR(PNK)
     A                                      DSPATR(PC)
     A                                      EDTWRD(' -     -     - ')
     A                                  2 26'Dt:'
     A            SELDATE        6Y 0O  2 30EDTCDE(Y)
     A                                      COLOR(YLW)
     A                                  2 39'Mast:'
     A            SELMAST        2Y 0O  2 45EDTCDE(4)
     A                                      COLOR(YLW)
     A  26                                  DSPATR(PC)
     A                                  3  2'Qty:'
     A            QTY            2Y 0B  3  7EDTCDE(Z)
     A  40                                  DSPATR(RI)
     A  40                                  COLOR(GRN)
     A N40                                  COLOR(PNK)
     A                                  1  2'Order:'
     A            SELORDER       6S 0O  1  9DSPATR(HI)
     A                                  1 16'Cart:'
     A            CART           2S 0O  1 22DSPATR(HI)
     A                                  3 10'F4'
     A                                      DSPATR(HI)
     A N40                              3 13'=Lock Qty'
     A                                      COLOR(BLU)
     A  40                              3 13'=Unlock Qty'
     A                                      COLOR(BLU)
     A            PRINTER       10A  O  3 56COLOR(YLW)
     A                                  4  2'F7/F8'
     A                                      DSPATR(HI)
     A                                  3 42'F10'
     A                                      DSPATR(HI)
     A                                  3 46'=Printer:'
     A                                      COLOR(BLU)
     A                                  4  8'=Prev/Next Cart'
     A                                      COLOR(BLU)
     A                                  3 26'F1'
     A                                      DSPATR(HI)
     A                                  3 29'=Done'
     A                                      COLOR(BLU)
     A                                  4 42'F23'
     A                                      DSPATR(HI)
     A                                  4 46'=Clear Cart'
     A                                      COLOR(BLU)
     A            STATUS        45A  O  6  2COLOR(WHT)
     A                                  4 26'F2'
     A                                      DSPATR(HI)
     A                                  4 29'=New Order'
     A                                      COLOR(BLU)
     A                                  5  5'Cart Count:'
     A            CARTCOUNT      6S 0O  5 17
     A                                  5 42'F24'
     A                                      DSPATR(HI)
     A                                  5 46'=Clear Order'
     A                                      COLOR(BLU)
     A                                  5 26'F3'
     A                                      DSPATR(HI)
     A                                  5 29'=Exit App'
     A                                      COLOR(BLU)
     A          R NCR72104
     A*%%TS  SD  20140916  133229  BILLB       REL-V7R1M0  5770-WDS
     A                                      TEXT('Order Count & Confirmation')
     A                                      CF03(03 'Exit')
     A                                      CF01(01 'Process Work')
     A                                      CF12(12 'Previous Screen')
     A                                      CF24(24 'TEST TEST TEST TEST')
     A                                      OVERLAY
     A                                  1 26'NCR72102'
     A                                      COLOR(BLU)
     A                                  2 26USER
     A                                      COLOR(BLU)
     A                                  1  2'  New Finished Order   '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                 10  2'F3'
     A                                      DSPATR(HI)
     A                                 10  5'=Exit'
     A                                      COLOR(BLU)
     A                                  3 26DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  4 26TIME
     A                                      COLOR(BLU)
     A                                  2  1'Dt:'
     A            SELDATE        6Y 0O  2  5EDTCDE(Y)
     A                                      COLOR(YLW)
     A                                  2 14'Mast:'
     A            SELMAST        2Y 0O  2 20EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  3  1'Temporary Order:'
     A            SELORDER       6S 0O  3 18COLOR(PNK)
     A                                  5  2'Items Counted:'
     A            QTYSCANNED     5S 0O  5 18COLOR(PNK)
     A                                  7  1'  F1=Done, create Order  '
     A                                      DSPATR(RI)
     A                                  6  1'                         '
     A                                      DSPATR(RI)
     A                                  8  1'                         '
     A                                      DSPATR(RI)
     A          R MSGDATA                   SFL
     A                                      TEXT('Program Messages')
     A                                      SFLMSGRCD(24)
     A            $ERR_MKEY                 SFLMSGKEY
     A            $ERR_PROG                 SFLPGMQ(10)
     A          R MSGCTL                    SFLCTL(MSGDATA)
     A                                      TEXT('Program Messages Control')
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  50                                  SFLDSPCTL
     A  50                                  SFLINZ
     A  50                                  SFLEND
     A                                      SFLSIZ(0002)
     A                                      SFLPAG(0001)
     A            $ERR_PROG                 SFLPGMQ(10)
     A          R ASSUME
     A                                      ASSUME
     A                                  1  3' ASSUME                           -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                  '
