     A*%%TS  SD  20141201  122332  BILLB       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      MSGALARM
     A          R NCR7RCD
     A*%%TS  SD  20141201  122332  BILLB       REL-V7R1M0  5770-WDS
     A                                      CF03(03 'Exit')
     A                                      CF10(10 'Change Printer')
     A                                      CF07(07 'Minus Day')
     A                                      CF08(08 'Plus Day')
     A                                      PAGEUP(07)
     A                                      PAGEDOWN(08)
     A                                      OVERLAY
     A                                  3 31'NCR7HOME'
     A                                      COLOR(BLU)
     A                                  4 31USER
     A                                      COLOR(BLU)
     A                                  1 31DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 31TIME
     A                                      COLOR(BLU)
     A                                  8  2'F3'
     A                                      DSPATR(HI)
     A                                  8  5'=Exit'
     A                                      COLOR(BLU)
     A                                  1  2'  Finished Checkout  '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  3  2'Enter Sign-on:'
     A            SIGNON        10A  B  3 17COLOR(PNK)
     A                                      CHECK(ER)
     A                                  5 31'PGM:NCR7CL'
     A                                      COLOR(BLU)
     A                                  7  2'                            '
     A                                      COLOR(BLU)
     A                                      DSPATR(UL)
