     A*%%TS  SD  20151029  145523  BILLB       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      MSGALARM
     A          R PCK31001
     A*%%TS  SD  20151029  145523  BILLB       REL-V7R1M0  5770-WDS
     A                                      CF03(03 'Exit')
     A                                      CF05(05 'Refresh')
     A                                      CF09(09 'Print')
     A                                      CF11(11 'Change Printer')
     A                                      RTNCSRLOC(*WINDOW &ROW &COL)
     A  30                                  CSRLOC(ROW        COL)
     A            ROW            3S 0H
     A            COL            3S 0H
     A            REP01         55A  P
     A            REP02         55A  P
     A            REP03         55A  P
     A            REP04         55A  P
     A            REP05         55A  P
     A            REP06         55A  P
     A            REP07         55A  P
     A                                  1  2USER
     A                                      COLOR(BLU)
     A                                  1 26'   Finished Pick Selection   '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 72TIME
     A                                      COLOR(BLU)
     A                                  3  6'SELECT REPORT TYPE'
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            SELREPT        2Y 0B  4  6PSHBTNFLD
     A  71                                  PSHBTNCHC(1 &REP01)
     A  72                                  PSHBTNCHC(2 &REP02)
     A  73                                  PSHBTNCHC(3 &REP03)
     A  74                                  PSHBTNCHC(4 &REP04)
     A  75                                  PSHBTNCHC(5 &REP05)
     A  76                                  PSHBTNCHC(6 &REP06)
     A  77                                  PSHBTNCHC(7 &REP07)
     A                                 11  6'SELECTION CRITERIA'
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A            SELNAME       55A  O 11 25DSPATR(HI)
     A  60
     AO 61
     AO 62
     AO 63
     AO 64
     AO 65
     AO 66
     AO 67
     AO 68                                  DSPATR(RI)
     A  60                             12 10'Ship Date:'
     A  60        SELDATE        6Y 0B 12 22EDTCDE(Y)
     A                                      COLOR(YLW)
     A  60                                  DSPATR(PC)
     A  60                             12 34'(Enter the Ship Date mm/dd/yy)'
     A                                      COLOR(BLU)
     A  60        ADJDATE        2Y 0B 12 70PSHBTNFLD((*NUMCOL 2))
     A                                      PSHBTNCHC(1 '-')
     A                                      PSHBTNCHC(2 '+')
     A  61                             13 14'Truck:'
     A  61        SELTRUK        4A  B 13 22COLOR(YLW)
     A  61                                  DSPATR(PC)
     A  61                             13 34'(Enter the Truck or *ALL)'
     A                                      COLOR(BLU)
     A  61        ADJTRUK        2Y 0B 13 70PSHBTNFLD((*NUMCOL 2))
     A                                      PSHBTNCHC(1 '-')
     A                                      PSHBTNCHC(2 '+')
     A  62                             14  6'Master Number:'
     A  62        SELMAST        2Y 0B 14 22EDTCDE(Z)
     A  62                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A  62                             14 34'(Enter the Master Number or 0=ALL)'
     A                                      COLOR(BLU)
     A  62        ADJMAST        2Y 0B 14 70PSHBTNFLD((*NUMCOL 2))
     A                                      PSHBTNCHC(1 '-')
     A                                      PSHBTNCHC(2 '+')
     A  63                             15  2'   Group Location:'
     A  63        SELGRUP       10A  B 15 22COLOR(YLW)
     A  63                                  DSPATR(PC)
     A  63                             15 34'(Enter the Location or *ALL)'
     A                                      COLOR(BLU)
     A  63        ADJGRUP        2Y 0B 15 70PSHBTNFLD((*NUMCOL 2))
     A                                      PSHBTNCHC(1 '-')
     A                                      PSHBTNCHC(2 '+')
     A  64                             16  9'Order List:'
     A  64        SELLIST        6A  B 16 22COLOR(YLW)
     A  64                                  DSPATR(PC)
     A  64                             16 34'(Enter the Order List of *ALL)'
     A                                      COLOR(BLU)
     A  64        ADJLIST        2Y 0B 16 70PSHBTNFLD((*NUMCOL 2))
     A                                      PSHBTNCHC(1 '-')
     A                                      PSHBTNCHC(2 '+')
     A  65                             17  9'From Order:'
     A  65        SELFORD        6Y 0B 17 22EDTCDE(Z)
     A  65                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A  65                             17 34'(Enter the beginning Order Number)'
     A                                      COLOR(BLU)
     A  66                             18 11'To Order:'
     A  66        SELTORD        6Y 0B 18 22EDTCDE(Z)
     A  66                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A  66                             18 34'(Enter the Ending Order Number)'
     A                                      COLOR(BLU)
     A            PRINTBTN       2Y 0B 20 42PSHBTNFLD
     A                                      PSHBTNCHC(1 'F9=>Print' CF09)
     A                                 21  1'                                  -
     A                                                                         -
     A                                        PCK31001 '
     A                                      DSPATR(UL)
     A                                      COLOR(BLU)
     A            FUNCTION       2Y 0B 22  5PSHBTNFLD
     A                                      PSHBTNCHC(1 '>Enter')
     A                                      PSHBTNCHC(3 'F3=E>xit' CF03)
     A                                      PSHBTNCHC(5 'F5=>Refresh' CF05)
     A                                 22 58'|'
     A                                      COLOR(BLU)
     A                                 22 61'Printer:'
     A            PRINTER       10A  O 22 70COLOR(YLW)
     A                                 23 58'|'
     A                                      COLOR(BLU)
     A*                                23 61'F11'
     A*                                     DSPATR(HI)
     A*                                23 65'=Change Printer'
     A*                                     COLOR(BLU)
     A            CHGPRTBTN      2Y 0B 23 60PSHBTNFLD
     A                                      PSHBTNCHC(1 'F11=>Change Printer' C-
     A                                      F11)
     A  41                              4  3'*'
     A                                      COLOR(RED)
     A                                      DSPATR(BL)
     A  42                              5  3'*'
     A                                      COLOR(RED)
     A                                      DSPATR(BL)
     A  43                              6  3'*'
     A                                      COLOR(RED)
     A                                      DSPATR(BL)
     A  44                              7  3'*'
     A                                      COLOR(RED)
     A                                      DSPATR(BL)
     A  45                              8  3'*'
     A                                      COLOR(RED)
     A                                      DSPATR(BL)
     A  46                              9  3'*'
     A                                      COLOR(RED)
     A                                      DSPATR(BL)
     A  47                             10  3'*'
     A                                      COLOR(RED)
     A                                      DSPATR(BL)
     A  41                              4 67'<---'
     A                                      COLOR(RED)
     A                                      DSPATR(BL)
     A  42                              5 67'<---'
     A                                      COLOR(RED)
     A                                      DSPATR(BL)
     A  43                              6 67'<---'
     A                                      COLOR(RED)
     A                                      DSPATR(BL)
     A  44                              7 67'<---'
     A                                      COLOR(RED)
     A                                      DSPATR(BL)
     A  45                              8 67'<---'
     A                                      COLOR(RED)
     A                                      DSPATR(BL)
     A  46                              9 67'<---'
     A                                      COLOR(RED)
     A                                      DSPATR(BL)
     A  47                             10 67'<---'
     A                                      COLOR(RED)
     A                                      DSPATR(BL)
     A            ADJCOPY        2Y 0B 20 70PSHBTNFLD((*NUMCOL 2))
     A                                      PSHBTNCHC(1 '-')
     A                                      PSHBTNCHC(2 '+')
     A                                 20 57'Copies:'
     A            SELCOPY        2Y 0B 20 65EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                  3 25'(use a mouse click or spacebar to -
     A                                      select)'
     A                                      COLOR(PNK)
     A          R PCK310NR
     A*%%TS  SD  20150930  130121  BILLB       REL-V7R1M0  5770-WDS
     A                                      CF03(03 'Exit')
     A                                      CF05(05 'Look anyway')
     A                                  1  2USER
     A                                      COLOR(BLU)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 72TIME
     A                                      COLOR(BLU)
     A                                  1 26'   Finished Pick Selection   '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                 10  9'Okay, finished pick selection func-
     A                                      tionality isn''t quite ready yet.'
     A                                 11  9'You will have to print finished pi-
     A                                      cks out of the order or trucking '
     A                                 12  9'menu for the time being.  I will l-
     A                                      et you know when we are ready here.'
     A                                 15 60'-Bill B.'
     A                                 21  1'                                  -
     A                                                                         -
     A                                        PCK31001 '
     A                                      DSPATR(UL)
     A                                      COLOR(BLU)
     A                                 22  5'F3'
     A                                      DSPATR(HI)
     A                                 22  8'=Exit'
     A                                      COLOR(BLU)
     A                                 18 26'PRESS F5 if you want to look anywa-
     A                                      y'
     A                                      DSPATR(BL)
     A                                      COLOR(RED)
     A                                 22 26'F5'
     A                                      DSPATR(HI)
     A                                 22 29'=Preview Finished Picks'
     A                                      COLOR(BLU)
     A          R PCK310BR
     A*%%TS  SD  20150930  153751  BILLB       REL-V7R1M0  5770-WDS
     A                                      WINDOW(5 20 10 40)
     A                                  3  5'The report you tried to print is'
     A                                      COLOR(PNK)
     A                                  5  2'not setup yet.  Please try again l-
     A                                      ater.'
     A                                      COLOR(PNK)
     A                                  9  3'<ENTER>'
     A                                      DSPATR(HI)
     A                                  9 11'to continue'
     A                                      COLOR(BLU)
     A          R MSGDATA                   SFL
     A*%%TS  SD  20150915  125424  BILLB       REL-V7R1M0  5770-WDS
     A                                      TEXT('Program Messages')
     A                                      SFLMSGRCD(24)
     A            $#MSKY                    SFLMSGKEY
     A            $#PGMQ                    SFLPGMQ(10)
     A          R MSGCTL                    SFLCTL(MSGDATA)
     A*%%TS  SD  20050118  084136  BILLB       REL-V5R2M0  5722-WDS
     A                                      TEXT('Program Messages Control')
     A  50                                  ALARM
     A                                      OVERLAY
     A N92                                  SFLDSP
     A N92                                  SFLDSPCTL
     A N92                                  SFLINZ
     A N92                                  SFLEND
     A                                      SFLSIZ(0002)
     A                                      SFLPAG(0001)
     A            $#PGMQ                    SFLPGMQ(10)
     A          R ASSUME
     A*%%TS  SD  20040423  114217  BILLB       REL-V5R1M0  5722-WDS
     A                                      ASSUME
     A                                  1  3' ASSUME                           -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                  '
