     A*%%TS  SD  20170518  095855  BILLB       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      MSGALARM
     A          R PCK90001
     A*%%TS  SD  20170518  095855  BILLB       REL-V7R1M0  5770-WDS
     A                                      WINDOW(6 21 13 40)
     A                                      CF03(03 'Exit')
     A                                      CF11(11 'Print Order')
     A  50                                  ALARM
     A                                  3  1'       Print Finished Trucking Pic-
     A                                      ks    '
     A                                      DSPATR(RI)
     A                                      COLOR(PNK)
     A            PRINTER       10A  B  8 26COLOR(YLW)
     A                                  4  1'                                  -
     A                                            '
     A                                      DSPATR(RI)
     A                                      COLOR(PNK)
     A                                      DSPATR(UL)
     A                                  2  1'                                  -
     A                                            '
     A                                      DSPATR(RI)
     A                                      COLOR(PNK)
     A                                  1  1'                                PC-
     A                                      K90001'
     A                                      DSPATR(UL)
     A                                      COLOR(PNK)
     A                                 12  1'F3'
     A                                      DSPATR(HI)
     A                                 12  4'=Exit'
     A                                      COLOR(BLU)
     A                                  6  5'Week Date to Print:'
     A            SELDATE        6Y 0B  6 26EDTCDE(Y)
     A                                      COLOR(YLW)
     A                                  8 16'Printer:'
     A                                 12 24'F11'
     A                                      DSPATR(HI)
     A                                 12 28'=Print Order'
     A                                      COLOR(BLU)
     A                                  9 30'... or *PDF'
     A                                      COLOR(BLU)
     A                                  8 37'Name'
     A                                      COLOR(BLU)
     A                                  6 35'mmddyy'
     A                                      COLOR(BLU)
     A                                 10  9'Unprinted Only:'
     A            UNPRTYN        1A  B 10 26COLOR(YLW)
     A                                      DFTVAL('N')
     A                                 10 28'(Y)es or (N)o'
     A                                      COLOR(BLU)
     A          R PCK90002
     A*%%TS  SD  20160414  120818  BILLB       REL-V7R1M0  5770-WDS
     A                                      WINDOW(6 21 13 40)
     A                                      CF03(03 'Exit')
     A                                      CF11(11 'Print Week')
     A  50                                  ALARM
     A                                  3  1'       Print Finished Trucking Pic-
     A                                      ks    '
     A                                      DSPATR(RI)
     A                                      COLOR(PNK)
     A            PRINTER       10A  B  9 26COLOR(YLW)
     A                                  4  1'                                  -
     A                                            '
     A                                      DSPATR(RI)
     A                                      COLOR(PNK)
     A                                      DSPATR(UL)
     A                                  2  1'                                  -
     A                                            '
     A                                      DSPATR(RI)
     A                                      COLOR(PNK)
     A                                  1  1'                                PC-
     A                                      K90002'
     A                                      DSPATR(UL)
     A                                      COLOR(PNK)
     A                                 12  1'F3'
     A                                      DSPATR(HI)
     A                                 12  4'=Exit'
     A                                      COLOR(BLU)
     A                                  7  9'Order to Print:'
     A            SELORDER       6Y 0B  7 26EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                  9 16'Printer:'
     A                                 12 26'F11'
     A                                      DSPATR(HI)
     A                                 12 30'=Print Week'
     A                                      COLOR(BLU)
     A                                  9 37'Name'
     A                                      COLOR(BLU)
     A                                 10 30'... or *PDF'
     A                                      COLOR(BLU)
     A          R MSGDATA                   SFL
     A*%%TS  SD  20040405  131906  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages')
     A                                      SFLMSGRCD(24)
     A            $#MSKY                    SFLMSGKEY
     A            $#PGMQ                    SFLPGMQ(10)
     A          R MSGCTL                    SFLCTL(MSGDATA)
     A*%%TS  SD  20050118  084136  BILLB       REL-V5R2M0  5722-WDS
     A                                      TEXT('Program Messages Control')
     A  50                                  ALARM
     A                                      OVERLAY
     A N92                                  SFLDSP
     A N92                                  SFLDSPCTL
     A N92                                  SFLINZ
     A N92                                  SFLEND
     A                                      SFLSIZ(0002)
     A                                      SFLPAG(0001)
     A            $#PGMQ                    SFLPGMQ(10)
     A          R ASSUME
     A*%%TS  SD  20040423  114217  BILLB       REL-V5R1M0  5722-WDS
     A                                      ASSUME
     A                                  1  3' ASSUME                           -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                  '
