     A*%%TS  SD  20010228  112816  EFD         REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF06
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  20010228  112816  EFD         REL-V3R7M0  5716-PW1
     A  71                                  CF02
     A                                  1  2'PRI010A'
     A                                  1 27' Price Override Maintenance '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  5 15'Item Number?'
     A            ITEM          12A  B  5 32
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A  10                                  ERRMSG('*** Invalid Item Number Ent-
     A                                      ered.       Press RESET')
     A  15                                  ERRMSG('*** At Least One Selection -
     A                                      Must be Entered. Press RESET')
     A            IMDES1        30A  O  5 46
     A                                  7 15'Size Code?'
     A            SIZE           3A  B  7 32
     A  20                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  20                                  DSPATR(PC)
     A  20                                  ERRMSG('*** Invalid Size Code Enter-
     A                                      ed.         Press RESET')
     A            SZDESC        10A  O  7 37
     A                                  9 15'Product Class?'
     A            PRDCL          2A  B  9 32
     A  30                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  30                                  DSPATR(PC)
     A  30                                  ERRMSG('*** Invalid Product Class E-
     A                                      ntered.     Press RESET')
     A            PCDESC        30A  O  9 37
     A                                 11 15'List Code?'
     A            LIST           4A  B 11 32
     A  40                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  40                                  DSPATR(PC)
     A  40                                  ERRMSG('*** Invalid List Code Enter-
     A                                      ed.         Press RESET')
     A            LCDESC        30A  O 11 37
     A                                 13 15'Location?'
     A            VLOC           3A  B 13 32
     A  60N61                               DSPATR(RI)
     A N61                                  DSPATR(CS)
     A  60N61                               DSPATR(PC)
     A  60                                  ERRMSG('*** Invalid Location Entere-
     A                                      d.          Press RESET')
     A  61                                  DSPATR(PR)
     A                                 13 37'Leave Blank for All Locations'
     A                                 15 15'Price In Effect  From:'
     A            BEGDAT         6Y 0B 15 39
     A  51                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  51                                  DSPATR(PC)
     A                                      EDTCDE(Y)
     A  51N52                               ERRMSG('*** Invalid Begining Date E-
     A                                      ntered.     Press RESET')
     A  51 52                               ERRMSG('*** End Date Must be Greate-
     A                                      r than or Equal to Begiinig Date.  -
     A                                       Press RESET')
     A                                 15 49'To:'
     A            ENDDAT         6Y 0B 15 53
     A  52                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  52                                  DSPATR(PC)
     A                                      EDTCDE(Y)
     A  52                                  ERRMSG('*** Invalid Ending Date Ent-
     A                                      ered.     Press RESET')
     A                                 17 15'Dates Based On:'
     A            USDAT          1A  B 17 32
     A  50                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  50                                  DSPATR(PC)
     A  50                                  ERRMSG('*** Date to use must be (O=-
     A                                      Order Date or R=Requested Date). Pr-
     A                                      ess RESET')
     A                                 17 36'O = Order Date '
     A                                 18 36'R = Requested Date'
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'                    Enter to Proce-
     A                                      ss      F3/F7=End of Job           -
     A                                               '
     A                                      DSPATR(UL)
     A                                 20 10' Record Exists in File Press F2 To-
     A                                       Update Existing Record '
     A  71                                  DSPATR(RI)
     A N71                                  DSPATR(ND)
     A          R SCRNB
     A*%%TS  SD  19990105  142651  EFD         REL-V3R7M0  5716-PW1
     A                                      CF23
     A                                  1  2'PRI010B'
     A                                  1 27' Price Override Maintenance '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  3 19'Item:'
     A            SPITEM        12A  O  3 26DSPATR(HI)
     A            IMDES1        30A  O  3 39DSPATR(HI)
     A                                  4 19'Size:'
     A            SPSIZE         3A  O  4 26DSPATR(HI)
     A            SZDESC        10A  O  4 30DSPATR(HI)
     A                                  5 19'PrCl:'
     A            SPPRCL         2A  O  5 26DSPATR(HI)
     A            PCDESC        30A  O  5 29DSPATR(HI)
     A                                  6 19'List:'
     A            SPLIST         4A  O  6 26DSPATR(HI)
     A            LCDESC        30A  O  6 31DSPATR(HI)
     A                                  7  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                  9 26'Override Price:'
     A            SPPRIC         9Y 4B  9 43EDTWRD('     .    ')
     A                                      DSPATR(CS)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A  10                                  ERRMSG('*** Only a Price or Discoun-
     A                                      t Can be entered.  Press RESET')
     A                                 10 19'- or - Discount %:'
     A            SPDISC         4Y 2B 10 46EDTWRD('  .  ')
     A                                      DSPATR(CS)
     A  10                                  DSPATR(RI)
     A                                 12 26'Allow Cash/Carry Discount:'
     A            SPORDD         1A  B 12 54
     A  20                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  20                                  DSPATR(PC)
     A  20                                  ERRMSG('*** Allow Cash and Carry Mu-
     A                                      st be Y or N.Press RESET')
     A                                 16 46'Disc. %'
     A                                      DSPATR(UL)
     A                                 17 25'1.'
     A            SPQLB1        11Y 1B 17 29EDTCDE(4)
     A                                      DSPATR(CS)
     A            SPDIS1         4Y 2B 17 47EDTCDE(4)
     A                                      DSPATR(CS)
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A  40                                  ERRMSG('*** If Qty. Entered You Mus-
     A                                      t Enter A Discount.              Pr-
     A                                      ess RESET')
     A                                 18 17'Qty'
     A                                 18 25'2.'
     A            SPQLB2        11Y 1B 18 29EDTCDE(4)
     A                                      DSPATR(CS)
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A  30                                  ERRMSG('*** Quantity Must Be Ascend-
     A                                      ing.        Press RESET')
     A            SPDIS2         4Y 2B 18 47EDTCDE(4)
     A                                      DSPATR(CS)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A  41                                  ERRMSG('*** If Qty. Entered You Mus-
     A                                      t Enter A Discount.      Press RESE-
     A                                      T')
     A                                 19 16'Breaks'
     A                                 19 25'3.'
     A            SPQLB3        11Y 1B 19 29EDTCDE(4)
     A                                      DSPATR(CS)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A  31                                  ERRMSG('*** Quantity Must Be Ascend-
     A                                      ing.        Press RESET')
     A            SPDIS3         4Y 2B 19 47EDTCDE(4)
     A                                      DSPATR(CS)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A  42                                  ERRMSG('*** If Qty. Entered You Mus-
     A                                      t Enter A Discount.        Press RE-
     A                                      SET')
     A                                 20 25'4.'
     A            SPQLB4        11Y 1B 20 29EDTCDE(4)
     A                                      DSPATR(CS)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A  32                                  ERRMSG('*** Quantities Must Be Asce-
     A                                      nding.      Press RESET')
     A            SPDIS4         4Y 2B 20 47EDTCDE(4)
     A                                      DSPATR(CS)
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A  43                                  ERRMSG('*** If QTY. Entered You Mus-
     A                                      t Enter A Discount.             Pre-
     A                                      ss RESET')
     A                                 21 25'5.'
     A            SPQLB5        11Y 1B 21 29EDTCDE(4)
     A                                      DSPATR(CS)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A  33                                  ERRMSG('*** Quantities Must Be Asce-
     A                                      nding.      Press RESET')
     A            SPDIS5         4Y 2B 21 47EDTCDE(4)
     A                                      DSPATR(CS)
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A  44                                  ERRMSG('*** If Qty. Entered You Mus-
     A                                      t Enter A Discount.      Press RESE-
     A                                      T')
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'         Enter to Process      F6=-
     A                                      Restart(No Update)     F23=Delete R-
     A                                      ecord    '
     A                                      DSPATR(UL)
     A                                  8 12' At Least One Price or Discount Pe-
     A                                      rcent Must Be Entered. '
     A  57                                  DSPATR(RI)
     A N57                                  DSPATR(ND)
     A                                 14 26'Allow On Ship Via. Only?'
     A            SPSHVA         2A  B 14 53
     A  55                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  55                                  DSPATR(PC)
     A  55                                  ERRMSG('*** Invalid Ship Via. Enter-
     A                                      ed.         Press RESET')
     A                                 14 57'Note: Leave Blank For'
     A                                 15 63'All Ship Via Codes'
