     A*%%TS  SD  20190204  104250  BILLB       REL-V7R2M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      MSGALARM
     A          R PSR30001
     A*%%TS  SD  20100208  144902  BILLB       REL-V5R3M0  5722-WDS
     A                                      CF03(03 'Exit')
     A                                      CF05(05 'Refresh')
     A                                      CF06(06 'Manual Process')
     A                                      OVERLAY
     A                                  1  2'PSR30001'
     A                                      COLOR(BLU)
     A                                  2  2USER
     A                                      COLOR(BLU)
     A                                  1125DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2125TIME
     A                                      COLOR(BLU)
     A                                  2 51'   Plug Shipping Layout Tool   '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  8 50'Enter the Monday Date:'
     A                                 10 50'Enter the Master Type:'
     A            SDATE          6Y 0B  8 74EDTWRD('  /  /  ')
     A                                      COLOR(YLW)
     A            SGMSTR    R        B 10 74REFFLD(RPLGSET/PGMSTR *LIBL/FPLGSET)
     A                                      COLOR(YLW)
     A                                 15  2'F3'
     A                                      DSPATR(HI)
     A                                 15  5'=Exit'
     A                                      COLOR(BLU)
     A                                 15 61'F5'
     A                                      DSPATR(HI)
     A                                 15 64'=Refresh'
     A                                      COLOR(BLU)
     A                                 14  2'                                  -
     A                                                                         -
     A                                                                         -
     A                                                                '
     A                                      DSPATR(UL)
     A                                      COLOR(BLU)
     A                                 15122'F6'
     A                                      DSPATR(HI)
     A                                 15125'=Manual'
     A                                      COLOR(BLU)
     A                                 10 83'1 = Thursday         '
     A                                 11 83'2 = Monday           '
     A                                 12 83'0 = No Multiple Mast.'
     A          R PSR30002                  SFL
     A*%%TS  SD  20110309  151508  BILLB       REL-V5R4M0  5722-WDS
     A                                      TEXT('Alpha Search Subfile')
     A  28                                  SFLNXTCHG
     A            IN60          10A  H
     A            PGWKDT    R        H      REFFLD(RPLGSET/PGWKDT *LIBL/FPLGSET)
     A            PGMSTR    R        H      REFFLD(RPLGSET/PGMSTR *LIBL/FPLGSET)
     A            PGSVIA_SV R        H      REFFLD(RPLGSET/PGSVIA *LIBL/FPLGSET)
     A            PGSVIA    R        B  5  2REFFLD(RPLGSET/PGSVIA *LIBL/FPLGSET)
     A  60                                  DSPATR(HI)
     A  62                                  DSPATR(RI)
     A N60                                  COLOR(YLW)
     A  62                                  COLOR(RED)
     A            PGSEQ2    R        B  5  5REFFLD(RPLGSET/PGSEQ2 *LIBL/FPLGSET)
     A  60                                  DSPATR(ND)
     A  60                                  DSPATR(PR)
     A                                      COLOR(TRQ)
     A            PGORD#    R        O  5 10REFFLD(RPLGSET/PGORD# *LIBL/FPLGSET)
     A  60                                  DSPATR(ND)
     A                                      DSPATR(HI)
     A            PGNAME    R        O  5 17REFFLD(RPLGSET/PGNAME *LIBL/FPLGSET)
     A  60                                  DSPATR(HI)
     A            PGLGFL    R        O  5 48REFFLD(RPLGSET/PGLGFL *LIBL/FPLGSET)
     A  60                                  DSPATR(ND)
     A                                      DSPATR(HI)
     A            PGSMFL    R        O  5 53REFFLD(RPLGSET/PGSMFL *LIBL/FPLGSET)
     A  60                                  DSPATR(ND)
     A                                      DSPATR(HI)
     A            FITTOP         1A  O  6 74
     A  60                                  DSPATR(ND)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A            PREFCART       2S 0O  5 60
     A  60                                  DSPATR(ND)
     A            FITSOTHER      1A  O  6 85
     A  60                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A            SHELFCNT       4Y 1O  5 64EDTWRD('  0. ')
     A  60                                  DSPATR(ND)
     A                                      DSPATR(HI)
     A            HALF13         1A  O  6 58
     A  60                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A            HALF09         1A  O  6 63
     A  60                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A            NEW_TRUCK      4A  O  5 70
     A  60                                  DSPATR(ND)
     A                                      COLOR(BLU)
     A            NEWCART        1A  O  5 75DSPATR(HI)
     A  60                                  DSPATR(ND)
     A                                      COLOR(PNK)
     A  61                                  DSPATR(UL)
     A            CARTUSED       2Y 0O  5 78
     A  60                                  DSPATR(ND)
     A  61                                  DSPATR(UL)
     A                                      EDTCDE(4)
     A            CARTSEQ#       4Y 0O  5 82DSPATR(HI)
     A  60                                  DSPATR(ND)
     A                                      EDTCDE(4)
     A  61                                  DSPATR(UL)
     A            SHLF_END       2Y 0O  5 95
     A  60                                  DSPATR(ND)
     A                                      EDTCDE(4)
     A  61                                  DSPATR(UL)
     A            PGSKIP    R        B  5 99REFFLD(RPLGSET/PGSKIP *LIBL/FPLGSET)
     A                                      COLOR(TRQ)
     A  60                                  DSPATR(ND)
     A  60                                  DSPATR(PR)
     A            PGSEQ1    R        O  6  5REFFLD(RPLGSET/PGSEQ1 *LIBL/FPLGSET)
     A  60                                  DSPATR(ND)
     A            PGSHP2    R        O  7 17REFFLD(RPLGSET/PGSHP2 *LIBL/FPLGSET)
     A  60                                  DSPATR(ND)
     A            PGSHST    R        O  7 48REFFLD(RPLGSET/PGSHST *LIBL/FPLGSET)
     A  60                                  DSPATR(ND)
     A            PGSORT    R        O  7102REFFLD(RPLGSET/PGSORT *LIBL/FPLGSET)
     A                                      COLOR(BLU)
     A  60                                  DSPATR(ND)
     A            SHLF_STR       2Y 0O  5 87
     A  60                                  DSPATR(ND)
     A                                      DSPATR(HI)
     A                                      EDTCDE(4)
     A  61                                  DSPATR(UL)
     A            END_CART#      4Y 0O  5 90
     A  60                                  DSPATR(ND)
     A                                      EDTCDE(4)
     A  61                                  DSPATR(UL)
     A            OHLOC     R        O  5124REFFLD(RHORDR/OHLOC *LIBL/FHORDR)
     A  60                                  DSPATR(ND)
     A                                      DSPATR(HI)
     A                                  6 50'Half 13'
     A  60                                  DSPATR(ND)
     A                                  6 66'Fit Top'
     A  60                                  DSPATR(ND)
     A                                      DSPATR(HI)
     A                                  6 77'Fit Oth'
     A  60                                  DSPATR(ND)
     A            PGLOC     R        B  5107REFFLD(RPLGSET/PGLOC *LIBL/FPLGSET)
     A  60                                  DSPATR(PR)
     A N60                                  COLOR(YLW)
     A  60                                  COLOR(RED)
     A  60                                  DSPATR(ND)
     A            FORCE_LOC R        B  5117REFFLD(RPLGSET/PGSKIP *LIBL/FPLGSET)
     A                                      COLOR(TRQ)
     A  60                                  DSPATR(RI)
     A            PDSECT    R        O  6 94REFFLD(RPLGDFT/PDSECT *LIBL/FPLGDFT)
     A                                      COLOR(PNK)
     A N60                                  DSPATR(ND)
     A                                      EDTCDE(4)
     A            PDNORS    R        O  6 97REFFLD(RPLGDFT/PDNORS *LIBL/FPLGDFT)
     A                                      COLOR(PNK)
     A N60                                  DSPATR(ND)
     A            PDBAY     R        O  6 99REFFLD(RPLGDFT/PDBAY *LIBL/FPLGDFT)
     A                                      COLOR(PNK)
     A N60                                  DSPATR(ND)
     A                                      EDTCDE(4)
     A            PDLORR    R        O  6102REFFLD(RPLGDFT/PDLORR *LIBL/FPLGDFT)
     A                                      COLOR(PNK)
     A N60                                  DSPATR(ND)
     A            PDPOLE    R        O  6104REFFLD(RPLGDFT/PDPOLE *LIBL/FPLGDFT)
     A                                      COLOR(PNK)
     A N60                                  DSPATR(ND)
     A                                      EDTCDE(4)
     A            PDPSEQ         2S 0H
     A            POLE_SEQ       2S 0H
     A            OHCUST    R        O  6 10REFFLD(RHORDR/OHCUST *LIBL/FHORDR)
     A                                      COLOR(PNK)
     A  60                                  DSPATR(ND)
     A            OHSHP2    R        O  6 17REFFLD(RHORDR/OHSHP2 *LIBL/FHORDR)
     A  60                                  DSPATR(ND)
     A                                  6 88'Start'
     A                                      COLOR(PNK)
     A N60                                  DSPATR(ND)
     A                                  6108'Sort by:'
     A                                      COLOR(BLU)
     A  60                                  DSPATR(ND)
     A            TO_RULE        1A  O  6131
     A  60                                  DSPATR(ND)
     A            FLD002         4Y 0O  7 94
     A  60                                  DSPATR(ND)
     A                                      EDTCDE(4)
     A  61                                  DSPATR(UL)
     A                                  7 89'Next'
     A  60                                  DSPATR(ND)
     A            FROM_RULE      1A  O  6124DSPATR(HI)
     A  60                                  DSPATR(ND)
     A            SHPSEQ    R        O  7 83REFFLD(RPSECT/GHPSEQ *LIBL/FPSECT)
     A                                      COLOR(PNK)
     A                                      DSPATR(UL)
     A  60                                  DSPATR(ND)
     A            SHSECT    R        O  7 70REFFLD(RPSECT/GHSECT *LIBL/FPSECT)
     A                                      COLOR(PNK)
     A                                      DSPATR(UL)
     A  60                                  DSPATR(ND)
     A            SHNORS    R        O  7 73REFFLD(RPSECT/GHNORS *LIBL/FPSECT)
     A                                      COLOR(PNK)
     A                                      DSPATR(UL)
     A  60                                  DSPATR(ND)
     A            SHBAY     R        O  7 75REFFLD(RPSECT/GHBAY *LIBL/FPSECT)
     A                                      COLOR(PNK)
     A                                      DSPATR(UL)
     A  60                                  DSPATR(ND)
     A            SHLORR    R        O  7 78REFFLD(RPSECT/GHLORR *LIBL/FPSECT)
     A                                      COLOR(PNK)
     A                                      DSPATR(UL)
     A  60                                  DSPATR(ND)
     A            SHPOLE    R        O  7 80REFFLD(RPSECT/GHPOLE *LIBL/FPSECT)
     A                                      COLOR(PNK)
     A                                      DSPATR(UL)
     A  60                                  DSPATR(ND)
     A                                  6 61'9'
     A  60                                  DSPATR(ND)
     A            SHCART    R        O  7 86REFFLD(RPSECT/GHCART *LIBL/FPSECT)
     A                                      COLOR(PNK)
     A                                      DSPATR(UL)
     A  60                                  DSPATR(ND)
     A                                  7 52'Assigned Location'
     A                                      COLOR(PNK)
     A  60                                  DSPATR(ND)
     A                                  6127'To:'
     A  60                                  DSPATR(ND)
     A                                  6118'From:'
     A                                      DSPATR(HI)
     A  60                                  DSPATR(ND)
     A            OHSHPC    R        O  6  2REFFLD(RHORDR/OHSHPC *LIBL/FHORDR)
     A                                      COLOR(PNK)
     A  60                                  DSPATR(ND)
     A                                  8  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      --------------------------'
     A            DOTW           3   O  5102COLOR(BLU)
     A          R PSR30002C                 SFLCTL(PSR30002)
     A*%%TS  SD  20190204  092625  BILLB       REL-V7R2M0  5770-WDS
     A                                      CF02(02 'Print Covers')
     A                                      CF03(03 'Exit')
     A                                      CF05(05 'Refresh')
     A                                      CF09(09 'Previous Date')
     A                                      CF10(10 'Next Date')
     A                                      CF13(13 'Change Defaults')
     A                                      CF22(22 'Left Mouse Click')
     A                                      CF23(23 'Right Mouse Click')
     A                                      CF24(24 'Update Order Header Locati-
     A                                      ons')
     A                                      CF04(04 'Bay Map')
     A                                      CF06(06 'Manual Process')
     A                                      CF01(01 'Bay Map Spreadsheet')
     A                                      CF16(16 'Clear Orders')
     A                                      CF20(20 'Start Over')
     A                                      CF07(07 'Lock All')
     A                                      CF08(08 'Unlock All')
     A                                      RTNCSRLOC(&CSRRCD &CSRFLD)
     A                                      OVERLAY
     A                                      SFLCSRRRN(&SFLCSRRRN)
     A  25 26                               SFLDSP
     A  25                                  SFLDSPCTL
     A N25                                  SFLCLR
     A  27                                  SFLEND
     A                                      SFLDROP(CF11)
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0005)
     A                                      MOUBTN(*ULP *ULR CF22)
     A                                      MOUBTN(*URP *URR CF23)
     A            SFLPOSTO1      4S 0H      SFLRCDNBR(CURSOR)
     A            SFLCSRRRN      5S 0H
     A            CSRFLD        10A  H
     A            CSRRCD        10A  H
     A                                  1  2'PSR30002'
     A                                      COLOR(BLU)
     A                                  2  2USER
     A                                      COLOR(BLU)
     A                                  1 21'Ship Date:'
     A                                      COLOR(PNK)
     A                                  1125DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2125TIME
     A                                      COLOR(BLU)
     A            SDATE          6Y 0B  1 33EDTCDE(Y)
     A                                      COLOR(YLW)
     A                                  1 52'  Plug Shipping Layout Tool  '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  4 11'Order'
     A                                      DSPATR(HI)
     A                                  4 17'Customer'
     A                                  4 49'Flat'
     A                                      DSPATR(HI)
     A                                  4 54'Flat'
     A                                      DSPATR(HI)
     A                                  3 55'Sm.'
     A                                      DSPATR(HI)
     A                                  3 50'Lg.'
     A                                      DSPATR(HI)
     A                                  4  6'Seq'
     A                                  4  2'SV'
     A                                      DSPATR(HI)
     A                                  4124'Location'
     A                                      DSPATR(HI)
     A                                  2 22'Master #:'
     A                                      COLOR(PNK)
     A            SGMSTR    R        B  2 33REFFLD(RPLGSET/PGMSTR *LIBL/FPLGSET)
     A                                      COLOR(YLW)
     A                                  4 59'Cart'
     A                                  3 59'Pref'
     A                                  3 64'Shelf'
     A                                      DSPATR(HI)
     A                                  4 64'Count'
     A                                      DSPATR(HI)
     A                                  4 73'New'
     A                                      COLOR(PNK)
     A                                  3 97'Force'
     A                                      COLOR(TRQ)
     A                                  4 98'Skip'
     A                                      COLOR(TRQ)
     A                                  4 82'Seq/Shf'
     A                                      DSPATR(HI)
     A                                  4 90'Seq/Shf'
     A                                  3 92'To'
     A                                  3 83'From'
     A                                      DSPATR(HI)
     A                                  4 77'Cart'
     A                                  3115'Force'
     A                                      COLOR(TRQ)
     A                                  4116'Locn'
     A                                      COLOR(TRQ)
     A                                  4107'Location'
     A                                      DSPATR(HI)
     A                                  1 98'12 Shelf Carts:'
     A                                  2 96'DS 9 Shelf Carts:'
     A            CARTS_12       4Y 0O  1114EDTCDE(4)
     A                                      DSPATR(HI)
     A            CARTS_9        4Y 0O  2114EDTCDE(4)
     A                                      DSPATR(HI)
     A          R PSR30002F
     A*%%TS  SD  20110104  130729  BILLB       REL-V5R4M0  5722-WDS
     A                                      OVERLAY
     A                                 26  2'F3'
     A                                      DSPATR(HI)
     A                                 26  5'=Exit'
     A                                      COLOR(BLU)
     A                                 26 67'F9/F10'
     A                                      DSPATR(HI)
     A                                 26 38'F5'
     A                                      DSPATR(HI)
     A                                 26 41'=Refresh'
     A                                      COLOR(BLU)
     A                                 26 74'=Prev/Next Wk'
     A                                      COLOR(BLU)
     A                                 27108'F13'
     A                                      DSPATR(HI)
     A                                 27112'=SVia Defaults'
     A                                      COLOR(BLU)
     A                                 26108'F24'
     A                                      DSPATR(HI)
     A                                 26 12'F4'
     A                                      DSPATR(HI)
     A                                 26 15'=Bay Availability Map'
     A                                      COLOR(BLU)
     A                                 27 38'F6'
     A                                      DSPATR(HI)
     A                                 27 41'=Manual'
     A                                      COLOR(BLU)
     A                                 27 67'F11'
     A                                      DSPATR(HI)
     A                                 27 71'=More/Less Info'
     A                                      COLOR(BLU)
     A                                 26112'=Update Locations'
     A                                      COLOR(BLU)
     A                                 27 12'F1'
     A                                      DSPATR(HI)
     A                                 27 15'=Bay Map Spreadsheet'
     A                                      COLOR(BLU)
     A                                 26 89'F16'
     A                                      DSPATR(HI)
     A                                 27 93'=Start Over'
     A                                      COLOR(RED)
     A                                 27 89'F20'
     A                                      DSPATR(HI)
     A                                 26 93'=Clear Orders'
     A                                      COLOR(RED)
     A                                 26 51'F7'
     A                                      DSPATR(HI)
     A                                 26 54'=Lock All'
     A                                      COLOR(BLU)
     A                                 27 51'F8'
     A                                      DSPATR(HI)
     A                                 27 54'=Unlock All'
     A                                      COLOR(BLU)
     A                                 27  2'F2'
     A                                      DSPATR(HI)
     A                                 27  5'=Cover'
     A                                      COLOR(BLU)
     A          R PSR30003                  SFL
     A*%%TS  SD  20100208  123346  BILLB       REL-V5R3M0  5722-WDS
     A                                      TEXT('Alpha Search Subfile')
     A  28                                  SFLNXTCHG
     A            SVCODE    R        O  6 19REFFLD(RMSVIA/SVCODE *LIBL/FMSVIA)
     A                                      COLOR(PNK)
     A            SVDESC    R        O  6 24REFFLD(RMSVIA/SVDESC *LIBL/FMSVIA)
     A            PDSTUF    R        B  6 58REFFLD(RPLGDFT/PDSTUF *LIBL/FPLGDFT)
     A                                      COLOR(YLW)
     A            TBSHRT    R        O  6 62REFFLD(TBMASTR/TBSHRT *LIBL/XATABL)
     A                                      DSPATR(HI)
     A            PDSKPS    R        B  6 82REFFLD(RPLGDFT/PDSKPS *LIBL/FPLGDFT)
     A                                      EDTCDE(4)
     A            PDBACK    R        B  6 93REFFLD(RPLGDFT/PDBACK *LIBL/FPLGDFT)
     A            PDSECT    R        B  6103REFFLD(RPLGDFT/PDSECT *LIBL/FPLGDFT)
     A                                      EDTCDE(4)
     A                                      COLOR(TRQ)
     A            PDNORS    R        B  6108REFFLD(RPLGDFT/PDNORS *LIBL/FPLGDFT)
     A                                      COLOR(TRQ)
     A            PDBAY     R        B  6111REFFLD(RPLGDFT/PDBAY *LIBL/FPLGDFT)
     A                                      EDTCDE(4)
     A                                      COLOR(TRQ)
     A            PDLORR    R        B  6116REFFLD(RPLGDFT/PDLORR *LIBL/FPLGDFT)
     A                                      COLOR(TRQ)
     A            PDPOLE    R        B  6120REFFLD(RPLGDFT/PDPOLE *LIBL/FPLGDFT)
     A                                      EDTCDE(4)
     A                                      COLOR(TRQ)
     A                                  7 44' '
     A            PDSEQ#    R        B  6 11REFFLD(RPLGDFT/PDSEQ# *LIBL/FPLGDFT)
     A                                      EDTCDE(4)
     A                                      COLOR(TRQ)
     A          R PSR30003C                 SFLCTL(PSR30003)
     A*%%TS  SD  20100202  141443  BILLB       REL-V5R3M0  5722-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0010)
     A                                      CF03(03 'Exit')
     A                                      CF06(06 'New')
     A                                      CF12(12 'Cancel')
     A                                      OVERLAY
     A                                      SFLCSRRRN(&SFLCSRRRN)
     A  25 26                               SFLDSP
     A  25                                  SFLDSPCTL
     A N25                                  SFLCLR
     A  27                                  SFLEND
     A                                      SFLDROP(CF11)
     A            SFLCSRRRN      5S 0H
     A                                  1  2'PSR30003'
     A                                      COLOR(BLU)
     A                                  2  2USER
     A                                      COLOR(BLU)
     A                                  1124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2124TIME
     A                                      COLOR(BLU)
     A                                  1 52'  Plug Shipping Layout Tool  '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  2 56'  Ship Via Defaults  '
     A                                      DSPATR(HI)
     A                                  4 18'Ship'
     A                                      DSPATR(HI)
     A                                  5 18'Via'
     A                                      DSPATR(HI)
     A                                  5102'Sect'
     A                                      DSPATR(HI)
     A                                  5107'N/S'
     A                                      DSPATR(HI)
     A                                  5111'Bay'
     A                                      DSPATR(HI)
     A                                  5115'L/R'
     A                                      DSPATR(HI)
     A                                  5119'Pole'
     A                                      DSPATR(HI)
     A                                  5 25'Ship'
     A                                      DSPATR(HI)
     A                                  5 30'Via'
     A                                      DSPATR(HI)
     A                                  5 34'Description'
     A                                      DSPATR(HI)
     A                                  5 57'Stuffing'
     A                                      DSPATR(HI)
     A                                  5 66'Method'
     A                                      DSPATR(HI)
     A                                  4 80'Skip'
     A                                      DSPATR(HI)
     A                                  5 79'Shelves'
     A                                      DSPATR(HI)
     A                                  4 90'Search'
     A                                      DSPATR(HI)
     A                                  5 89'Backwards'
     A                                      DSPATR(HI)
     A                                  4 10'Seq.'
     A                                      DSPATR(HI)
     A                                  5 10'Num.'
     A                                      DSPATR(HI)
     A          R PSR30003F
     A*%%TS  SD  20100126  120940  BILLB       REL-V5R3M0  5722-WDS
     A                                      OVERLAY
     A                                 27  3'F3'
     A                                      DSPATR(HI)
     A                                 27  6'=Exit'
     A                                      COLOR(BLU)
     A                                 27125'=Done'
     A                                      COLOR(BLU)
     A                                 27121'F12'
     A                                      DSPATR(HI)
     A                                 27 63'F6'
     A                                      DSPATR(HI)
     A                                 27 66'=Add'
     A                                      COLOR(BLU)
     A          R MSGDATA                   SFL
     A*%%TS  SD  20040405  131906  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages')
     A                                      SFLMSGRCD(24)
     A            $#MSKY                    SFLMSGKEY
     A            $#PGMQ                    SFLPGMQ(10)
     A          R MSGCTL                    SFLCTL(MSGDATA)
     A*%%TS  SD  20040406  091800  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages Control')
     A  50                                  ALARM
     A                                      OVERLAY
     A N92                                  SFLDSP
     A N92                                  SFLDSPCTL
     A N92                                  SFLINZ
     A N92                                  SFLEND
     A                                      SFLSIZ(0002)
     A                                      SFLPAG(0001)
     A            $#PGMQ                    SFLPGMQ(10)
     A          R ASSUME
     A*%%TS  SD  20040423  114217  BILLB       REL-V5R1M0  5722-WDS
     A                                      ASSUME
     A                                  1  3' ASSUME                           -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                         -
     A                                                                  '
