     A*%%TS  SD  20000823  133151  EFD         REL-V3R7M0  5716-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      USRDSPMGT
     A                                      CF03
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  19981106  095154  EFD         REL-V3R6M0  5716-PW1
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HLPRTN
     A                                      HOME
     A                                      HELP
     A                                      ALWROL
     A                                      INVITE
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                      PRINT(*PGM)
     A                                  1  2'QPK700'
     A                                  1 28' Update Germination Weeks '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  5 25'Product Class?'
     A            VPC            2A  B  5 46DSPATR(CS)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A  10                                  ERRMSG('*** Enter A Valid Product C-
     A                                      lass.           Press Reset')
     A                                  7 25'Alpha Search:'
     A            VALPHA         7A  B  7 41DSPATR(CS)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A  20                                  ERRMSG('*** An Alpha Search Of At L-
     A                                      east 4 Letters Is Required.     Pre-
     A                                      ss Reset')
     A                                 21 15' Validate Data - Change or Press E-
     A                                      nter to Continue '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'                     Enter Process-
     A                                           F3/F7=End of Job              -
     A                                               '
     A                                      DSPATR(UL)
     A            VDESC         30A  O  5 50
     A          R SCRNB
     A*%%TS  SD  19981107  145123  EFD         REL-V3R6M0  5716-PW1
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HLPRTN
     A                                      HOME
     A                                      HELP
     A                                      ALWROL
     A                                      INVITE
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                      PRINT(*PGM)
     A                                  1  2'QPK700'
     A                                  1 28' Update Germination Weeks '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  5 25'Product Class?'
     A                                  7 25'Alpha Search:'
     A                                 10  2'Enter New Weeks:'
     A                                 10 25'Beg MM/DD     End MM/DD    Wks/Ger-
     A                                      m'
     A                                      DSPATR(UL)
     A                                 12 21'1.'
     A            VB1            4Y 0B 12 29DSPATR(CS)
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A  40                                  ERRMSG('*** Week 1 Is Required.    -
     A                                           Press Reset')
     A  41                                  ERRMSG('*** Enter A Valid Month/Day-
     A                                      .     Press Reset')
     A                                      EDTWRD('  / 0')
     A            VE1            4Y 0B 12 43DSPATR(CS)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A  31                                  ERRMSG('*** Week 1 Is Required.    -
     A                                        Press Reset')
     A                                      EDTWRD('  / 0')
     A            VWK1           2Y 0B 12 55DSPATR(CS)
     A                                      EDTCDE(Z)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A  32                                  ERRMSG('*** Weeks to Germ 1 Is Requ-
     A                                      ired.    Press Reset')
     A                                 13 21'2.'
     A            VB2            4Y 0B 13 29DSPATR(CS)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A  33                                  ERRMSG('*** All 3 Fields Are Requir-
     A                                      ed.     Press Reset')
     A                                      EDTWRD('  / 0')
     A            VE2            4Y 0B 13 43DSPATR(CS)
     A                                      EDTWRD('  / 0')
     A            VWK2           2Y 0B 13 55DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                 14 21'3.'
     A            VB3            4Y 0B 14 29DSPATR(CS)
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A  34                                  ERRMSG('*** All 3 Fields Are Requir-
     A                                      ed.     Press Reset')
     A                                      EDTWRD('  / 0')
     A            VE3            4Y 0B 14 43DSPATR(CS)
     A                                      EDTWRD('  / 0')
     A            VWK3           2Y 0B 14 55DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                 15 21'4.'
     A            VB4            4Y 0B 15 29DSPATR(CS)
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A  35                                  ERRMSG('*** All 3 Fields Are Requir-
     A                                      ed.    Press Reset')
     A                                      EDTWRD('  / 0')
     A            VE4            4Y 0B 15 43DSPATR(CS)
     A                                      EDTWRD('  / 0')
     A            VWK4           2Y 0B 15 55DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                 21 15' Validate Data - Change or Press E-
     A                                      nter to Continue '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'                     Enter Process-
     A                                           F3/F7=End of Job              -
     A                                               '
     A                                      DSPATR(UL)
     A            VDESC         30A  O  5 50
     A            VPC            2A  O  5 46
     A            VALPHA         7A  O  7 41
