     A*%%TS  SD  19980205  060833  GINNY       REL-V3R1M0  5763-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      USRDSPMGT
     A          R SCRNA
     A*%%TS  SD  19980205  060833  GINNY       REL-V3R1M0  5763-PW1
     A                                      CF02
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF03
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A            PROGID        10A  O  1  2
     A                                  1 27' Sales Analysis By Customer '
     A                                      DSPATR(RI)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 35' Top Ranked '
     A                                      DSPATR(UL)
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  5 23'For Accounting Period:'
     A            VACTP          2Y 0B  5 53DSPATR(CS)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(RI)
     A                                      DSPATR(PC)
     A  11                                  ERRMSG('*** Enter A Valid Accountin-
     A                                      g Period.   Press Reset')
     A  12                                  ERRMSG('*** Accounting Period 13 No-
     A                                      t Valid For This Company.   Press R-
     A                                      eset')
     A                                      CHECK(RB)
     A                                  7 23'# of Customers to Rank:'
     A            VRANK          6Y 0B  7 49DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A                                  7 57'*'
     A                                      DSPATR(HI)
     A                                  9 23'Rank By:'
     A            VDOLUN         1Y 0B  9 54DSPATR(CS)
     A                                      EDTCDE(Z)
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                      CHECK(RB)
     A  16                                  ERRMSG('*** Valid Entries are 1 or -
     A                                      2.     Press Reset')
     A                                  9 57'1 = Dollars'
     A                                 10 57'2 = Units'
     A                                 20 22'* Leave blank to select ALL custom-
     A                                      ers'
     A                                      DSPATR(HI)
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'  Enter to Process     F2=Display -
     A                                      Acctg. Period         F7=Cancel Job-
     A                                               '
     A                                      DSPATR(UL)
