     A*%%TS  SD  19990806  062331  TGMS        REL-V4R2M0  5769-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      USRDSPMGT
     A          R SCRNA
     A*%%TS  SD  19970108  075736  GINNY       REL-V3R1M0  5763-PW1
     A                                      CF07
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      CF01
     A                                      HOME
     A                                      HELP
     A                                      CF03
     A                                      DSPMOD(*DS3)
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                  1 28' Sales Analysis Year End '
     A                                      DSPATR(RI)
     A                                  1 66'Date:'
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 66'Time:'
     A                                  2 72TIME
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'                               F3/-
     A                                      F7=Cancel Job                      -
     A                                               '
     A                                      DSPATR(UL)
     A            PROGID        10   O  1  2
     A                                  5 29'Company Number:'
     A            VCO            2Y 0B  5 50
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A                                      EDTCDE(Z)
     A  10                                  ERRMSG('*** Enter A Valid Company N-
     A                                      umber.    Press Reset')
     A                                 14  3' Sales Analysis Year End moves the-
     A                                       monthly sales from the current yea-
     A                                      r to   '
     A                                 15  3' the prior year.   Sales Analysis -
     A                                      records with no activity for two ye-
     A                                      ars    '
     A                                 16  3' will be deleted.                 -
     A                                                                         -
     A                                              '
     A                                 18  4'This should only be run after all -
     A                                      invoices and credit memos have been-
     A                                          '
     A                                 19  4'posted for the year.              -
     A                                                                         -
     A                                          '
     A                                 12  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                 10 30' Press F1 to Continue '
     A N50                                  DSPATR(RI)
     A  50                                  DSPATR(ND)
