     A*%%TS  SD  20050718  105649  BILLB       REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF06
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  20050718  105649  BILLB       REL-V5R2M0  5722-WDS
     A                                      CF11(11)
     A                                  1  2'SDR360A'
     A                                  2  2USER
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  1 26' Cost vs Price Report Prompt '
     A                                      DSPATR(RI)
     A            ALPHA         15A  B  7 32DSPATR(CS)
     A                                 10 17'Size Code:'
     A            SIZE           3A  B 10 32
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A  10                                  ERRMSG('*** Invalid Size Code Enter-
     A                                      ed.         Press RESET')
     A                                 24  2'Enter to Process                 F-
     A                                      6=Restart                   F3/F7=E-
     A                                      nd of Job'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                 23  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  7 17'Alpha Search:'
     A                                  7 49'Enter as many characters as you'
     A                                  8 49'want to compare with.'
     A                                 10 38'Only enter size code to limit repo-
     A                                      rt to '
     A                                 11 38'that size code.'
     A                                  5 13'Leave both fields blank to display-
     A                                       All inventory items.'
     A                                      DSPATR(UL)
     A                                 14 35'Printer ID:'
     A            LPRTR         10A  B 14 53DSPATR(CS)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A  50                                  ERRMSG('*** Printer ID Is Required.-
     A                                           Press Reset')
     A                                 15 35'Forms Number:'
     A            LFORM         10A  B 15 53DSPATR(CS)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A  51                                  ERRMSG('*** Forms Number Is Require-
     A                                      d.    Press Reset')
     A                                 16 35'Number of Copies:'
     A            LCOPY          2Y 0B 16 61
     A  52                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  52                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A  52                                  ERRMSG('*** Number of Copies Is Req-
     A                                      uired.    Press Reset')
     A                                 17 35'Run From JobQ:'
     A            LJOBQ          1A  B 17 62DSPATR(CS)
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A  53                                  ERRMSG('*** Valid Entries Are Y or -
     A                                      N.     Press Reset')
     A                                 18 35'Print Status:'
     A            VOUT           1Y 0B 18 62
     A  54                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  54                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A  54                                  ERRMSG('*** Valid Entries Are 1, 2 -
     A                                      or 3.    Press Reset')
     A                                 18 66'1 = Print'
     A                                 19 66'2 = Print/Save'
     A                                 20 66'3 = Hold'
     A                                 21  7'Use'
     A                                      COLOR(PNK)
     A                                 21 11'F11'
     A                                      DSPATR(HI)
     A                                 21 15'to clear Download File'
     A                                      COLOR(PNK)
     A                                 22  8'(Used for excel spreadsheet)'
     A                                      COLOR(BLU)
     A                                 12  4'NOTES:'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                 13  2'-This report omits any item'
     A                                      COLOR(BLU)
     A                                 14  3'not marked Lot Control = ''Y'''
     A                                      COLOR(BLU)
     A                                 15  2'-This report does not include'
     A                                      COLOR(BLU)
     A                                 16  3'location code = ''K'''
     A                                      COLOR(BLU)
