     A*%%TS  SD  19990407  195128  EFD         REL-V3R7M0  5716-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  19990407  195128  EFD         REL-V3R7M0  5716-PW1
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      SLNO(01)
     A          H                           HLPRCD(HELP)
     A                                      HLPARA(01 002 24 080)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                 19 20'Print Status:'
     A                                  1  2'SOR30AA'
     A                                  1 20' Shipped Order History Report by C-
     A                                      ustomer '
     A                                      DSPATR(RI)
     A                                  5 20'Customer Number:'
     A                                  6 20'or Alpha Search:'
     A            CUST           6Y 0B  5 44
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A  10                                  ERRMSG('*** Invalid Customer Number-
     A                                       Entered.   Press RESET')
     A            ALPHA         15A  B  6 37DSPATR(CS)
     A            CMNAME        30A  O  5 51
     A                                  8 20'Ship From Location?'
     A            SHFR           3A  B  8 47
     A  20                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  20                                  DSPATR(PC)
     A  20                                  ERRMSG('*** Invalid Ship From Locat-
     A                                      ion.        Press RESET')
     A                                  8 51'NOTE: Leave ship from blank'
     A                                      DSPATR(UL)
     A                                  9 57'to get all ship froms.'
     A                                      DSPATR(UL)
     A                                 15 20'Forms Number:'
     A            VFORM          4A  B 15 46DSPATR(CS)
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A  17                                  ERRMSG('*** Entry Is Required.     -
     A                                              Press Reset')
     A                                 16 20'Number of Copies:'
     A            VCOPY          2Y 0B 16 48
     A  18                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  18                                  DSPATR(PC)
     A                                      EDTCDE(3)
     A  18                                  ERRMSG('*** Number Of Copies Is Req-
     A                                      uired.     Press Reset')
     A                                 17 20'JOBQ (Y/N):'
     A            VJOB           1X  B 17 49DSPATR(CS)
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A  19                                  ERRMSG('*** Valid Entries Are Y or -
     A                                      N.        Press Reset')
     A                                 18 20'Printer ID:'
     A            VPRTR         10A  B 18 40
     A  52                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  52                                  DSPATR(PC)
     A  52                                  ERRMSG('*** Printer ID Is Required.-
     A                                          Press Reset')
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'                  Enter to Process-
     A                                                      F3/ F7=Cancel Job  -
     A                                               '
     A                                      DSPATR(UL)
     A                                 19 26'Print Status:'
     A            VOUT           1Y 0B 19 49EDTCDE(3)
     A  53                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  53                                  DSPATR(PC)
     A  53                                  ERRMSG('*** Valid Entries Are 1, 2 -
     A                                      or 3.       Press Reset')
     A                                 19 51'1 = Print'
     A                                 20 51'2 = Print/Save'
     A                                 21 51'3 = Hold'
     A                                 10 20'Begining Date:'
     A                                 12 20'Ending Date:'
     A            BEGDAT         6Y 0B 10 42
     A  30                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  30                                  DSPATR(PC)
     A                                      EDTCDE(Y)
     A  30                                  ERRMSG('*** Invalid Begining Date E-
     A                                      ntered.     Press RESET')
     A            ENDDAT         6Y 0B 12 42
     A  35                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  35                                  DSPATR(PC)
     A                                      EDTCDE(Y)
     A  35N36                               ERRMSG('*** Invalid Begining Date E-
     A                                      ntered.     Press RESET')
     A  35 36                               ERRMSG('*** Ending Date Must be Lat-
     A                                      er than Begining Date.    Press RES-
     A                                      ET')
     A          R HELP
     A*%%TS  SD  19980114  055711  GINNY       REL-V3R1M0  5763-PW1
     A                                  7  2' Vendor Master Listing            -
     A                                                                      Ove-
     A                                      rview    '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(HI)
     A                                  9  2' The vendor master listing prints -
     A                                      a report showing all of the data in-
     A                                       the     '
     A                                      DSPATR(HI)
     A                                 10  2' vendor master file.              -
     A                                                                         -
     A                                               '
     A                                      DSPATR(HI)
     A                                 11  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(HI)
     A                                 12  2' You can choose to print the list -
     A                                      in order by vendor number - or - by-
     A                                       the     '
     A                                      DSPATR(HI)
     A                                 13  2' vendor alpha search.             -
     A                                                                         -
     A                                               '
     A                                      DSPATR(HI)
     A                                 14  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(HI)
     A                                 15  2' If you select to print by vendor -
     A                                      number - you can choose to print on-
     A                                      ly a     '
     A                                      DSPATR(HI)
     A                                 16  2' range of vendor numbers.         -
     A                                                                         -
     A                                               '
     A                                      DSPATR(HI)
     A                                 20  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(HI)
     A                                 21  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(HI)
     A                                 22  2'                            Press -
     A                                      Enter to Return                    -
     A                                               '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  2' If you select to print by vendor -
     A                                      alpha - you can choose to print onl-
     A                                      y a      '
     A                                      DSPATR(HI)
     A                                 19  2' range of vendors within a range o-
     A                                      f alpha characters.                -
     A                                               '
     A                                      DSPATR(HI)
     A                                 17  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(HI)
