     A*%%TS  SD  20080118  135739  BILLB       REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      INDARA
     A                                      VLDCMDKEY(48 'Valid Function Key Pr-
     A                                      essed')
     A* *DS3                                WINDOW(2 15 21 50)
     A* *DS4                                WINDOW(5 25 16 30)
     A          R SOW03001
     A*%%TS  SD  20080118  133734  BILLB       REL-V5R3M0  5722-WDS
     A                                      CF03(03 'Exit')
     A                                      CF07(07 'Exit (Old School)')
     A                                      CF05(05 'Refresh Counter')
     A                                      CF09(09 'View Un-Sown Trays')
     A                                      INZRCD
     A  50                                  ALARM
     A                                      OVERLAY
     A                                 23  2'<ENTER>'
     A                                      DSPATR(HI)
     A                                 23 10'to Continue'
     A                                      COLOR(BLU)
     A  61                              2 25'     Recip Sow Confirmation    '
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 72TIME
     A                                      COLOR(BLU)
     A                                  2  2USER
     A                                      COLOR(BLU)
     A                                  1  2'SOW030'
     A                                      COLOR(BLU)
     A                                 22  1'                                  -
     A                                                                         -
     A                                       SOW03001  '
     A                                      DSPATR(UL)
     A                                      COLOR(BLU)
     A                                  7 16'Type or scan the Tray Tag number t-
     A                                      o be confirmed.'
     A            TAG            8Y 0B 13 37EDTCDE(4)
     A                                      CHECK(ER)
     A                                      COLOR(YLW)
     A                                 11 34'              '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12 34' '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12 47' '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13 34' '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13 47' '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14 34' '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14 47' '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15 34'              '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19 47'Last Good Tray:'
     A                                      COLOR(PNK)
     A            LASTTAG        8S 0O 19 64DSPATR(HI)
     A                                 23 72'F3'
     A                                      DSPATR(HI)
     A                                 23 75'=Exit'
     A                                      COLOR(BLU)
     A                                 23 27'F5'
     A                                      DSPATR(HI)
     A                                 23 30'=Refresh Count'
     A                                      COLOR(BLU)
     A                                 23 50'F9'
     A                                      DSPATR(HI)
     A                                 23 53'=View Unsown'
     A                                      COLOR(BLU)
     A  62                              2 22'   Rooted Cuttings Sow Confirmatio-
     A                                      n   '
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A  63                              2 20'   Transplanted Items Sow Confirma-
     A                                      tion   '
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A  63                             11  3'*** For Transplanted Items,'
     A                                      COLOR(PNK)
     A  63                             12  3'it may be easier to use F9'
     A                                      COLOR(PNK)
     A  63                             13  3'to record your completed work'
     A                                      COLOR(PNK)
     A  63                             14  3'on an item by item basis'
     A                                      COLOR(PNK)
     A                                  8 14'or Type or scan a new Employee Num-
     A                                      ber to Change Sower.'
     A                                  5 20'Current Sower:'
     A                                      DSPATR(HI)
     A            NAME          25   O  5 36COLOR(PNK)
     A          R MSGDATA                   SFL
     A*%%TS  SD  20040319  114608  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages')
     A  *DS3                                SFLMSGRCD(24)
     A  *DS4                                SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            PGMQ                      SFLPGMQ
     A          R MSGCTL                    SFLCTL(MSGDATA)
     A*%%TS  SD  20040319  114608  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages')
     A                                      OVERLAY
     A N92                                  SFLDSP
     A N92                                  SFLDSPCTL
     A N92                                  SFLINZ
     A N92                                  SFLEND
     A  *DS3                                SFLSIZ(0002)
     A  *DS4                                SFLSIZ(0002)
     A  *DS3                                SFLPAG(0001)
     A  *DS4                                SFLPAG(0001)
     A            PGMQ                      SFLPGMQ
     A          R ASSUME
     A*%%TS  SD  20040621  100219  BILLB       REL-V5R1M0  5722-WDS
     A                                      ASSUME
     A                                  1  3' '
     A          R CLOCKIN
     A*%%TS  SD  20080118  135739  BILLB       REL-V5R3M0  5722-WDS
     A  *DS3                                WINDOW(5 27 9 25)
     A  *DS4                                WINDOW(5 27 9 25)
     A                                      CF03(03 'Exit')
     A  57                                  CF01(01 'Clock In')
     A                                  1  1'    Enter Time Card #    '
     A                                      DSPATR(RI)
     A            TIMECARD       8Y 0B  3 10DSPATR(CS)
     A                                      CHECK(ME)
     A                                      CHECK(ER)
     A                                      EDTCDE(4)
     A  57                              5  4'You must be clocked'
     A                                      COLOR(BLU)
     A  57                              6  4'in as'
     A                                      COLOR(BLU)
     A  57                              6 10'Sowing (R)ecip'
     A                                      COLOR(PNK)
     A  57                              7  1'     to run sowing.      '
     A                                      COLOR(BLU)
     A                                      DSPATR(UL)
     A                                  8  1'F3'
     A                                      DSPATR(HI)
     A                                  8  4'=Exit'
     A                                      COLOR(BLU)
     A  57                              8 12'F1'
     A                                      DSPATR(HI)
     A  57                              8 15'=Clock In'
     A                                      COLOR(BLU)
     A N57                              7  1'                         '
     A                                      COLOR(BLU)
     A                                      DSPATR(UL)
     A N57                              5  5'Enter or scan your'
     A N57                              6  3'Timecard Number above'
