     A*%%TS  SD  20010914  141637  EFD         REL-V5R1M0  5722-WDS
     A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A                                      CF03
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  19981207  184007  EFD         REL-V3R7M0  5716-PW1
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      CF01
     A                                      ALWROL
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                  6 23'Begining Date:'
     A            VDATE          6Y 0B  6 38EDTCDE(Y)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A  10                                  ERRMSG('*** Enter A Valid Monday Da-
     A                                      te.   Press Reset')
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2' Enter to Process                 -
     A                                                                 F3/F7=En-
     A                                      d of Job '
     A                                      DSPATR(UL)
     A            PROGID        10A  O  1  2
     A                                  1 22' Review Available for Selected Wee-
     A                                      ks '
     A                                      DSPATR(RI)
     A                                  9 23'Size Code?'
     A            SIZCD          3A  B  9 36
     A  20                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  20                                  DSPATR(PC)
     A  20                                  ERRMSG('*** Invalid Size Code.     -
     A                                                 Press RESET')
     A                                  9 42'NOTE: Leave Blank to Show all'
     A                                 10 48'Size Codes.'
     A                                 12 23'Display Type:'
     A                                      DSPATR(ND)
     A            TYPE           1A  B 12 37VALUES('1' '2' '3')
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
     A                                 12 39'TYPE:'
     A                                      DSPATR(ND)
     A                                 12 45'1=All Available'
     A                                      DSPATR(ND)
     A                                 13 45'2=Only Plainview Spec'
     A                                      DSPATR(ND)
     A                                 14 45'3=Selected Customer'
     A                                      DSPATR(ND)
     A                                 16 23'Selected Customer:'
     A                                      DSPATR(ND)
     A            CUST           6Y 0B 16 43CHECK(RB)
     A  30                                  ERRMSG('Invalid Customer Number.   -
     A                                                  Press RESET')
     A                                      EDTCDE(4)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
     A                                 16 52'F1=Alpha Search'
     A                                      DSPATR(ND)
     A                                  3 23'Last Fixed Date:'
     A            LSFXMD         6Y 0O  3 40EDTCDE(Y)
     A                                      DSPATR(UL)
     A          R LOTSFL                    SFL
     A*%%TS  SD  20010914  141637  EFD         REL-V5R1M0  5722-WDS
     A            ITEM           5A  O  8  2
     A            OSIZE          3A  O  8  8
     A            IMDES1        30A  O  8 12
     A            CMBABB         5A  O  8 43
     A            AVAL1          5Y 0O  8 49EDTCDE(K)
     A            AVAL2          5Y 0O  8 57EDTCDE(K)
     A            AVAL3          5Y 0O  8 65EDTCDE(K)
     A            AVAL4          5Y 0O  8 73EDTCDE(K)
     A          R LOTCTL                    SFLCTL(LOTSFL)
     A*%%TS  SD  20010914  135402  EFD         REL-V5R1M0  5722-WDS
     A  *DS3                                SFLSIZ(0500)
     A  *DS4                                SFLSIZ(0500)
     A  *DS3                                SFLPAG(0016)
     A  *DS4                                SFLPAG(0016)
     A                                      CF06
     A                                      CF01
     A                                      CF02
     A                                      CF13
     A N80                                  SFLDSP
     A N80                                  SFLDSPCTL
     A  80                                  SFLCLR
     A                                  2  2'SPC070SFL'
     A                                  3  2USER
     A                                  2 73DATE
     A                                      EDTCDE(Y)
     A                                  3 73TIME
     A                                  2 28' Lot Availability Inquiry '
     A                                      DSPATR(RI)
     A                                  3 28'Last Date Fixed:'
     A            LSFXMD         6Y 0O  3 45EDTCDE(Y)
     A                                      DSPATR(UL)
     A                                  1  3'Enter Restart  Roll    F1=Back 4 W-
     A                                      eeks    F2=Ahead 4 Weeks   F13=Prin-
     A                                      t Report'
     A                                      DSPATR(RI)
     A                                  5  2'Size Code:'
     A                                  6  2'Customer:'
     A            SZDESC        10A  O  5 17
     A            CNAME         30A  O  6 12
     A                                  7  2'Item Size Description             -
     A                                            Broker'
     A                                      DSPATR(UL)
     A            WEEK1          4Y 0O  7 50EDTCDE(Y)
     A            WEEK2          4Y 0O  7 58EDTCDE(Y)
     A            WEEK3          4Y 0O  7 66EDTCDE(Y)
     A            WEEK4          4Y 0O  7 74EDTCDE(Y)
     A            SIZCD          3A  O  5 13
     A            WEK#1          4Y 0O  6 50EDTWRD('0 -  ')
     A            WEK#2          4Y 0O  6 58EDTWRD('0 -  ')
     A            WEK#3          4Y 0O  6 66EDTWRD('0 -  ')
     A            WEK#4          4Y 0O  6 74EDTWRD('0 -  ')
