     A*%%TS  SD  19980624  114027  EFD         REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF06
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  19980624  114027  EFD         REL-V3R7M0  5716-PW1
     A                                  1  2'STC325A'
     A                                  2  2USER
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  2 20' Standing Order Daily List Prompt -
     A                                      Screen '
     A                                      DSPATR(RI)
     A                                  5 20'Department'
     A            DESHFR         3A  O  5 32
     A            DEDESC        30A  O  5 36
     A                                  9  7'Enter Requested Ship Date Wanted:'
     A            REQDAT         6Y 0B  9 41
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A                                      EDTCDE(Y)
     A  11                                  ERRMSG('*** Invalid Date Entered.  -
     A                                                  Press RESET')
     A  12                                  ERRMSG('*** Date Cannot be prior to-
     A                                       todays date. Press RESET')
     A  13                                  ERRMSG('*** Date is later than stan-
     A                                      ding orders have been released thru-
     A                                      .   Press RESET')
     A            DAYNAM         9   O  9 51
     A                                 13 10' Check Date if OK press ENTER to c-
     A                                      ontinue, Else make changes. '
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                 23  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 24  2'Enter To Process                F6-
     A                                      =Restart                    F3/F7=C-
     A                                      ancel Job'
     A                                      DSPATR(UL)
