     A*%%TS  SD  20011002  175610  EFD         REL-V4R4M0  5769-PW1
0000 A*0IGC 0DS4  V2R1M0                    901214
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF07
     A          R SCRNA
     A*%%TS  SD  20011002  175610  EFD         REL-V4R4M0  5769-PW1
     A                                      CLEAR
     A                                      HOME
     A                                      HELP
     A                                      SLNO(01)
     A          H                           HLPRCD(HELP)
     A                                      HLPARA(01 002 24 080)
     A                                  1 67'Date:'
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 67'Time:'
     A                                  2 73TIME
     A                                 19 20'Print Status:'
     A                                  1  2'STC410A'
     A                                  9 21'Ship From Location?'
     A            SHFR           3A  B  9 47
     A  20                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  20                                  DSPATR(PC)
     A  20                                  ERRMSG('*** Invalid Ship From Locat-
     A                                      ion.        Press RESET')
     A                                  9 51'NOTE: Leave ship from blank'
     A                                      DSPATR(UL)
     A                                 10 57'to get all ship froms.'
     A                                      DSPATR(UL)
     A                                 15 20'Forms Number:'
     A            VFORM          4A  B 15 46DSPATR(CS)
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A  17                                  ERRMSG('*** Entry Is Required.     -
     A                                              Press Reset')
     A                                 16 20'Number of Copies:'
     A            VCOPY          2Y 0B 16 48
     A  18                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  18                                  DSPATR(PC)
     A                                      EDTCDE(3)
     A  18                                  ERRMSG('*** Number Of Copies Is Req-
     A                                      uired.     Press Reset')
     A                                 17 20'JOBQ (Y/N):'
     A            VJOB           1X  B 17 49DSPATR(CS)
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A  19                                  ERRMSG('*** Valid Entries Are Y or -
     A                                      N.        Press Reset')
     A                                 18 20'Printer ID:'
     A            VPRTR         10A  B 18 40
     A  52                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  52                                  DSPATR(PC)
     A  52                                  ERRMSG('*** Printer ID Is Required.-
     A                                          Press Reset')
     A                                 22  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                 23  2'                  Enter to Process-
     A                                                      F3/ F7=Cancel Job  -
     A                                               '
     A                                      DSPATR(UL)
     A                                 19 26'Print Status:'
     A            VOUT           1Y 0B 19 49EDTCDE(3)
     A  53                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  53                                  DSPATR(PC)
     A  53                                  ERRMSG('*** Valid Entries Are 1, 2 -
     A                                      or 3.       Press Reset')
     A                                 19 51'1 = Print'
     A                                 20 51'2 = Print/Save'
     A                                 21 51'3 = Hold'
     A                                  1 21' Dillon Recurring Order Summary Pr-
     A                                      ompt '
     A                                      DSPATR(RI)
     A                                  4 21'Include The Following     (Y/N)'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  5 21'Standing Orders:'
     A                                  6 21'Ready Rose Orders:'
     A                                  7 21'Growers Choice Orders:'
     A            STORD          1A  B  5 49
     A  10                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(PC)
     A  10N15                               ERRMSG('*** Response must be Y or N-
     A                                      .     Press RESET')
     A            RRORD          1A  B  6 49
     A  11                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  11                                  DSPATR(PC)
     A  11N15                               ERRMSG('*** Response must be Y or N-
     A                                      .     Press RESET')
     A            GCORD          1A  B  7 49
     A  12                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  12                                  DSPATR(PC)
     A  12N15                               ERRMSG('*** Response must be Y or N-
     A                                      .     Press RESET')
     A                                 11 21'Print in order by?        (I/C)'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                 12 21'Item Number or Customer:'
     A            SORT           1A  B 12 49
     A  30                                  DSPATR(RI)
     A                                      DSPATR(CS)
     A  30                                  DSPATR(PC)
     A  30                                  ERRMSG('*** Response must be I or C-
     A                                      .     Press RESET')
     A                                  5 54' You Must select at least'
     A  15                                  DSPATR(RI)
     A N15                                  DSPATR(ND)
     A                                  6 54' one of the order types. '
     A  15                                  DSPATR(RI)
     A N15                                  DSPATR(ND)
