     A*%%TS  SD  20060321  154657  BILLB       REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      MSGALARM
     A*
     A          R TAG01001
     A*%%TS  SD  20060321  154657  BILLB       REL-V5R3M0  5722-WDS
     A                                      TEXT('Enter / Scan Cust # or enter -
     A                                      Alpha Search')
     A                                      CF03(03 'Exit')
     A                                      CF07(03)
     A                                      CF06(06 'Restart')
     A                                      OVERLAY
     A                                  1  2'TAG01001'
     A                                  1 13' Reactivate '
     A                                      DSPATR(RI)
     A                                  2  2USER
     A                                  9  2'Enter'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                  4  2'Enter the Tag Number: '
     A                                  2 13' a Tray Tag '
     A                                      DSPATR(RI)
     A                                  9  8'=OK'
     A                                  9 15'F3'
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  9 18'=End'
     A                                  3 25':'
     A                                      COLOR(PNK)
     A                                  4 25':'
     A                                      COLOR(PNK)
     A                                  5 25':'
     A                                      COLOR(PNK)
     A                                  6 25':'
     A                                      COLOR(PNK)
     A                                  7 25':'
     A                                      COLOR(PNK)
     A                                  8 25':'
     A                                      COLOR(PNK)
     A                                  9 25':'
     A                                      COLOR(PNK)
     A            TAG            8Y 0B  6  8EDTCDE(4)
     A          R MSGDATA                   SFL
     A*%%TS  SD  20040405  131906  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages')
     A                                      SFLMSGRCD(10)
     A            $#MSKY                    SFLMSGKEY
     A            $#PGMQ                    SFLPGMQ(10)
     A          R MSGCTL                    SFLCTL(MSGDATA)
     A*%%TS  SD  20040406  091800  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages Control')
     A  50                                  ALARM
     A                                      OVERLAY
     A N92                                  SFLDSP
     A N92                                  SFLDSPCTL
     A N92                                  SFLINZ
     A N92                                  SFLEND
     A                                      SFLSIZ(0002)
     A                                      SFLPAG(0001)
     A            $#PGMQ                    SFLPGMQ(10)
