     A*%%TS  SD  20160728  165821  BILLB       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      INDARA
     A                                      VLDCMDKEY(48 'Valid Function Key Pr-
     A                                      essed')
     A          R UNUSED01                  SFL
     A*%%TS  SD  20160726  134054  BILLB       REL-V7R1M0  5770-WDS
     A  28                                  SFLNXTCHG
     A*           ITEM#          5S 0O  4  3
     A            #ITEM5         5A  O  4  3
     A          R UNUSED01C                 SFLCTL(UNUSED01)
     A*%%TS  SD  20160726  133023  BILLB       REL-V7R1M0  5770-WDS
     A  *DS3                                SFLLIN(0002)
     A  *DS4                                SFLLIN(0002)
     A  *DS3                                SFLSIZ(9999)
     A  *DS4                                SFLSIZ(9999)
     A  *DS3                                SFLPAG(0187)
     A  *DS4                                SFLPAG(0085)
     A                                      CF06(06 'Cancel')
     A                                      CF10(10 'Selected with Mouse')
     A                                      KEEP
     A                                      OVERLAY
     A                                      SFLCSRRRN(&SFLCSRRRN)
     A  25 26                               SFLDSP
     A  25                                  SFLDSPCTL
     A N25                                  SFLCLR
     A N27                                  SFLEND(*SCRBAR *SCRBAR)
     A                                      MOUBTN(*ULP *ULR CF10)
     A                                      MOUBTN(*URP ROLLUP)
     A            SFLCSRRRN      5S 0H
     A                                  1  2SYSNAME
     A                                      COLOR(BLU)
     A                                  1 28'   Unused Item Inquiry   '
     A                                      DSPATR(RI)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2  2USER
     A                                      COLOR(BLU)
     A                                  2 16'Find all Unused Item Numbers betwe-
     A                                      en 1000 and 99999'
     A                                      COLOR(PNK)
     A                                  2 73TIME
     A                                      COLOR(BLU)
     A          R UNUSED01F
     A*%%TS  SD  20040621  104522  BILLB       REL-V5R1M0  5722-WDS
     A                                 22  1'                                  -
     A                                                                         -
     A                                                 '
     A                                      DSPATR(UL)
     A                                      COLOR(BLU)
     A                                 23  2'Enter'
     A                                      DSPATR(HI)
     A                                 23  8'=Continue'
     A                                      COLOR(BLU)
     A                                 23 69'F06'
     A                                      DSPATR(HI)
     A                                 23 73'=Restart'
     A                                      COLOR(BLU)
     A          R MSGDATA                   SFL
     A*%%TS  SD  20040319  114608  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages')
     A  *DS3                                SFLMSGRCD(24)
     A  *DS4                                SFLMSGRCD(24)
     A            $#MSKY                    SFLMSGKEY
     A            $#PGMQ                    SFLPGMQ
     A          R MSGCTL                    SFLCTL(MSGDATA)
     A*%%TS  SD  20040319  114608  BILLB       REL-V5R1M0  5722-WDS
     A                                      TEXT('Program Messages')
     A                                      OVERLAY
     A N92                                  SFLDSP
     A N92                                  SFLDSPCTL
     A N92                                  SFLINZ
     A N92                                  SFLEND
     A  *DS3                                SFLSIZ(0002)
     A  *DS4                                SFLSIZ(0002)
     A  *DS3                                SFLPAG(0001)
     A  *DS4                                SFLPAG(0001)
     A            $#PGMQ                    SFLPGMQ
     A          R ASSUME
     A*%%TS  SD  20040621  100219  BILLB       REL-V5R1M0  5722-WDS
     A                                      ASSUME
     A                                  1  3' '
