             PGM        PARM(&ISBATCH)

             DCL        VAR(&ISBATCH) TYPE(*LGL) VALUE('0')
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(1)

             RTVJOBA    TYPE(&TYPE)
             IF         COND(&TYPE *EQ '0') THEN(CHGVAR +
                          VAR(&ISBATCH) VALUE('1'))

             ENDPGM
