      **
     C                   CALL      '@DTCASE'
     C                   PARM                    ##UPC            60
     C                   PARM                    ##LWC            60
