     C                   CALL      '@DTBACK'
     C                   PARM                    ##MDYI            6 0
     C                   PARM                    ##MTHS            3 0
     C                   PARM                    ##NMDY            6 0
     C                   PARM                    ##ERR             1
      *
