     C                   CALL      'APR01QT'
     C                   PARM                    LCO               2 0
     C                   PARM                    VEND              6 0
      *
