     FFGLALO    UF   E             DISK
     C                   READ      FGLALO                                 90
     C                   UPDATE    RGLALO
     C                   SETON                                        LR
