      *
      *
     FKPHIST    UP   E           K DISK
      *
     C     DHPSIZ        IFEQ      'SED'
     C     DHTQTY        MULT      1000          DHTQTY
     C                   MOVEL     'DIANE'       DHUSER
     C                   UPDATE    DGHISTR
     C                   UNLOCK    KPHIST
     C                   ENDIF
