      *
      *
     FKPITMWHS  UP   E           K DISK
      *
     C     IWSIZE        IFEQ      'SED'
     C     IWQTOH        MULT      1000          IWQTOH
     C                   UPDATE    ITMWHSR
     C                   UNLOCK    KPITMWHS
     C                   ENDIF
