     C                   Z-ADD     3001          OHORD#            6 0
     C                   CALL      'GETDEP'
     C                   PARM                    OHORD#
     C                   SETON                                        LR
