     C                   Z-ADD     3001          OHORD#            6 0
     C                   Z-ADD     650.25        INVAMT
     C                   CALL      'GETPAY'
     C                   PARM                    OHORD#
     C                   PARM                    INVAMT           11 2
     C                   PARM                    PAYAMT           11 2
     C                   SETON                                        LR
