     FFMAPER    IF   E           K DISK
     C                   READ      FMAPER                                 90
     C                   SETON                                        LR
