      *********************************************************************
      *                                                                   *
      * Program?- KPZEROR                                                *
      *                                                                   *
      * Purpose?- ZERO OUT INVENTORY FIELDS                              *
      *                                                                   *
      *   Date  ?Programmer    ? Comment                             ? *
      *  11/18/03  R. Piasecki      Program Created                       *
      *                                                                   *
      *********************************************************************
     FFMINVT    UP   E           K DISK
      ********************************************************************
      * ?File Information Data Structure                                ?*
      ********************************************************************
      ********************************************************************
      * ?Program Status Data Structure                                  ?*
      ********************************************************************
     D                SDS
     D  ##PGM            *PROC
     D  ##PARM           *PARMS
     D  ##PERR                91    169
     D  ##JOB                244    253
     D  ##USER               254    263
     D  ##JOBN               264    269
     D  ##JBDT               276    281  0
     D  ##JBTM               282    287  0
      *
      ********************************************************************
      ********************************************************************
      ******************  Program Main Line?  ***************************
      ********************************************************************
      ********************************************************************
      *
      *? Program Main Loop                                ?             ?
      *
     C     IMSIZE        IFEQ      'SED'
     C                   CLEAR                   IMISSU
     C                   CLEAR                   IMBPOH
     C                   CLEAR                   IMMADJ
     C                   CLEAR                   IMMREC
     C                   CLEAR                   IMQTOH
     C                   CLEAR                   IMQTOO
     C                   UPDATE    RMINVT
     C                   ENDIF
