    ?H/COPY QFunctDefn,@CopyRight
    ?H DftActGrp(*no)
    ?H DatFmt(*usa)
    ?H BndDir('*LIBL/KPFUNCTION')
     FFSERIES   IP   E           K DISK
    ?C                   Call      'SDR700'
    ?C                   Parm                    SECODE
