             PGM
             DCL        VAR(&CLASS) TYPE(*CHAR) LEN(2) VALUE('  ')

             CALL       PGM(ATT051) PARM(&CLASS)

             ENDPGM
