             PGM
             STRDFU     OPTION(1 1) DFUPGM(KUBEPAK400/CHGDFTPRT) +
                          FILE(*LIBL/DFTPRTPF) MBR(*FIRST)
             ENDPGM
