             PGM        PARM(&N &F)
             DCL        VAR(&N) TYPE(*CHAR) LEN(10)
             DCL        VAR(&F) TYPE(*CHAR) LEN(10)

             CRTCLMOD   MODULE(&N) SRCFILE(&F) DBGVIEW(*SOURCE)
             ?          CRTPGM PGM(&N) MODULE(&N) ACTGRP(QILE)

             ENDPGM
