             PGM        PARM(&LINK)
             DCL        VAR(&LINK) TYPE(*CHAR) LEN(256)

             CRTDIR     DIR(&LINK)
             MONMSG     MSGID(CPFA0A0)

             ENDPGM
