             PGM

             RUNSQL     SQL('update fbrokdft set broker_variable_value = ''Y'' where +
                          broker_number = ''1000'' and broker_variable = ''PAUSEALLB2B''') +
                          COMMIT(*NONE)

             ENDPGM

