             PGM        PARM(&JOBNAM &JOBUSR &JOBNBR)

             DCL        VAR(&JOBNAM) TYPE(*CHAR) LEN(10)
             DCL        VAR(&JOBUSR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&JOBNBR) TYPE(*CHAR) LEN(6)

             RTVJOBA    JOB(&JOBNAM) USER(&JOBUSR) NBR(&JOBNBR)

 END:        ENDPGM
