             PGM        PARM(&LINK)
             DCL        VAR(&LINK)     TYPE(*CHAR) LEN(256)

             STRPCO
             MONMSG     MSGID(IWS4010)

             STRPCCMD   PCCMD('"//10.151.151.1' *TCAT &LINK *TCAT '"') +
                          PAUSE(*NO)
 END:        ENDPGM
