             PGM

             SBMJOB     CMD(CALL PGM(POSITIVE) PARM('      ')) +
                          JOB(SEND_PPAY) JOBD(*LIBL/KUBEPAK) +
                          JOBQ(QBATCH2) USER(QSSH)

             ENDPGM
