             PGM        PARM(&SECONDS)
             DCL        VAR(&SECONDS) TYPE(*DEC) LEN(3 0)

             DLYJOB     DLY(&SECONDS)

             ENDPGM
