             PGM        PARM(&ORDER)
             DCL        VAR(&ORDER) TYPE(*DEC) LEN(6 0)

             SBMJOB     CMD(WSORDACK ORDER(&ORDER)) JOB(WSORDACK) +
                          JOBQ(QBATCH2)

             ENDPGM
